{
  "book": "1Corinthians",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul, summoned to be an authorized emissary of Christ Jesus through the will of God, and Sosthenes our brother,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "to the assembly of God that exists in Corinth—to those who have been set apart in Christ Jesus and summoned to be holy ones, together with all those in every place who call upon the name of our Lord Jesus Christ, both their Lord and ours.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Grace to you and peace from God our Father and the Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "I always give thanks to my God concerning you for the grace of God that was given to you in Christ Jesus,",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "because in every way you were made rich in him—in every form of speech and all knowledge.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "In this way, the testimony about Christ was confirmed among you,",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "so that you do not lack any spiritual gift as you eagerly await the unveiling of our Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "He is the one who will also keep you firm until the end, so that you are irreproachable on the Day of our Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "God is faithful, and it is through him that you were summoned into the shared life of his Son, Jesus Christ our Lord.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Now I appeal to you, brothers and sisters, by the name of our Lord Jesus Christ, that you all speak in agreement and that there be no fractures among you, but that you be perfectly mended together in the same mind and in the same conviction.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "For it has been made clear to me concerning you, my brothers and sisters, by Chloe’s people, that there are rivalries among you.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "What I mean is this: each of you is saying, “I belong to Paul,” or “I belong to Apollos,” or “I belong to Cephas,” or “I belong to Christ.”",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Has Christ been sliced into pieces? Was Paul crucified for you? Or were you baptized into the name of Paul?",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "I am thankful that I baptized none of you except Crispus and Gaius,",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "so that no one can say you were baptized into my name.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "(I also baptized the household of Stephanas; beyond that, I do not know if I baptized anyone else.)",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For Christ did not send me to baptize but to proclaim the good news—and not with cleverness of speech, so that the cross of Christ would not be emptied of its power.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For the logic of the cross is absurdity to those who are perishing, but to us who are being saved, it is the power of God.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "For it stands written: *I will destroy the wisdom of the wise, and the intelligence of the intelligent I will discard.*",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Where is the philosopher? Where is the scholar? Where is the skilled debater of this age? Has God not made the wisdom of this world look like nonsense?",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For since, in the wisdom of God, the world through its wisdom did not come to know God, God was pleased through the absurdity of the proclamation to save those who believe.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Since Jews demand signs and Greeks seek wisdom,",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "we proclaim a crucified Christ—a scandal to Jews and absurdity to the nations,",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "but to those who are summoned, both Jews and Greeks, Christ is the power of God and the wisdom of God.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "For the \"absurdity\" of God is wiser than human wisdom, and the \"weakness\" of God is stronger than human strength.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Consider your own calling, brothers and sisters: not many of you were wise by human standards, not many were powerful, not many were of noble birth.",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "Instead, God chose the absurd things of the world to shame the wise; God chose the weak things of the world to shame the strong.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "God chose the low-born and the despised things of the world—the \"nobodies\"—to render the \"somebodies\" powerless,",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "so that no human being might boast in the presence of God.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "But it is because of him that you are in Christ Jesus, who became wisdom for us from God—as well as our righteousness, holiness, and redemption—",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "so that, as it stands written: *The one who boasts, let him boast in the Lord.*",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Summoned\" (v. 1, 2, 24)**: The Greek *klētos* (and the related *klēsin* in v. 26) carries a stronger sense than a mere \"call.\" In a first-century context, it suggests a formal summons or a divine designation to a specific role or status.\n\n**\"Authorized emissary\" (v. 1)**: *Apostolos* refers to a messenger sent with the full authority of the sender. \"Apostle\" has become a religious title that obscures this functional, legal weight.\n\n**\"Assembly\" (v. 2)**: *Ekklēsia* was a secular term for a gathering of citizens called out to conduct the business of a city. \"Church\" carries centuries of institutional baggage that \"assembly\" avoids, reflecting the organic nature of the early Christ-following communities.\n\n**\"Unveiling\" (v. 7)**: *Apokalypsis* means an uncovering or disclosure of something previously hidden. \"Revelation\" is traditional, but \"unveiling\" better captures the visual and immediate nature of the event Paul describes.\n\n**\"Shared life\" (v. 9)**: *Koinōnia* is often translated as \"fellowship,\" but in the first century, it referred to a close-knit partnership, a business joint-venture, or a common participation in a reality. \"Shared life\" reflects this deep, participatory bond.\n\n**\"Mended together\" (v. 10)**: *Katērtismenoi* is a medical or mechanical term used for setting bones or mending fishing nets. It suggests restoring something to its intended, functional wholeness.\n\n**\"Sliced into pieces\" (v. 13)**: *Memeristai* (from *merizō*) means to divide or separate into parts. Given the context of factions \"claiming\" Christ, the translation \"sliced into pieces\" highlights the absurdity Paul is pointing out—that Christ cannot be partitioned as a sectarian leader.\n\n**\"Logic of the cross\" (v. 18)**: *Ho logos tou staurou*. While *logos* often means \"word\" or \"message,\" Paul is contrasting two different ways of \"reasoning\" or \"ordering\" the world. The \"logic\" of the cross is the internal rational structure of God’s plan, which defies human \"logic.\"\n\n**\"Absurdity/Nonsense\" (vv. 18, 21, 23, 25)**: *Mōria* is the root of \"moron.\" To a first-century Roman or Greek, the idea of a crucified God was not just \"foolish\" in a mild sense; it was intellectually offensive, হাস্যоπιστη (ridiculous), and logically impossible.\n\n**\"Scandal\" (v. 23)**: *Skandalon* refers to the trigger-stick of a trap or a stone that causes someone to trip. To the Jewish expectation of a triumphant Messiah, a crucified one was a visceral obstacle to belief.\n\n**\"The nobodies... to render the somebodies powerless\" (v. 28)**: Paul uses *ta mē onta* (the things that are not) and *ta onta* (the things that are). This is ontological language used rhetorically to describe social status. God uses those the world considers non-existent to \"deactivate\" or \"render powerless\" (*katargēse*) those the world considers significant."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "When I came to you, brothers and sisters, I did not come proclaiming the testimony of God with the kind of rhetorical brilliance or philosophical sophistication that people prize.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For I determined that while I was among you, I would know nothing except Jesus Christ—and him specifically as the one who was crucified.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Indeed, I came before you in a state of weakness, with fear and much trembling.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "My speech and my proclamation were not based on the persuasive charms of human wisdom, but on a demonstration of the Spirit’s power,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "so that your faith would not rest on human philosophy, but on the power of God.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Now, we do speak a type of wisdom among those who are mature, but it is not the wisdom of this current age or of the rulers of this age, who are even now being rendered powerless.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Rather, we speak God’s wisdom in a sacred secret—a wisdom that remained hidden until now, which God decreed before the ages for our glory.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "None of the rulers of this age understood it; for if they had, they would not have crucified the Lord of Glory.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "But as it is written: “What no eye has seen, what no ear has heard, and what has never dawned on a human heart—these are the things God has prepared for those who love him.”",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For God has unveiled these things to us through the Spirit. The Spirit probes all things, even the deepest mysteries of God.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "For who among humans knows a person’s inner thoughts except the human spirit that dwells within them? In the same way, no one knows the thoughts of God except the Spirit of God.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Now, we have not received the spirit of the world-system, but the Spirit that comes from God, so that we might recognize the things graciously bestowed on us by God.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "We also speak of these things, not in words taught by human wisdom, but in words taught by the Spirit, interpreting spiritual truths with spiritual terms.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "The person limited to their natural soul does not welcome the things of the Spirit of God; they are nonsense to him. He is unable to understand them because they are evaluated through the Spirit.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "But the spiritual person evaluates all things, yet is himself evaluated by no one.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For “who has known the mind of the Lord so as to advise him?” But we possess the mind of Christ.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Rhetorical brilliance or philosophical sophistication\" (v. 1)**: The Greek *hyperochēn logou ē sophias* refers to the \"loftiness\" or \"superiority\" of speech and wisdom. In the context of first-century Corinth, this specifically targeted the professional rhetoricians and Sophists who were judged by their oratorical style and intellectual complexity.\n\n**\"The one who was crucified\" (v. 2)**: The Greek *touton estaurōmenon* uses a perfect participle, emphasizing not just a past event, but a continuing state or identity. Paul isn't just preaching a historical event, but a \"Crucified Messiah\"—a concept that was a contradiction in terms (a \"stumbling block\") to the original audience.\n\n**\"Sacred secret\" (v. 7)**: The word *mysterion* does not mean a \"mystery\" to be solved (like a riddle), but a divine secret that remains hidden from the world until God chooses to reveal it to his initiates.\n\n**\"Rulers of this age\" (v. 6, 8)**: The term *archontōn* likely carries a double meaning for the original audience, referring both to the human authorities (like Pilate and the Sanhedrin) and the malevolent cosmic powers or \"principalities\" that Paul believed operated behind the world's power structures.\n\n**\"What has never dawned on a human heart\" (v. 9)**: The Greek idiom *epi kardian anthrōpou ouk anebē* literally means \"did not come up upon the heart of man.\" It refers to the limits of human imagination and intuition.\n\n**\"Interpreting spiritual truths with spiritual terms\" (v. 13)**: The Greek *pneumatikois pneumatika sunkrinontes* is notoriously difficult. The verb *sunkrinō* can mean \"combine,\" \"compare,\" or \"interpret.\" Because the preceding clause discusses \"words taught by the Spirit,\" the translation \"interpreting spiritual truths with spiritual terms\" (matching spiritual content with spiritual language) best fits the contrast with \"human wisdom.\"\n\n**\"The person limited to their natural soul\" (v. 14)**: The Greek *psychikos* refers to someone operating solely on the level of the *psyche* (the natural human life-force or \"soul\"). In Paul’s anthropology, this is the person who lacks the *pneuma* (Spirit). Translating it as \"unspiritual\" is common but loses the specific contrast Paul is making between the \"soulish\" person and the \"spiritual\" (*pneumatikos*) person.\n\n**\"Evaluates / Evaluated\" (v. 14-15)**: The verb *anakrinō* involves judicial or investigative scrutiny. The \"natural\" person lacks the necessary \"spiritual\" faculty to sit in judgment of things belonging to the Spirit's realm."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "And I, brothers and sisters, was not able to speak to you as people guided by the Spirit, but as people made of flesh—as mere infants in Christ.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I gave you milk to drink, not solid food, for you were not yet ready for it. In fact, even now you are not ready,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "because you are still dominated by the flesh. For as long as there is jealousy and strife among you, are you not flesh-dominated and walking according to the standards of this world?",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For when one says, “I belong to Paul,” and another, “I belong to Apollos,” are you not acting like mere humans?",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "What, then, is Apollos? And what is Paul? They are servants through whom you came to believe, as the Lord assigned to each.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "I planted, Apollos watered, but God was the one causing the growth.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "So then, neither the one who plants nor the one who waters is anything, but only God who causes the growth.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "The one who plants and the one who waters are a single unit, and each will receive his own reward according to his own labor.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For we are God’s coworkers; you are God’s cultivated field, God’s building.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "According to the grace of God given to me, like a skilled master builder I laid a foundation, and someone else is building upon it. But let each person be careful how he builds upon it.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "For no one can lay any foundation other than the one that is already laid, which is Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Now if anyone builds on the foundation with gold, silver, precious stones, wood, hay, or straw,",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "each person’s work will become clearly visible. For the Day will make it known, because it is revealed by fire, and the fire itself will test what kind of work each person has done.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "If the work someone has built survives, that person will receive a reward.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "If someone’s work is burned up, he will suffer the loss of it, though he himself will be saved—but only as one escaping through a fire.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Do you not know that you all are God’s sanctuary and that God’s Spirit lives in your midst?",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "If anyone destroys God’s sanctuary, God will destroy that person; for God’s sanctuary is holy, and that is what you are.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Let no one deceive himself. If anyone among you thinks he is wise in this age, let him become a “fool” so that he may become truly wise.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "For the wisdom of this world is foolishness in God’s sight. For it is written: *He catches the wise in their own craftiness*,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "and again: *The Lord knows the reasonings of the wise, that they are futile.*",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "So then, let no one boast in human leaders. For everything belongs to you—",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "whether Paul or Apollos or Cephas, or the world or life or death, or things present or things to come—everything belongs to you,",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "and you belong to Christ, and Christ belongs to God.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"People made of flesh\" / \"Flesh-dominated\" (v. 1, 3)**: Paul uses two slightly different words: *sarkinos* (v. 1) and *sarkikos* (v. 3). The first (*sarkinos*) refers to the material or nature—they are \"made of flesh,\" emphasizing their fragility and lack of spiritual development (infancy). The second (*sarkikos*) refers to their orientation or behavior—they are \"fleshly\" or \"flesh-dominated,\" meaning they are choosing to act according to their lower human nature rather than the Spirit.\n\n**\"Mere humans\" (v. 4)**: The Greek *anthrōpoi* here implies humans acting apart from the influence of God. To \"act like humans\" in this context is to fall back into the factionalism and petty rivalries of the unredeemed world.\n\n**\"A single unit\" (v. 8)**: The Greek *hen eisin* literally means \"they are one.\" This does not mean they are the same person, but that they are on the same team, working toward the same goal. They are a single functional unit in God's economy.\n\n**\"God’s coworkers\" (v. 9)**: The genitive *theou* (of God) indicates possession rather than equal partnership. They are workers who belong to God, working together in His service.\n\n**\"Cultivated field\" (v. 9)**: The Greek *geōrgion* refers specifically to land that is being worked or farmed, continuing the \"planting and watering\" metaphor.\n\n**\"Master builder\" (v. 10)**: *Architektōn* is the root of \"architect,\" but in the first century, it referred to the one who both designed and oversaw the actual construction. \"Skilled\" captures the nuance of *sophos* (wise) when applied to a craft or trade.\n\n**\"Precious stones\" (v. 12)**: In the context of building, *lithous timious* usually refers to expensive building materials like marble, granite, or porphyry, rather than small gems or jewelry. These are materials that, like gold and silver, can withstand fire.\n\n**\"Suffer the loss\" (v. 15)**: *Zēmiōthēsetai* is a commercial and legal term. It refers to forfeiting a reward or suffering a penalty. The builder is saved, but their \"paycheck\" for the work—the reward for their labor—is lost.\n\n**\"Sanctuary\" (v. 16, 17)**: Paul uses *naos* rather than *hieron*. While *hieron* refers to the entire temple precinct, *naos* refers specifically to the inner sanctuary, the dwelling place of the deity. Furthermore, the \"you\" (*este*) is plural, indicating that the community as a whole, not just the individual, constitutes this sanctuary.\n\n**\"Destroys... destroy\" (v. 17)**: Paul uses the same verb (*phtheirō*) for both actions, creating a rhetorical link: the punishment fits the crime. To \"corrupt\" or \"ruin\" the community is to invite \"ruin\" or \"destruction\" from God.\n\n**\"Reasonings\" (v. 20)**: *Dialogismous* refers to the internal arguments, calculations, or sophisticated musings of those who pride themselves on their intellect."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "This is how people should regard us: as subordinates of Christ and stewards of God’s hidden secrets.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Now, in this matter of stewardship, what is fundamentally required is that a person be found trustworthy.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "But to me, it matters very little if I am cross-examined by you or by any human court. In fact, I do not even sit in judgment of myself.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For my conscience is clear, but that does not mean I have been acquitted. The one who examines me is the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Therefore, do not pass judgment before the appointed time, until the Lord comes. He will bring to light what is hidden in darkness and expose the inner motives of the heart. Then, each person’s commendation will come from God.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Brothers and sisters, I have applied these things to myself and Apollos as an illustration for your benefit. I did this so that, through us, you might learn the meaning of the saying, “Do not go beyond what is written,” so that none of you will be puffed up with pride by favoring one leader over another.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "For who makes you superior to anyone else? What do you have that you did not receive? And if you did receive it, why do you boast as if you had not?",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Already you have all the spiritual food you want! Already you have become rich! You have begun to reign like kings—and without us! I wish you really were reigning, so that we might reign with you.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "For it seems to me that God has put us apostles on display at the very end of the procession, like men condemned to die in the arena. We have become a spectacle to the whole world—to angels as well as to humans.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "We are fools for Christ’s sake, but you are so “wise” in Christ! We are weak, but you are “strong”! You are “honored,” but we are treated with contempt!",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "To this very hour we go hungry and thirsty, we are poorly clothed and brutally treated, and we have no permanent home.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "We wear ourselves out working with our own hands. When we are insulted, we speak a blessing; when we are persecuted, we endure it;",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "when we are slandered, we respond with kind words. We have become like the scum of the earth, the refuse of all things, even until now.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "I am not writing these things to shame you, but to counsel you as my beloved children.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "For even if you had ten thousand guardians in Christ, you do not have many fathers. In Christ Jesus, through the gospel, I became your father.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Therefore, I urge you: become imitators of me.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "This is why I sent Timothy to you. He is my beloved and faithful child in the Lord. He will remind you of my ways of life in Christ Jesus, just as I teach everywhere in every assembly.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Some of you have become arrogant, as if I were not coming to see you.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "But I will come to you soon, if the Lord wills, and I will find out not just what these arrogant people are saying, but what power they actually have.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For the Kingdom of God is not a matter of talk, but of power.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "What do you prefer? Should I come to you with a rod of discipline, or in love and with a spirit of gentleness?",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Subordinates\" (v. 1)**: The Greek *hypēretas* originally referred to \"under-rowers\" on a ship. By the first century, it denoted assistants or attendants acting under a superior’s authority. This emphasizes Paul’s functional submission to Christ.\n\n**\"Human court\" (v. 3)**: The Greek *anthrōpinēs hēmeras* literally means \"human day.\" This is a Jewish-style idiom contrasting human judgment with the \"Day of the Lord\" (God’s judgment). Translating it as \"human court\" captures the judicial setting Paul is invoking.\n\n**\"Puffed up\" (v. 6, 18, 19)**: The verb *physioō* refers to being inflated or bellows-blown. It is a favorite term of Paul’s in 1 Corinthians to describe the Corinthians' intellectual and spiritual conceit.\n\n**\"Do not go beyond what is written\" (v. 6)**: This is likely a shorthand reference to a well-known maxim or a principle of staying within the bounds of the Hebrew Scriptures (the Tanakh). \n\n**\"Procession... spectacle\" (v. 9)**: Paul uses the imagery of a Roman triumphal procession (*theatron*). The \"last\" in the parade were the *epithanatious*—those condemned to die in the arena at the end of the day's games.\n\n**\"Scum... refuse\" (v. 13)**: These terms (*perikatharmata* and *peripsēma*) refer to the dirt wiped off a surface or the filth removed during a cleaning. In some contexts, these words were also used for \"scapegoats\"—the lowest members of society sacrificed to appease gods during a plague.\n\n**\"Guardians\" (v. 15)**: A *paidagōgos* was not a \"teacher\" in the modern sense, but a slave entrusted with the moral supervision, protection, and discipline of a child. Paul contrasts this functional, often harsh role with his own role as a \"father\" who gave them life through the gospel.\n\n**\"Gentleness\" (v. 21)**: The Greek *prautētos* (from *praus*) describes \"gentle strength\"—power that is under control. In this context, it is the alternative to the \"rod\" of corrective discipline."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "It is actually reported that there is sexual immorality among you, and of a kind that does not even exist among the pagans—that a man is living in a sexual union with his father’s wife.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And you are inflated with self-importance! Should you not instead have gone into mourning, so that the one who has done this deed would be removed from your midst?",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For my part, though I am absent in body, I am present in spirit; and as one who is present, I have already passed judgment on the man who has acted this way.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "In the name of our Lord Jesus, when you are assembled and my spirit is with you, along with the power of our Lord Jesus,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "you are to hand this man over to Satan for the destruction of his fleshly nature, so that his spirit may be saved on the day of the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Your boasting is not good. Do you not know that a little leaven permeates the entire batch of dough?",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Clean out the old leaven so that you may be a fresh batch of dough, just as you really are—unleavened. For Christ, our Passover lamb, has been sacrificed.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Therefore, let us keep the festival, not with the old leaven of malice and wickedness, but with the unleavened bread of sincerity and truth.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "I wrote to you in my letter not to associate with the sexually immoral—",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "not meaning at all the immoral people of this world, or the greedy and swindlers, or idolaters, since you would then have to leave the world altogether.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "But now I am writing to you not to associate with anyone who calls himself a brother if he is sexually immoral, or greedy, or an idolater, or a verbal abuser, or a drunkard, or a swindler. Do not even eat with such a person.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For what business is it of mine to judge those outside? Is it not those inside whom you are to judge?",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "God will judge those outside. Expel the wicked person from among yourselves.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Sexual immorality\" (v. 1, 9, 11)**: The Greek *porneia* is a broad term for any sexual activity outside the boundaries established by the Torah. In this context, it refers specifically to a form of incest (with a stepmother) that was prohibited both by Jewish Law (Leviticus 18:8) and Roman Law.\n\n**\"Inflated with self-importance\" (v. 2)**: The verb *phusioō* means to puff up or inflate. It suggests the Corinthians were prideful, perhaps regarding their \"liberty\" or spiritual status, which led them to tolerate what even the surrounding culture condemned.\n\n**\"Living in a sexual union\" (v. 1)**: The Greek *echein* (to have) is a common euphemism for a settled sexual or marital relationship, rather than a one-time occurrence.\n\n**\"Destruction of his fleshly nature\" (v. 5)**: The Greek *sarx* (flesh) here likely refers to the \"lower nature\" or the carnal impulses that led to the sin, rather than the physical body itself. The goal of this \"handing over to Satan\" (excommunication) is redemptive: to destroy the sinful influence so the person might ultimately be saved.\n\n**\"Passover lamb\" (v. 7)**: Paul utilizes the imagery of the Jewish Passover (*Pesach*). Before the festival, all leaven (*zymē*)—a symbol of fermentation and corruption—had to be purged from the house. Paul identifies Jesus as the sacrificial lamb and the church as the \"unleavened\" (pure) community.\n\n**\"Verbal abuser\" (v. 11)**: The term *loidoros* refers to someone who uses speech to insult, slander, or blacken the character of others. It is more than just someone who is \"rude\"; it describes a person who uses language as a weapon.\n\n**\"Swindler\" (v. 10, 11)**: *Harpax* refers to one who seizes by force or through fraudulent schemes—an extortioner or a predatory exploiter of others.\n\n**\"Expel the wicked person from among yourselves\" (v. 13)**: This is a direct rhetorical echo of a repeated command in the Septuagint (the Greek Old Testament), specifically from Deuteronomy (e.g., Deut 17:7, 19:19, 22:21). Paul is applying the covenantal discipline of Israel to the new assembly of believers."
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "Does any of you, when you have a legal dispute against another, dare to go to court before the unrighteous rather than before the holy ones?",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Or do you not know that the holy ones will judge the world? And if the world is to be judged by you, are you incompetent to preside over the most trivial tribunals?",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Do you not know that we will judge angels? How much more, then, the matters of this ordinary life?",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "So if you have legal disputes regarding matters of this life, do you actually appoint as judges those who have no standing in the assembly?",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "I say this to your shame. Is it possible that there is not one wise person among you who is capable of arbitrating between his own brothers?",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Instead, brother goes to court against brother, and this before those who have no faith!",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "To have lawsuits with one another at all is already a complete moral defeat for you. Why not rather be wronged? Why not rather be defrauded?",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Instead, you yourselves are the ones wronging and defrauding—and you do this to your own brothers and sisters!",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Or do you not know that the unrighteous will not inherit the kingdom of God? Do not be misled: neither the sexually immoral, nor idolaters, nor adulterers, nor those who submit to sexual passivity, nor men who sleep with men,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "nor thieves, nor the greedy, nor drunkards, nor verbal abusers, nor swindlers will inherit the kingdom of God.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And that is what some of you were. But you washed yourselves clean, you were set apart as holy, you were made right with God in the name of the Lord Jesus and by the Spirit of our God.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "“Everything is permitted for me,” you say—but not everything is beneficial. “Everything is permitted for me”—but I will not be mastered by anything.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "“Food is for the stomach and the stomach for food,” you say—but God will bring an end to both of them. The body, however, is not for sexual immorality but for the Lord, and the Lord for the body.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And God, who raised the Lord, will also raise us up through his power.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Do you not know that your bodies are actual limbs of Christ? Should I then take the limbs of Christ and make them limbs of a prostitute? Absolutely not!",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "Or do you not know that the one who joins himself to a prostitute is one body with her? For it says, *The two shall become one flesh.*",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "But the one who joins himself to the Lord is one spirit with him.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Flee from sexual immorality! Every other sin a person commits is outside the body, but the person who engages in sexual immorality sins against their own body.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Or do you not know that your body is a sanctuary of the Holy Spirit who is within you, whom you have received from God? You do not belong to yourselves;",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "you were bought and paid for. Therefore, use your body to bring glory to God.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The unrighteous\" (v. 1)**: The Greek *adikōn* refers specifically to those outside the covenant community, contrasting with the *hagiōn* (\"holy ones\"). In a legal context, it refers to pagan judges who do not operate under God’s standards of justice.\n\n**\"Holy ones\" (v. 1, 2)**: The Greek *hagioi* (traditionally \"saints\") refers to the community set apart for God. \"Holy ones\" preserves the sense of a distinct identity and status that Paul argues makes them fit for judgment.\n\n**\"Ordinary life\" / \"Matters of this life\" (v. 3, 4)**: The Greek *biōtika* refers to things pertaining to daily, biological, or social existence (from *bios*), as opposed to spiritual or eternal realities.\n\n**\"No standing in the assembly\" (v. 4)**: The Greek *exouthenēmenous* means \"those who are treated with contempt\" or \"considered of no account.\" Paul is likely being ironic or sarcastic here, suggesting that by going to pagan courts, they are seeking judgment from people whose moral standing the church should not even recognize.\n\n**\"Those who submit to sexual passivity\" / \"Men who sleep with men\" (v. 9)**: These terms (*malakoi* and *arsenokoitai*) are notoriously difficult. *Malakoi* literally means \"soft\" and in 1st-century sexual discourse referred to the passive partner in male-male sexual acts, or more broadly to a man who lacked self-control and adopted feminine mannerisms. *Arsenokoitai* is a compound word (male-bedders) likely derived from the Septuagint’s prohibition of male-male sex in Leviticus. Together, they address the roles in the same-sex practices common in the Greco-Roman world.\n\n**\"Washed yourselves clean\" (v. 11)**: The verb *apelousasthe* is in the middle voice, which can imply \"you allowed yourselves to be washed\" or \"you washed yourselves,\" referring to the transformative event of baptism.\n\n**\"Everything is permitted\" (v. 12)**: Most scholars agree this was a Corinthian slogan (possibly a misunderstanding of Paul’s own teaching on grace) that Paul is quoting and then qualifying.\n\n**\"Mastered\" (v. 12)**: Paul uses a wordplay here. The Corinthians say they have \"authority/power\" (*exestin*) to do anything; Paul responds that he will not be \"brought under the power\" (*exousiasthēsomai*) of anything.\n\n**\"Sanctuary\" (v. 19)**: The Greek *naos* refers specifically to the inner shrine or the dwelling place of the deity, rather than the general temple complex (*hieron*). This emphasizes the extreme sacredness of the physical body.\n\n**\"Bought and paid for\" (v. 20)**: The Greek *ēgorasthēte timēs* uses the language of the slave market (manumission). When a slave was \"bought with a price,\" they often became the property of a god or were freed from a human master, but Paul uses it to show that the believer now belongs entirely to a new Master."
    },
    {
      "chapter": 7,
      "verses": [
        {
          "verse": 1,
          "text": "Now, concerning the matters you wrote about: “It is good for a man to have no sexual relations with a woman.”",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "However, because of the various forms of sexual immorality that are prevalent, let each man have his own wife and each woman her own husband.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "The husband must fulfill his sexual obligation to his wife, and likewise the wife to her husband.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "The wife does not have exclusive authority over her own body, but the husband does; and in the same way, the husband does not have exclusive authority over his own body, but the wife does.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Do not deprive one another of sexual intimacy, unless it is by mutual agreement for a limited time so that you may devote yourselves to prayer, and then come together again. This is so that Satan does not tempt you through your lack of self-control.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "I say this as a concession, not as a command.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "I wish that everyone were as I am; but each person has their own specific grace-gift from God—one of this kind, and another of that.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "To the unmarried and the widows I say: it is good for them if they remain as I am.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "But if they cannot exercise self-control, they should marry, for it is better to marry than to be consumed by the fire of passion.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "To those who are already married I give this charge—not I, but the Lord: a wife must not be separated from her husband",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "(but if she is separated, she must remain unmarried or else be reconciled to her husband) and a husband must not divorce his wife.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "To the rest I say—I, not the Lord: if any brother has a wife who is not a believer and she is willing to live with him, he must not divorce her.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "And if any woman has a husband who is not a believer and he is willing to live with her, she must not divorce the husband.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For the husband who is not a believer has been brought into the sphere of holiness through his wife, and the wife who is not a believer has been brought into the sphere of holiness through the brother. Otherwise, your children would be \"unclean,\" but as it is, they are holy.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "But if the unbeliever chooses to separate, let them separate. In such cases, the brother or sister is not enslaved; God has called us to live in peace.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For how do you know, wife, whether you will save your husband? Or how do you know, husband, whether you will save your wife?",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Regardless of the circumstances, each person should continue to live in the state the Lord assigned to them, just as they were when God called them. This is the rule I lay down in all the churches.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Was anyone already circumcised when he was called? He should not try to undo it. Was anyone uncircumcised when he was called? He should not be circumcised.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Circumcision is nothing and uncircumcision is nothing; what matters is keeping God’s commandments.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Let each person remain in the condition in which they were called.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Were you a slave when you were called? Do not let it trouble you. But if you are indeed able to become free, take advantage of the opportunity.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "For the slave who was called in the Lord is the Lord’s freedman; likewise, the free person who was called is Christ’s slave.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "You were bought with a price; do not become slaves of men.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Brothers, let each person remain with God in the state in which they were called.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Now concerning those who have never been married, I have no command from the Lord, but I give my opinion as one who, by the Lord’s mercy, is trustworthy.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "I think, then, that because of the impending crisis, it is good for a person to remain as they are.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Are you bound to a wife? Do not seek a release. Are you released from a wife? Do not seek a wife.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "But even if you do marry, you have not sinned; and if a young woman marries, she has not sinned. Yet those who marry will have worldly trouble, and I am trying to spare you.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "This is what I mean, brothers: the remaining time has been compressed. From now on, let even those who have wives live as though they had none,",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "and those who weep as though they were not weeping, and those who rejoice as though they were not rejoicing, and those who buy as though they had no claim on what they bought,",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "and those who use the things of the world as though they were not fully occupied by them. For the outward form of this world is passing away.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "I want you to be free from anxieties. The unmarried man is anxious about the things of the Lord—how he may please the Lord.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "But the married man is anxious about the things of the world—how he may please his wife—",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "and his interests are divided. The woman who is no longer married and the young woman who has never married are anxious about the things of the Lord, so that they may be holy in both body and spirit. But the married woman is anxious about the things of the world—how she may please her husband.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "I am saying this for your own benefit, not to put a noose around your neck, but to promote what is appropriate and to allow you to be devoted to the Lord without distraction.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "If anyone thinks he is behaving improperly toward his betrothed, if his passions are strong and it has to be this way, let him do what he wants; he is not sinning. Let them marry.",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "But the man who stands firm in his heart, being under no necessity but having authority over his own will, and has decided this in his own heart—to keep his betrothed as she is—he will do well.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "So then, the one who marries his betrothed does well, but the one who does not marry her will do better.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "A wife is bound to her husband as long as he lives. But if her husband falls asleep in death, she is free to be married to whomever she wishes, only in the Lord.",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "But in my opinion, she is more blessed if she remains as she is—and I think that I, too, have the Spirit of God.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Have no sexual relations\" (v. 1)**: The Greek *haptesthai* (literally \"to touch\") is a recognized euphemism in Koine Greek for sexual intercourse. Paul is likely quoting a slogan from the Corinthians' letter here.\n\n**\"Specific grace-gift\" (v. 7)**: The Greek *charisma* refers to a gift of God's grace. Paul applies this term not just to miraculous abilities but to the state of being celibate or married, suggesting these are divinely empowered vocations rather than just human choices.\n\n**\"Consumed by the fire of passion\" (v. 9)**: The Greek *pyrousthai* means \"to be set on fire.\" While often translated simply as \"burn,\" it refers to the internal heat of sexual desire that threatens to overwhelm one's self-control.\n\n**\"Brought into the sphere of holiness\" (v. 14)**: The Greek *hēgiastai* (\"sanctified\") often implies a moral transformation, but in this context, it refers to a \"covenantal\" or \"relational\" sanctification. The unbelieving spouse is not \"saved\" automatically but is \"set apart\" or brought into the influence of God's people because of the marriage bond.\n\n**\"Not enslaved\" (v. 15)**: The verb *ou dedoulōtai* is strong. It implies that the \"bond\" of marriage (the \"yoke\") is dissolved when the unbelieving partner leaves, freeing the believer from the legal or moral obligation to maintain the union.\n\n**\"Lord’s freedman\" (v. 22)**: *Apeleutheros* refers specifically to a former slave who has been manumitted but still maintains a relationship with their former master (now a patron). This captures the paradox of Christian liberty: freed from sin, yet bound to Christ.\n\n**\"Impending crisis\" (v. 26)**: *Enestōsan anagkēn* can mean \"present necessity\" or \"impending distress.\" Given the context of the \"compressed time\" (v. 29) and the \"passing away\" of the world (v. 31), it refers to the social and spiritual pressures preceding the *Parousia* (the return of Christ).\n\n**\"The outward form of this world\" (v. 31)**: *Schema* refers to the external appearance or the \"fashion\" of the age. Paul uses a theatrical metaphor; the \"set\" of the world is being changed.\n\n**\"Noose around your neck\" (v. 35)**: *Brochon* refers to a snare or a rope used to tie an animal. Paul is clarifying that his advice is not meant to \"trap\" them into a lifestyle they cannot maintain.\n\n**\"His betrothed\" (vv. 36–38)**: The Greek *parthenos* (\"virgin\") in this passage is historically interpreted as either a father’s daughter or a man’s fiancée. The context of \"behaving improperly\" and the man's \"own will\" and \"desire\" strongly suggests a man and his fiancée. Traditional translations using \"give in marriage\" (*gamizōn*) for verse 38 often favor the \"father\" view, but in Koine, this verb can simply mean \"to marry.\"\n\n**\"Falls asleep in death\" (v. 39)**: *Koimēthē* is the standard New Testament euphemism for the death of a believer, emphasizing the hope of resurrection."
    },
    {
      "chapter": 8,
      "verses": [
        {
          "verse": 1,
          "text": "Now concerning meat sacrificed to idols: we know that \"we all have knowledge.\" This \"knowledge\" inflates a person with pride, but love builds others up.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "If anyone thinks they have attained some specialized knowledge, they do not yet know it in the way they are required to know.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "But if anyone loves God, that person is known by him.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Regarding the eating of food sacrificed to idols, then: we know that \"an idol is nothing in the world\" and that \"there is no God but one.\"",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "For even if there are so-called \"gods,\" whether in heaven or on earth—and indeed there are many \"gods\" and many \"lords\"—",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "yet for us there is one God, the Father, from whom all things come and for whom we exist; and one Lord, Jesus Christ, through whom all things were made and through whom we live.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "However, not everyone possesses this knowledge. Some, because of their long-standing habituation to idols, still eat such food as if it were a literal sacrifice to a god, and their conscience, being weak, is defiled.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Food will not bring us into God’s presence. We are no worse off if we do not eat, and no better off if we do.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "But be careful that this freedom of yours does not somehow become a stumbling block to those who are weak.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For if someone sees you—the one who has \"knowledge\"—dining in an idol’s temple, will not their conscience, because it is weak, be \"built up\" to eat things sacrificed to idols?",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "In this way, the weak brother or sister, for whom Christ died, is destroyed by your \"knowledge.\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "When you sin against your brothers and sisters in this way, striking blows against their weak conscience, you are sinning against Christ.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Therefore, if food causes my brother or sister to fall, I will never eat meat again—never, until the end of the age—so that I do not cause them to stumble.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Knowledge\" (v. 1, 10, 11)**: Throughout this passage, Paul appears to be quoting slogans back to the Corinthians (likely from their own letter to him). Phrases like \"we all have knowledge\" and \"an idol is nothing\" are set apart as \"Corinthian slogans\" to show that while they may be factually true, they are being applied without love.\n\n**\"Inflates... builds up\" (v. 1)**: The Greek *physioi* refers to being puffed up or inflated like a bellows, emphasizing an empty expansion of the ego. This stands in contrast to *oikodomei*, an architectural term meaning to build a structure. Knowledge expands the self; love expands the community.\n\n**\"Known by him\" (v. 3)**: In the context of \"knowledge\" (*gnosis*), Paul performs a rhetorical pivot. The goal of the Christian life is not the believer's autonomous mastery of facts (*ginōskō*), but being the object of God’s own knowing. This echoes the Hebrew concept of *yada* (to know), which implies an intimate, covenantal relationship.\n\n**\"One God... one Lord\" (v. 6)**: This verse is a Christian adaptation of the *Shema* (Deuteronomy 6:4: \"The LORD our God, the LORD is one\"). Paul is re-centering the ultimate Jewish confession of monotheism around both the Father and the Messiah. The prepositions are precise: *ex* (source) and *eis* (goal) for the Father; *dia* (agency) for the Son.\n\n**\"Habituation\" (v. 7)**: The Greek *synētheia* refers to a custom, practice, or intimacy. These \"weak\" believers aren't just confused; they have spent their lives in a cultural environment where eating meat was inextricably linked to the reality of the idol. They cannot simply \"turn off\" that association.\n\n**\"Built up\" (v. 10)**: Paul uses the word *oikodomēthēsetai* ironically here. In verse 1, he said love \"builds up.\" Here, he says a weak person is \"built up\" to do something that violates their conscience. Most translations use \"emboldened\" to make the sense clear, but this obscures Paul’s biting wordplay: the \"knowledge\" of the strong is \"building up\" the weak toward their own destruction.\n\n**\"Striking blows\" (v. 12)**: The verb *typtontes* means to hit, beat, or strike. It suggests a violent action. To disregard a sibling's conscience is not a passive oversight; it is an act of spiritual violence against them.\n\n**\"Until the end of the age\" (v. 13)**: The Greek *eis ton aiōna* is often translated simply as \"forever\" or \"never,\" but it carries the weight of \"unto the age.\" Paul is expressing a commitment that lasts as long as this present age of stumbling lasts."
    },
    {
      "chapter": 9,
      "verses": [
        {
          "verse": 1,
          "text": "Am I not free? Am I not an apostle? Have I not seen Jesus our Lord? Are you yourselves not the result of my work in the Lord?",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Even if I am not an apostle to others, I certainly am to you! For you are the seal—the living validation—of my apostleship in the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "This is my legal defense to those who would put me on trial.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Do we not have the right to eat and drink at the community’s expense?",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Do we not have the right to take a believing wife along with us, just as the other apostles and the Lord’s brothers and Cephas do?",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Or is it only Barnabas and I who are denied the right to refrain from manual labor for our living?",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Who ever serves as a soldier and pays his own rations? Who plants a vineyard and does not eat its fruit? Or who shepherds a flock and does not consume the milk from the flock?",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Am I saying these things merely from a human perspective? Does the Law not say the same?",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "For in the Law of Moses it is written: *You shall not muzzle an ox while it is treading out the grain.* Is it oxen that God is concerned about?",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Or does he say this entirely for our sake? Yes, it was written for us, because the plowman ought to plow in hope, and the thresher ought to thresh in the hope of sharing the harvest.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "If we sowed spiritual seed among you, is it too much to expect a material harvest from you?",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "If others share in this rightful claim on you, do we not have a greater right? But we have not made use of this right. Instead, we endure everything so that we do not place any obstacle in the way of the Good News of Christ.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Do you not know that those who perform the temple rites eat the food from the temple, and those who serve at the altar take their share from the sacrifices?",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "In the same way, the Lord commanded that those who proclaim the Good News should get their living from the Good News.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "But I have used none of these entitlements. And I am not writing this so that such an arrangement should be made for me. I would rather die than—no one will nullify my reason for boasting!",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "For if I preach the Good News, that gives me no ground for boasting, because I am under a driving necessity. Woe to me if I do not preach!",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "If I do this of my own will, I have a reward; but if I do it because I must, I am simply discharging a stewardship with which I have been entrusted.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "What then is my reward? This: that in my preaching I may offer the Good News free of charge, and so decline to make full use of my rights in the Good News.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "For though I am free from all people, I have made myself a slave to all, so that I might win over the greatest possible number.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "To the Jews I became like a Jew, to win Jews. To those under the Law I became as one under the Law (though not being under the Law myself), to win those under the Law.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "To those outside the Law I became like one outside the Law (not being outside God’s law but within Christ’s law), to win those outside the Law.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "To the weak I became weak, to win the weak. I have become all things to all people, so that by every possible means I might save some.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "I do it all for the sake of the Good News, so that I may become a joint-partner in its blessings.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Do you not know that in a stadium the runners all run, but only one receives the prize? Run in such a way that you may seize it.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "Every athlete exercises self-control in all things—they do it to receive a crown that withers, but we, a crown that is imperishable.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Therefore, I do not run like someone aimlessly; I do not box like someone hitting the air.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Instead, I buffet my body and make it my slave, so that after preaching to others, I myself might not be disqualified.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Seen Jesus our Lord\" (v. 1)**: In the first century, an \"apostle\" was fundamentally a witness to the Resurrection. Paul’s claim to apostleship rests on his encounter with the risen Christ.\n\n**\"Seal\" (v. 2)**: The *sphragis* was an official mark of ownership or authenticity. The existence of the Corinthian church is Paul's \"credential\" or \"proof of purchase.\"\n\n**\"Legal defense / Put me on trial\" (v. 3)**: The terms *apologia* and *anakrinousin* are technical legal terms. Paul is framing his argument as a formal defense against critics who question his legitimacy because he doesn't accept financial support.\n\n**\"Believing wife\" (v. 5)**: Literally \"a sister woman.\" In the context of the early church, \"sister\" denotes a fellow believer. Paul is referring to a wife who shares the faith.\n\n**\"Rations\" (v. 7)**: The Greek *opsōnion* refers specifically to a soldier’s wages or the rations provided to military personnel.\n\n**\"Obstacle\" (v. 12)**: *Enkopē* originally referred to a road-cut or a trench dug by an army to hinder an enemy’s advance. Paul is avoiding any behavior that would \"cut off the road\" for the gospel.\n\n**\"Driving necessity\" (v. 16)**: *Anankē* denotes a compulsion or necessity that cannot be avoided. Paul views his calling not as a career choice he can boast about, but as an inescapable divine mandate.\n\n**\"Stewardship\" (v. 17)**: *Oikonomia* refers to the management of a household. A steward was often a slave who managed the master’s affairs. Paul sees himself as a slave-manager of the Gospel, not an independent contractor.\n\n**\"Free of charge\" (v. 18)**: *Adapanon* means \"without expense.\" Paul’s \"reward\" is the privilege of waiving his rights so that no one can accuse him of preaching for money.\n\n**\"Joint-partner\" (v. 23)**: *Synkoinōnos* implies someone who participates fully in a shared reality. Paul wants to be more than a herald; he wants to share in the harvest.\n\n**\"Buffet my body\" (v. 27)**: *Hypōpiazō* is a vivid boxing term meaning \"to hit under the eye\" or \"to give a black eye.\" It conveys a high degree of self-discipline.\n\n**\"Disqualified\" (v. 27)**: *Adokimos* refers to a material (like metal) that has failed a test or been rejected as counterfeit. In an athletic context, it means failing to meet the requirements of the contest and thus being barred from the prize."
    },
    {
      "chapter": 10,
      "verses": [
        {
          "verse": 1,
          "text": "I want you to be clearly aware, brothers and sisters, that all our ancestors were under the protection of the cloud and all of them passed through the sea.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "In the cloud and in the sea, they were all baptized into Moses, binding themselves to his leadership and the covenant.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "They all ate the same spiritual food",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "and they all drank the same spiritual drink. For they used to drink from a spiritual rock that followed them, and that rock was the Christ.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Nevertheless, God was not pleased with most of them, and so their bodies were strewn across the wilderness.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Now these things occurred as warning-patterns for us, so that we would not be people who crave evil things, just as they craved them.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Do not become idolaters, as some of them did; as it stands written: *The people sat down to eat and drink, and stood up to engage in cultic revelry.*",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Let us not practice sexual immorality, as some of them did, and twenty-three thousand fell dead in a single day.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Let us not put the Christ to the test, as some of them tested him, and were destroyed by the serpents.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And do not grumble, as some of them grumbled, and were destroyed by the Death-Angel.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "These things happened to them as a warning-pattern, and they were written down for our instruction, we upon whom the climax of the ages has arrived.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "So then, let the one who thinks he is standing securely watch out so that he does not fall.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "No testing has overtaken you except what is common to the human condition. But God is faithful; he will not allow you to be tested beyond what you are able to endure. Rather, along with the testing, he will also provide the way out, so that you are able to bear up under it.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For this reason, my dear friends, flee from the worship of idols.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "I am speaking to you as to sensible people; judge for yourselves what I am saying.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "The cup of blessing that we bless, is it not a communal participation in the blood of Christ? The bread that we break, is it not a communal participation in the body of Christ?",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Because there is one bread, we who are many are one body, for we all share together in the one bread.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Look at the people of Israel in a purely human context: are not those who eat the sacrifices partners in the altar?",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "What am I saying, then? That meat sacrificed to an idol is anything, or that an idol itself is anything?",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "No, but I am saying that what the pagans sacrifice, they sacrifice to demons and not to God. I do not want you to become partners with demons.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "You cannot drink the cup of the Lord and the cup of demons; you cannot share in the table of the Lord and the table of demons.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Or are we trying to provoke the Lord’s jealousy? Are we stronger than he is?",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "“Everything is permitted”—but not everything is beneficial. “Everything is permitted”—but not everything builds up the community.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "No one should seek his own advantage, but rather the advantage of the other person.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Eat anything sold in the meat market without raising questions of conscience.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "For *the earth and everything that fills it belong to the Lord.*",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "If an unbeliever invites you to a meal and you want to go, eat whatever is set before you without raising questions of conscience.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "But if someone says to you, “This is sacred meat,” do not eat it, for the sake of the one who informed you and for the sake of conscience.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Now when I say “conscience,” I do not mean your own, but that of the other person. For why should my freedom be judged by someone else’s scruples?",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "If I participate with thankfulness, why am I being denounced for something over which I give thanks to God?",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Therefore, whether you eat or drink or whatever you do, do everything for the glory of God.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "Give no cause for stumbling to Jews or to Greeks or to the church of God,",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "just as I also try to please everyone in every way. I do not seek my own benefit but that of the many, so that they may be saved.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Baptized into Moses\" (v. 2)**: The Greek *eis ton Mōysēn* indicates a transition into a state of identification and solidarity. Just as Christians are baptized \"into Christ,\" the Israelites were uniquely bound to Moses as the mediator of their covenant and the leader of their community.\n\n**\"Spiritual rock that followed them\" (v. 4)**: This refers to a Jewish tradition (found in the Targums and Midrash) that the rock from which water flowed in the wilderness actually accompanied the Israelites on their journey. Paul adopts this tradition to identify Christ as the pre-existent source of life for God's people throughout history.\n\n**\"Cultic revelry\" (v. 7)**: The Greek *paizein* (\"to play\") in the context of Exodus 32:6 (the Golden Calf) suggests more than children’s games; it refers to the singing, dancing, and potentially the sexual license associated with pagan festivals.\n\n**\"Warning-pattern\" (v. 6, 11)**: The Greek *typos* (and the adverb *typikōs*) refers to an imprint or a model. It suggests that these historical events are not just \"examples\" but divinely ordered patterns that prefigure the experiences of the current community.\n\n**\"Communal participation\" (v. 16)**: The Greek *koinōnia* is often translated as \"fellowship\" or \"communion,\" but in this ritual context, it implies a concrete sharing in or a partnership with the reality of the blood and body of Christ.\n\n**\"In a purely human context\" (v. 18)**: The phrase *kata sarka* (\"according to the flesh\") is often translated \"the people of Israel,\" but Paul uses it here to distinguish the ethnic/historical nation of Israel and its temple practices from the \"spiritual\" Israel he is addressing.\n\n**\"Sacred meat\" (v. 28)**: Paul uses the word *hierothuton* here rather than the *eidolothuton* (\"idol-meat\") used in verse 19. *Hierothuton* is a more neutral, \"polite\" term used by pagans to describe their sacrifices. Paul is likely mimicking the language a pagan host or a cautious guest would use in a social setting.\n\n**\"Questions of conscience\" (v. 25, 27)**: The Greek *anakrinontes* refers to a legal or judicial inquiry. Paul is telling the Corinthians they do not need to conduct a \"cross-examination\" of their food's origin unless someone explicitly raises the issue."
    },
    {
      "chapter": 11,
      "verses": [
        {
          "verse": 1,
          "text": "Become imitators of me, just as I am of Christ.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I praise you because you remember me in everything and maintain the traditions exactly as I handed them down to you.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "But I want you to understand that the head of every man is Christ, the head of a woman is the man, and the head of Christ is God.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Every man who prays or prophesies with something hanging down over his head shames his Head.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But every woman who prays or prophesies with her head uncovered shames her head—it is one and the same as if her head were shaved.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "For if a woman is not covered, let her hair be cut short; but if it is shameful for a woman to have her hair cut off or her head shaved, let her be covered.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For a man ought not to cover his head, since he is the image and glory of God; but the woman is the glory of man.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "For man did not come from woman, but woman from man;",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "neither was man created for the sake of the woman, but woman for the sake of the man.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For this reason, a woman ought to have authority over her head, because of the angels.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Nevertheless, in the Lord, woman is not independent of man nor man independent of woman;",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "for just as the woman came from the man, so also the man is born through the woman. And all things come from God.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Judge for yourselves: is it proper for a woman to pray to God while uncovered?",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Does not nature itself teach you that if a man wears his hair long, it is a dishonor to him,",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "but if a woman has long hair, it is her glory? For her hair has been given to her in place of a wrap.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But if anyone intends to be contentious about this, we have no such custom, nor do the churches of God.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Now in giving the following instructions I do not praise you, because you do not come together for the better but for the worse.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "For in the first place, when you come together as a church, I hear that there are divisions among you, and to some extent I believe it.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Indeed, there must be factions among you so that those who are genuine may become evident in your midst.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "So, when you meet together in the same place, it is not the Lord’s Meal that you eat.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For as you eat, each of you rushes ahead with your own private meal. One person goes hungry while another gets drunk.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Do you not have houses for eating and drinking? Or do you despise the church of God and humiliate those who have nothing? What should I say to you? Shall I praise you? In this matter, I do not praise you.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "For I received from the Lord what I also handed down to you: that the Lord Jesus, on the night he was betrayed, took bread,",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "and when he had given thanks, he broke it and said, “This is my body, which is for you; do this in remembrance of me.”",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "In the same way, he took the cup after supper, saying, “This cup is the new covenant in my blood; do this, as often as you drink it, in remembrance of me.”",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "For as often as you eat this bread and drink the cup, you proclaim the Lord’s death until he comes.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Therefore, whoever eats the bread or drinks the cup of the Lord in an unworthy manner will be answerable for the body and blood of the Lord.",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "Let a person examine themselves, and in this way eat of the bread and drink of the cup.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "For anyone who eats and drinks without discerning the body eats and drinks judgment upon themselves.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "This is why many among you are weak and sick, and a number of you have fallen asleep.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "But if we correctly judged ourselves, we would not be judged.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "But when we are judged by the Lord, we are being disciplined so that we will not be condemned along with the world.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "So then, my brothers and sisters, when you come together to eat, wait for one another.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "If anyone is hungry, they should eat at home, so that your meeting does not result in judgment. As for the other matters, I will provide directions whenever I come.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Traditions\" (v. 2)**: The Greek *paradosis* refers to things \"handed over.\" In a first-century context, this isn't just \"customs\" but the foundational apostolic teaching and liturgy delivered orally.\n\n**\"Head\" (v. 3)**: The Greek *kephalē* is polysemous. While it can mean \"authority over,\" it often carries the sense of \"source\" or \"origin\" (like the head of a river). In this context, Paul is exploring a complex web of social priority, biological origin (v. 8), and spiritual representation.\n\n**\"Shames his Head / her head\" (vv. 4–5)**: There is a deliberate wordplay here. Shaming one's physical \"head\" (through culturally inappropriate attire) simultaneously shames one's metaphorical \"head\" (Christ for the man, the man for the woman).\n\n**\"Authority over her head\" (v. 10)**: This is one of the most debated phrases in the Pauline corpus. Traditional translations often add \"a symbol of\" authority. However, the Greek *exousian echein epi tēs kephalēs* literally means \"to have authority over the head.\" In light of the woman’s role in praying and prophesying (v. 5), this likely refers to her own invested authority to exercise these spiritual gifts within the created and angelic order.\n\n**\"Because of the angels\" (v. 10)**: This likely alludes to the Second Temple Jewish belief (and Essene practice) that angels were present in the worshiping assembly, requiring maintainance of the divine order and propriety.\n\n**\"In place of a wrap\" (v. 15)**: The Greek *anti peribolaiou* suggests that the woman’s hair serves the functional purpose of a covering. This supports the view that the \"uncovered\" issue in Corinth may have involved hair being let down loosely (a sign of wildness or loose morals in the Greco-Roman world) rather than the absence of a fabric veil.\n\n**\"Factions\" (v. 19)**: The Greek *haireseis* (whence \"heresies\") refers to sectarian groups or cliques. Paul uses it ironically: the divisions are bad, but they serve to highlight who is actually living out the gospel (\"those who are genuine\").\n\n**\"The Lord’s Meal\" (v. 20)**: The adjective *kuriakon* (pertaining to the Lord) emphasizes the meal's ownership. Because they are eating in a way that excludes the poor, Paul argues it has ceased to be \"the Lord’s\" and has become a mere \"private meal\" (*idion deipnon*, v. 21).\n\n**\"In remembrance of me\" (vv. 24–25)**: The Greek *anamnēsis* carries a Hebrew substratum (*zikkaron*). It is not a mere mental recollection of a past event but a \"memorial sacrifice\" or a liturgical making-present of the past event's power.\n\n**\"Discerning the body\" (v. 29)**: While traditionally interpreted as \"recognizing Jesus's presence in the bread,\" the immediate context of verses 17–22 suggests \"the body\" refers to the corporate body of believers—the church. To eat without \"discerning the body\" is to eat while ignoring the poor and divided state of the community.\n\n**\"Fallen asleep\" (v. 30)**: A common early Christian euphemism for death."
    },
    {
      "chapter": 12,
      "verses": [
        {
          "verse": 1,
          "text": "Now, concerning matters of the Spirit, brothers and sisters, I do not want you to be uninformed.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "You know that when you were pagans, you were swept away toward voiceless idols, led along by whatever impulse drove you.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Therefore, I want you to understand that no one speaking by the Spirit of God ever says, “Jesus be cursed!” and no one is able to say, “Jesus is Lord,” except by the Holy Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Now there are different distributions of gifts of grace, but the same Spirit;",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "and there are different distributions of ministries, and the same Lord;",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "and there are different distributions of active power, but it is the same God who energizes all of them in everyone.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "To each person, a manifestation of the Spirit is given for the common good.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For to one, an utterance of wisdom is given through the Spirit; to another, an utterance of knowledge according to the same Spirit;",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "to another, faith by the same Spirit; to another, gifts of healings by the one Spirit;",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "to another, the working of miracles; to another, prophecy; to another, the ability to distinguish between spirits; to another, various kinds of languages; and to another, the interpretation of languages.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "One and the same Spirit energizes all these things, distributing them to each person individually, just as he determines.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For just as the body is one and yet has many parts, and all the parts of the body—though they are many—are one body, so it is with the Christ.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "For in one Spirit we were all baptized into one body—whether Jews or Greeks, whether slaves or free—and we were all given the one Spirit to drink.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Indeed, the body does not consist of one part, but of many.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "If the foot should say, “Because I am not a hand, I am not part of the body,” that does not make it any less a part of the body.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And if the ear should say, “Because I am not an eye, I am not part of the body,” that does not make it any less a part of the body.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "If the whole body were an eye, where would the hearing be? If the whole body were hearing, where would the sense of smell be?",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "But as it is, God arranged the parts—each one of them in the body—exactly as he desired.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "If they were all one single part, where would the body be?",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "As it is, there are many parts, but one body.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "The eye cannot say to the hand, “I have no need of you,” nor again the head to the feet, “I have no need of you.”",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "On the contrary, the parts of the body that seem to be weaker are absolutely necessary,",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "and the parts of the body we consider less honorable, we clothe with greater honor; our unpresentable parts are treated with greater modesty,",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "while our presentable parts have no such need. But God has composed the body, giving greater honor to the part that lacked it,",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "so that there would be no division in the body, but that the parts would have the same concern for one another.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "If one part suffers, every part suffers with it; if one part is honored, every part rejoices with it.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Now you are the body of Christ, and each of you is a part of it.",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "And God has appointed these in the assembly: first apostles, second prophets, third teachers, then miracles, then gifts of healings, acts of assistance, acts of guidance, and various kinds of languages.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Are all apostles? Are all prophets? Are all teachers? Do all work miracles?",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Do all have gifts of healings? Do all speak in languages? Do all interpret?",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "But you must burn with zeal for the greater gifts. And now I will show you a way that goes beyond all comparison.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Matters of the Spirit\" (v. 1)**: The Greek *tōn pneumatikōn* can be masculine (\"spiritual people\") or neuter (\"spiritual things\"). Given the following discussion of gifts, ministries, and workings, the neuter \"spiritual matters\" or \"the things of the Spirit\" is the more likely focus of Paul’s instruction here.\n\n**\"Voiceless idols\" (v. 2)**: This emphasizes the contrast between the pagan experience of \"dumb\" statues and the Christian experience of a Spirit that speaks and gives utterances (*logoi*). The phrase \"led along by whatever impulse drove you\" captures the nuance of *hōs an ēgesthe apagomenoi*, referring to the ecstatic, involuntary trances common in Greco-Roman mystery cults.\n\n**\"Distributions\" (vv. 4-6)**: The Greek *diaireseis* refers to an apportionment or a distribution from a single source. While often translated as \"varieties,\" the term emphasizes the Giver who divides the gifts among the recipients.\n\n**\"Active power\" / \"Energizes\" (vv. 6, 11)**: The Greek *energēma* and *energōn* refer to effective, operational power. It is not just \"working,\" but the divine energy that produces a specific effect or result.\n\n**\"Languages\" (vv. 10, 28, 30)**: The Greek *glōssa* means \"tongue\" (the organ) or \"language.\" Using \"languages\" instead of the traditional \"tongues\" helps modern readers understand that this involved the communication of speech, whether human or otherwise, rather than a purely non-linguistic vocalization.\n\n**\"The Christ\" (v. 12)**: Paul uses the definite article (*ho Christos*). In this context, he is referring to the \"Corporate Christ\"—the Messiah as a body of people rather than just the individual person of Jesus.\n\n**\"Given the one Spirit to drink\" (v. 13)**: The Greek *epotisthemen* (from *potizō*) means to water or give drink to someone. It implies being saturated or imbued with the Spirit, following the imagery of baptism in the first half of the verse.\n\n**\"Unpresentable parts\" / \"Modesty\" (vv. 23-24)**: The Greek *aschēmona* (\"unseemly/unpresentable\") and *euschēmosynēn* (\"propriety/becomingness\") are euphemisms. Paul is likely referring to the private parts of the body, which are treated with \"greater honor\" by being covered with clothing, contrasting with the face or hands which are left bare.\n\n**\"Composed\" (v. 24)**: The word *synekerasen* literally means \"mixed together\" or \"blended,\" like mixing wine and water. It suggests that God has integrated the disparate parts into a single, tempered unit.\n\n**\"Acts of assistance\" / \"Acts of guidance\" (v. 28)**: These translate *antilympseis* (helping/assisting) and *kybernēseis*. The latter refers to a ship-pilot's skill—the ability to steer or provide administrative direction to the community.\n\n**\"Burn with zeal\" (v. 31)**: The verb *zēlouite* is more intense than \"earnestly desire.\" It carries the weight of jealousy or burning passion. Paul is commanding a community-wide focus on the most beneficial gifts."
    },
    {
      "chapter": 13,
      "verses": [
        {
          "verse": 1,
          "text": "If I speak in the languages of humans or even of heavenly messengers, but do not have love, I have become nothing more than a resonating piece of bronze or a clashing cymbal.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And if I have the gift of prophecy and understand all sacred secrets and all knowledge, and if I have such total faith that I can move mountains, but do not have love, I am nothing.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Even if I give away everything I own to feed the poor, and if I hand over my very body so that I might be burned, but do not have love, I gain nothing at all.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Love is patient; love acts with kindness. Love is not consumed by jealousy; love does not brag or puff itself up with pride.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "It is not rude; it does not pursue its own interests; it is not easily provoked to anger; it does not keep a ledger of wrongs.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Love finds no joy in injustice but shares in the joy of the truth.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Love protects all things, trusts all things, hopes all things, and endures through all things.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Love never falls. As for prophecies, they will be rendered obsolete; as for tongues, they will cease; as for knowledge, it will be superseded.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "For our knowledge is partial, and our prophecy is partial,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "but when the state of completion arrives, the partial will be abolished.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "When I was a small child, I talked like a child, I thought like a child, I reasoned like a child. Now that I have become an adult, I have put an end to the ways of a child.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For right now we see a blurred reflection in a metal mirror—a mere riddle—but then, we shall see face to face. Right now I know only in part, but then I will know fully, just as I have been fully known.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "So now these three remain: faith, hope, and love. But the greatest of these is love.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Messengers\" (v. 1)**: The Greek *angelōn* refers to messengers. While usually translated \"angels,\" the term in a first-century context retains the functional sense of those sent from the heavenly court.\n\n**\"Resonating piece of bronze\" (v. 1)**: The Greek *chalkos ēchōn* refers to copper or bronze. Corinth was world-famous for its high-quality bronze. Paul’s point is that without love, the speaker is just echoing noise—mechanical rather than organic.\n\n**\"Clashing cymbal\" (v. 1)**: The *kymbalon alalazon* was often associated with the loud, ecstatic worship in Dionysian or Cybele cults. Paul suggests that \"tongues\" without love are indistinguishable from pagan ritual noise.\n\n**\"Sacred secrets\" (v. 2)**: *Mystēria* are not \"mysteries\" in the modern sense of a puzzle to be solved, but divine truths once hidden that have now been revealed to the initiated.\n\n**\"Puff itself up\" (v. 4)**: The verb *physioō* literally means to inflate or blow up (like a bellows). It captures the \"inflated\" ego and arrogance Paul critiques throughout the Corinthian correspondence.\n\n**\"Ledger of wrongs\" (v. 5)**: The Greek *logizetai* is an accounting term. It means to enter a sum into a ledger or to calculate. Love does not keep a running tally of offenses for future use.\n\n**\"Protects all things\" (v. 7)**: The verb *stegō* is related to the word for a roof. It means to cover, support, or protect by covering. While many translate this as \"bears all things,\" it carries the nuance of protecting others by covering their faults or shielding them.\n\n**\"Rendered obsolete / Superseded / Abolished\" (v. 8, 10, 11)**: The Greek verb *katargeō* appears four times in this passage. It means to make ineffective, to nullify, or to bring to an end. It describes the transition from a temporary state to a permanent one.\n\n**\"State of completion\" (v. 10)**: *To teleion* is often translated as \"the perfect,\" but in Koine Greek, it refers to a goal (*telos*), maturity, or wholeness. It is the end-point of a process of growth.\n\n**\"Blurred reflection in a metal mirror\" (v. 12)**: Ancient mirrors were made of polished bronze or silver, not glass. They produced a dim, sometimes distorted image. The phrase *en ainigmati* (literally \"in a riddle\") reinforces that our current perception of divine reality is indirect and obscure compared to the \"face to face\" reality to come."
    },
    {
      "chapter": 14,
      "verses": [
        {
          "verse": 1,
          "text": "Pursue love as your ultimate goal, and set your hearts on spiritual expressions, especially so that you may prophesy.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For the one who speaks in a tongue does not speak to people but to God—for no one understands him; in the spirit, he is speaking hidden truths.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "On the other hand, the one who prophesies speaks to people for their building up, their encouragement, and their comfort.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "The one who speaks in a tongue builds up himself, but the one who prophesies builds up the assembly.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Now, I want you all to speak in tongues, but even more I want you to prophesy. The one who prophesies is more useful than the one who speaks in tongues, unless that person interprets so that the assembly may receive building up.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Now, brothers and sisters, if I come to you speaking in tongues, how will I benefit you unless I speak to you either by revelation, or knowledge, or prophecy, or teaching?",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Even with lifeless objects that produce a sound—whether a flute or a lyre—if they do not provide a clear distinction in the notes, how will anyone know what is being played on the flute or the lyre?",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Indeed, if the bugle gives an unrecognizable sound, who will prepare for battle?",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "So it is with you: unless you use your tongue to produce a clear word, how will anyone know what is being said? You will simply be speaking into the air.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "There are, perhaps, many different kinds of languages in the world, and none is without meaning.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Therefore, if I do not know the power of the language, I will be a \"bar-bar\" foreigner to the speaker, and the speaker will be a \"bar-bar\" foreigner to me.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "So also with you: since you are zealots for spiritual manifestations, seek to overflow with them for the building up of the assembly.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Therefore, let the one who speaks in a tongue pray for the ability to interpret.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "For if I pray in a tongue, my spirit prays, but my mind is unfruitful.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "What is the conclusion then? I will pray with the spirit, but I will also pray with my mind; I will sing praise with the spirit, but I will also sing praise with my mind.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Otherwise, if you give a blessing in the spirit, how can the person occupying the place of the uninstructed say \"Amen\" to your thanksgiving? Since they do not know what you are saying,",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "you may be giving thanks well enough, but the other person is not being built up.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "I thank God that I speak in tongues more than all of you;",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "but in the assembly, I would rather speak five words with my mind, so that I might also instruct others, than ten thousand words in a tongue.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Brothers and sisters, do not become children in your thinking. Rather, be infants in regard to evil, but in your thinking, be mature.",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "In the Law it is written: *By people of foreign tongues and by the lips of strangers I will speak to this people, and even then they will not listen to me, says the Lord.*",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Consequently, tongues serve as a sign, not for those who believe but for the unbelieving; prophecy, however, is not for the unbelieving but for those who believe.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "If, therefore, the whole assembly meets together and everyone is speaking in tongues, and uninstructed people or unbelievers enter, will they not say that you are raving mad?",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "But if everyone prophesies, and an unbeliever or uninstructed person enters, he is convicted by all, he is called to account by all,",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "the hidden things of his heart become clear, and so, falling on his face, he will worship God, announcing, \"God is truly among you!\"",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "What is the result then, brothers and sisters? Whenever you meet, each one has a psalm, a teaching, a revelation, a tongue, or an interpretation. Let everything be done for building up.",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "If anyone speaks in a tongue, let it be two or at most three, and each in turn, and let one person interpret.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "But if there is no interpreter, let the speaker keep silent in the assembly and speak only to himself and to God.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Let two or three prophets speak, and let the others evaluate what is said.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "But if a revelation is made to another person sitting there, let the first speaker be silent.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "For you can all prophesy one by one, so that everyone may learn and everyone may be encouraged.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Indeed, the spirits of prophets are under the control of the prophets;",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "for God is not a God of disorder but of peace, as is the case in all the assemblies of the holy ones.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Let the women keep silent in the assemblies, for they are not permitted to speak; rather, let them be in a state of submission, just as the Law says.",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "If they want to learn something, let them ask their own husbands at home; for it is a shameful thing for a woman to speak in the assembly.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "Or did the word of God originate with you? Or are you the only ones it has reached?",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "If anyone thinks he is a prophet or a spiritual person, let him recognize that the things I am writing to you are the Lord’s command.",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "If anyone ignores this, he is to be ignored.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "Therefore, my brothers and sisters, be zealous to prophesy, and do not forbid speaking in tongues.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "But let all things be done properly and according to order.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Spiritual expressions / manifestations\" (v. 1, 12)**: The Greek *pneumatika* (v. 1) and *pneumatōn* (v. 12, lit. \"spirits\") are often translated as \"spiritual gifts.\" However, Paul uses the more specific *charismata* elsewhere. These terms refer more broadly to the ways the Spirit manifests or the \"spiritual things\" the Corinthians were so eager to display.\n\n**\"Assembly\" (v. 4, 5, 12, etc.)**: The Greek *ekklēsia* refers to a gathering or a called-out meeting of citizens. \"Church\" in modern English often carries institutional or architectural connotations that were not present in the first century.\n\n**\"Hidden truths\" (v. 2)**: The Greek *mystēria* refers to things previously hidden but now being revealed, rather than \"mysteries\" in the sense of a puzzle that cannot be solved.\n\n**\"Building up\" (v. 3, 4, 12, etc.)**: *Oikodomē* is an architectural metaphor. Just as a building is constructed stone by stone, Paul envisions the speech of the community adding strength and structure to the body of believers.\n\n**\"Bar-bar foreigner\" (v. 11)**: The Greek *barbaros* is onomatopoeic, mimicking the \"unintelligible\" sounds of non-Greek speakers (*bar-bar*). The translation reflects this linguistic nuance.\n\n**\"Uninstructed\" (v. 16, 23, 24)**: The Greek *idiōtēs* refers to a \"layperson\" or someone without technical or specialized knowledge. In this context, it refers to those who do not understand the spiritual phenomena or are new to the community.\n\n**\"Mind\" (v. 14, 15, 19)**: *Nous* refers to the faculty of understanding, reason, and intellectual perception. Paul emphasizes that spiritual experience should not bypass human rationality.\n\n**\"Raving mad\" (v. 23)**: *Mainesthe* suggests the frenzy of the Dionysian cults or other ecstatic pagan religions familiar to the Corinthians. Paul is warning that without order, they look like the very cults they left.\n\n**\"Evaluate\" (v. 29)**: *Diakrinetōsan* implies a careful weighing or discerning. Prophecy was not to be accepted uncritically; the community was responsible for testing the message.\n\n**\"Under the control of\" (v. 32)**: The Greek *hypotassetai* (to be subject to) here indicates that prophetic inspiration does not result in a loss of self-control. Unlike the pagan oracles, the Christian prophet remains a responsible agent.\n\n**\"Ignored\" (v. 38)**: There is a textual variant here (*agnoeito* vs. *agnoeitai*). Following the SBLGNT (*agnoeitai*, \"he is ignored/unknown\"), it suggests that if a person refuses to recognize Paul's authority, God (or the community) does not recognize that person's standing."
    },
    {
      "chapter": 15,
      "verses": [
        {
          "verse": 1,
          "text": "Now I am bringing back to your attention, brothers and sisters, the Good News that I announced to you, which you also received, in which you have taken your stand,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "and through which you are being saved—provided you hold fast to the message I announced to you, unless your act of faith was for nothing.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For I handed down to you as of first importance what I also received: that Christ died for our sins in accordance with the Scriptures;",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "and that he was buried; and that he was raised on the third day in accordance with the Scriptures;",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "and that he appeared to Cephas, then to the Twelve.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "After that, he appeared to more than five hundred brothers and sisters at one time, most of whom remain with us until now, though some have fallen asleep.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "After that, he appeared to James, then to all the apostles.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Last of all, as though to a freakish, late-term birth, he appeared even to me.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For I am the least of the apostles, unfit even to be called an apostle because I persecuted the church of God.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "But by the grace of God I am what I am, and his grace toward me did not prove empty. On the contrary, I labored harder than all of them—though it was not I, but the grace of God that was with me.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "So whether it was I or they, this is what we proclaim, and this is what you believed.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Now if it is proclaimed that Christ has been raised from the dead, how can some among you say that there is no resurrection of the dead?",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "If there is no resurrection of the dead, then not even Christ has been raised.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And if Christ has not been raised, then our proclamation is a hollow shell, and your faith is a hollow shell as well.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "More than that, we are found to be false witnesses about God, because we testified against God that he raised the Christ—whom he did not raise, if in fact the dead are not raised.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For if the dead are not raised, not even Christ has been raised.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "And if Christ has not been raised, your faith is futile; you are still in your sins.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Then those also who have fallen asleep in Christ have simply perished.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "If it is only for this life that we have centered our hope in Christ, we are of all people most to be pitied.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "But the fact is, Christ has been raised from the dead, the first-fruits of those who have fallen asleep.",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "For since death came through a human being, the resurrection of the dead also came through a human being.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "For just as in Adam all die, so also in the Christ all will be made alive.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "But each in his own proper order: Christ the first-fruits, then those who belong to Christ at his arrival.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Then comes the completion, when he hands over the Kingdom to his God and Father, after he has neutralized every ruler and every authority and power.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "For he must reign as king until he has put all his enemies under his feet.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "The last enemy to be neutralized is death.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "For \"he has subjected all things under his feet.\" Now when it says that \"all things\" have been subjected, it is obvious that this excludes the One who subjected all things to him.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "And when all things are subjected to him, then the Son himself will be subjected to the One who subjected all things to him, so that God may be all in all.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Otherwise, what will those do who are being baptized on behalf of the dead? If the dead are not raised at all, why are people baptized on their behalf?",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "And why do we put ourselves in danger every hour?",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Every day I face death—I swear it by the pride I take in you, brothers and sisters, which I have in Christ Jesus our Lord.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "If I fought \"wild beasts\" in Ephesus from a merely human perspective, what do I gain? If the dead are not raised, \"Let us eat and drink, for tomorrow we die.\"",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "Do not be deceived: \"Bad company corrupts good character.\"",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Wake up to a sober, righteous mind and stop sinning; for some have no knowledge of God. I say this to your shame.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "But someone will ask, \"How are the dead raised? With what kind of body do they come?\"",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "You fool! What you sow does not come to life unless it dies.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "And what you sow is not the body that is going to be, but a bare grain—of wheat, perhaps, or something else.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "But God gives it a body just as he intended, and to each kind of seed a body of its own.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "Not all flesh is the same: there is one kind for humans, another for animals, another for birds, and another for fish.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "There are also heavenly bodies and earthly bodies; but the glory of the heavenly is one thing, and the glory of the earthly is another.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "There is one glory of the sun, another glory of the moon, and another glory of the stars; for star differs from star in glory.",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "So it is with the resurrection of the dead. It is sown in a state of decay, it is raised in a state of imperishability.",
          "paragraphStart": true
        },
        {
          "verse": 43,
          "text": "It is sown in dishonor, it is raised in glory. It is sown in weakness, it is raised in power.",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "It is sown a soul-animated body, it is raised a Spirit-animated body. If there is a soul-animated body, there is also a Spirit-animated body.",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "So it is written: \"The first man, Adam, became a living soul\"; the last Adam became a life-giving spirit.",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "But the Spirit-animated is not first; rather, the soul-animated is first, and then the Spirit-animated.",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "The first man is from the earth, made of dust; the second man is from heaven.",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "As was the man of dust, so are those who are made of dust; and as is the man of heaven, so are those who are of heaven.",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "And just as we have worn the image of the man of dust, we will also wear the image of the man of heaven.",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "I tell you this, brothers and sisters: flesh and blood cannot inherit the Kingdom of God, nor does decay inherit imperishability.",
          "paragraphStart": true
        },
        {
          "verse": 51,
          "text": "Look, I am telling you a sacred secret: We will not all fall asleep, but we will all be changed,",
          "paragraphStart": false
        },
        {
          "verse": 52,
          "text": "in an instant, in the blink of an eye, at the last trumpet. For the trumpet will sound, and the dead will be raised imperishable, and we will be changed.",
          "paragraphStart": false
        },
        {
          "verse": 53,
          "text": "For this perishable nature must clothe itself with imperishability, and this mortal nature must clothe itself with immortality.",
          "paragraphStart": false
        },
        {
          "verse": 54,
          "text": "When this perishable nature clothes itself with imperishability, and this mortal nature clothes itself with immortality, then the word that is written will come true: \"Death has been swallowed up in victory.\"",
          "paragraphStart": false
        },
        {
          "verse": 55,
          "text": "\"Where, O Death, is your victory? Where, O Death, is your sting?\"",
          "paragraphStart": true
        },
        {
          "verse": 56,
          "text": "The sting of death is sin, and the power of sin is the law.",
          "paragraphStart": true
        },
        {
          "verse": 57,
          "text": "But thanks be to God, who gives us the victory through our Lord Jesus Christ!",
          "paragraphStart": false
        },
        {
          "verse": 58,
          "text": "Therefore, my beloved brothers and sisters, be steadfast, immovable, always excelling in the work of the Lord, because you know that your labor in the Lord is not for nothing.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Freakish, late-term birth\" (v. 8)**: The Greek *ektroma* refers to a miscarriage or an abortion—an untimely or \"monstrous\" birth. Paul uses this jarring, self-deprecating term to describe his sudden, violent encounter with the risen Christ, which happened outside the \"natural\" timeframe of the other apostles' experiences.\n\n**\"Hollow shell\" (v. 14)**: The Greek *kenos* means empty or void of content. Translating it as \"hollow shell\" captures the idea that the proclamation and faith would be structurally present but lacking any internal substance or reality if the resurrection were false.\n\n**\"Futile\" (v. 17)**: Unlike *kenos* (empty), *mataia* implies fruitlessness or failing to reach a goal. If Christ is not raised, faith is not just empty; it is ineffective at solving the problem of sin.\n\n**\"Neutralized\" (v. 24, 26)**: The verb *katargeo* means to render idle, inoperative, or to abolish. In the context of \"rulers and authorities,\" it suggests stripping them of their power and function rather than simple annihilation.\n\n**\"Arrival\" (v. 23)**: The Greek *parousia* was often used for the formal visit of a royalty or a high official. In the first century, this carried a political and social weight that \"coming\" fails to convey.\n\n**\"Soul-animated body\" / \"Spirit-animated body\" (v. 44)**: This is the most critical technical distinction in the chapter. The Greek *soma psychikon* (traditionally \"natural body\") and *soma pneumatikon* (traditionally \"spiritual body\") do not refer to the *material* the body is made of (as if one is meat and the other is ghost-stuff). Rather, they refer to the *power* that animates the body. The *psychikon* body is animated by the *psyche* (the natural life-principle of this age); the *pneumatikon* body is animated by the *Pneuma* (the Holy Spirit/the life-principle of the age to come).\n\n**\"Man of dust\" (v. 47-49)**: The Greek *choïkos* refers specifically to \"loose earth\" or \"dust,\" directly alluding to the Septuagint’s description of Adam’s creation in Genesis 2:7.\n\n**\"Sacred secret\" (v. 51)**: The Greek *mysterion* is not a \"mystery\" in the sense of a puzzle to be solved, but a divine secret that remained hidden until God chose to reveal it.\n\n**\"In an instant\" (v. 52)**: The Greek *en atomo* refers to a unit of time so small it cannot be divided (the root of the word \"atom\"). \"In a moment\" is common, but \"instant\" or \"atom of time\" captures the indivisibility."
    },
    {
      "chapter": 16,
      "verses": [
        {
          "verse": 1,
          "text": "Now concerning the collection of money for the holy people of God: you should follow the same directions I gave to the churches in Galatia.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "On the first day of every week, each of you should set something aside privately, storing up whatever you have gained through your prosperity, so that no collections have to be made only when I arrive.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And when I come, I will send those whom you have approved by your letters of recommendation to carry your gift of grace to Jerusalem.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "If it seems appropriate for me to go as well, they will travel with me.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "I will come to you after I pass through Macedonia—for I am indeed traveling through Macedonia—",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "and I may perhaps stay with you, or even spend the winter, so that you yourselves may send me on my way to wherever I go next.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For I do not want to see you now just in passing; I hope to remain with you for some time, if the Lord permits.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But I will remain in Ephesus until Pentecost,",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "for a great and effective door for ministry has opened for me, and there are many who stand against it.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "If Timothy comes, see to it that he has nothing to fear while he is among you, for he is doing the work of the Lord just as I am.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "Therefore, let no one treat him with contempt. Send him on his way in peace so that he may come to me, for I am expecting him along with the other brothers.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Now concerning our brother Apollos: I strongly urged him to come to you with the brothers, but it was not at all his will to come now; however, he will come when he has the right opportunity.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Be alert, stand firm in the faith, act with courageous strength, be powerful.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Let everything you do be done in love.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Now I urge you, brothers and sisters—you know that the household of Stephanas were the firstfruits of Achaia, and that they have devoted themselves to the service of the holy people—",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "I urge you to submit yourselves to such people, and to everyone who joins in the work and labors hard.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "I rejoice at the arrival of Stephanas, Fortunatus, and Achaicus, because they have filled the void left by your absence.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "They have refreshed my spirit and yours. Therefore, give full recognition to such people.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "The churches of Asia send you greetings. Aquila and Prisca, together with the church that meets in their house, send you many greetings in the Lord.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "All the brothers and sisters here send you greetings. Greet one another with a holy kiss.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "This greeting is in my own hand—Paul’s.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "If anyone has no love for the Lord, let that person be accursed. *Maranatha*!",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "The grace of the Lord Jesus be with you.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "My love be with all of you in Christ Jesus.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Holy people\" (v. 1, 15)**: The Greek *hagioi* (traditionally \"saints\") refers to those set apart for God. In this context, it specifically designates the impoverished believers in the Jerusalem church for whom Paul is organizing a relief fund.\n\n**\"Gift of grace\" (v. 3)**: The Greek *charis* is often translated simply as \"gift\" or \"grace.\" However, Paul uses it here to describe the monetary collection. It emphasizes that the money is a concrete expression of the grace they have received and are now extending to others.\n\n**\"Effective door\" (v. 9)**: The Greek *energēs* (from which we get \"energetic\") suggests something active and at work. The \"door\" is not just a passive opening, but an active opportunity for Gospel labor.\n\n**\"Act with courageous strength\" (v. 13)**: The Greek *andrizesthe* literally means \"act like a man.\" In the Greco-Roman context, this was a standard idiom for courage and bravery (virtue/manliness). \"Act with courageous strength\" captures the behavioral expectation without the modern baggage of the literal gendered idiom.\n\n**\"Firstfruits\" (v. 15)**: The Greek *aparchē* is a technical term from the Septuagint referring to the first portion of a harvest dedicated to God. To the original audience, it signaled that Stephanas’s family was the beginning of a larger \"harvest\" of believers in that region.\n\n**\"Filled the void left by your absence\" (v. 17)**: The Greek *to hymeteron hysterēma* literally means \"your deficiency\" or \"what was lacking from you.\" Paul is not insulting the Corinthians; he is using a common idiom to say that since the whole Corinthian church could not be with him, these three men served as their representatives, making Paul feel as though the whole church were present.\n\n**\"Accursed\" (v. 22)**: The Greek *anathema* refers to something handed over or devoted to divine judgment or destruction.\n\n**\"Maranatha\" (v. 22)**: This is a transliterated Aramaic phrase (*māranā’ thā’*). It was likely a liturgical watchword in the early church, meaning \"Our Lord, come!\" or \"The Lord has come.\" Given the context of the final greeting, it serves as a prayer for the Second Coming."
    }
  ]
}