{
  "book": "1Peter",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Peter, an apostle of Jesus Christ, to the chosen resident aliens scattered throughout the Dispersion in Pontus, Galatia, Cappadocia, Asia, and Bithynia,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "chosen according to the foreknowledge of God the Father, by the sanctifying work of the Spirit, for obedience and for the sprinkling of the blood of Jesus Christ: May grace and peace be multiplied to you.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Blessed be the God and Father of our Lord Jesus Christ! According to his great mercy, he has given us new birth into a living hope through the resurrection of Jesus Christ from the dead,",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "and into an inheritance that is indestructible, untainted, and unfading, kept in the heavens for you.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Through faith, you are being shielded by the power of God for a salvation that is ready to be revealed in the final moment of time.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "You greatly rejoice in this, even if now for a little while it has been necessary for you to be distressed by various trials.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "These come so that the proven character of your faith—which is much more precious than gold that perishes even though it is tested by fire—may be found to result in praise, glory, and honor at the revelation of Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Though you have not seen him, you love him; though you do not see him now, you believe in him and rejoice with an inexpressible and glorious joy,",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "as you receive the ultimate goal of your faith: the salvation of your souls.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Concerning this salvation, the prophets who prophesied about the grace intended for you made a careful search and a diligent inquiry.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "They tried to determine what person or what time the Spirit of Christ within them was pointing to when he predicted the sufferings of Christ and the glories that would follow.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "It was revealed to them that they were serving not themselves but you, regarding the things that have now been announced to you through those who brought you the good news by the Holy Spirit sent from heaven—things into which even angels long to catch a glimpse.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Therefore, preparing your minds for action and remaining completely clear-headed, set your hope fully on the grace that is being brought to you at the revelation of Jesus Christ.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "As obedient children, do not be shaped by the desires you had back when you lived in ignorance.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Instead, just as the one who called you is holy, you yourselves must become holy in every aspect of your conduct,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "for it is written: “You shall be holy, because I am holy.”",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "And if you call upon him as Father—the one who judges impartially according to each person’s work—conduct yourselves with deep overawed respect during the time of your exile.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "For you know that you were not ransomed from the empty way of life handed down from your ancestors with perishable things like silver or gold,",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "but with the precious blood of Christ, like that of a lamb without blemish or spot.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "He was foreknown before the foundation of the world but was revealed in these last times for your sake.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Through him you are believers in God, who raised him from the dead and gave him glory, so that your faith and hope are in God.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Now that you have purified your souls by your obedience to the truth, leading to a sincere love for the family of believers, love one another intensely from a pure heart.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "For you have been born again, not from perishable seed but from imperishable, through the living and enduring word of God.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "For: “All flesh is like grass, and all its glory like the flower of the grass. The grass withers, and the flower falls away,",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "but the word of the Lord endures forever.” And this “word” is the good news that was proclaimed to you.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Resident aliens... the Dispersion\" (v. 1)**: The Greek *parepidēmois* refers to people living temporarily in a place that is not their home, specifically those without full citizenship rights. *Diaspora* (Dispersion) was a technical term for Jews living outside of Israel. By using these terms for a likely mixed or Gentile audience, the author frames the Christians as the \"New Israel,\" whose true citizenship is elsewhere.\n\n**\"Sprinkling of the blood\" (v. 2)**: This is a direct allusion to the ratification of the Sinai Covenant in Exodus 24:8. It signals that the readers have entered into a new covenant relationship with God.\n\n**\"Indestructible, untainted, and unfading\" (v. 4)**: The Greek uses a rhythmic triplet of alpha-privative adjectives (*aphtharton, amianton, amaranton*). The translation seeks to maintain this evocative, poetic quality that describes the inheritance as being beyond the reach of decay, ritual impurity, or time.\n\n**\"Proven character of your faith\" (v. 7)**: The word *dokimion* refers to the process of testing or the result of that testing (the \"provenness\"). Like gold being refined in a crucible, the \"testing\" is not meant to break the faith but to prove its purity and value.\n\n**\"Preparing your minds for action\" (v. 13)**: The Greek idiom is literally \"girding up the loins of your mind.\" This refers to the ancient practice of tucking one's long robes into a belt to allow for unimpeded running or work. \"Preparing for action\" captures the functional meaning for a modern reader.\n\n**\"Deep overawed respect\" (v. 17)**: The Greek *phobos* is usually translated as \"fear.\" However, in the context of a relationship with God as Father (v. 17), it refers to a profound, holy awe and a dread of displeasing him, rather than servile terror.\n\n**\"Exile\" (v. 17)**: The Greek *paroikias* refers to the state of being a \"sojourner\" or \"stranger.\" This maintains the theme from verse 1, emphasizing that the believers' current social or earthly status is temporary and marginal.\n\n**\"Sincere love for the family of believers\" (v. 22)**: The Greek *philadelphian* (brotherly love) specifically denotes the affection between members of a family. In the New Testament, this is the standard term for the unique bond between Christians.\n\n**\"Word\" (v. 23, 25)**: In verse 23, the term is *logos*, often used for the divine message or reason. In verse 25, the author uses *rhēma*, which often stresses the spoken or proclaimed utterance. The translation distinguishes these slightly by identifying the *rhēma* as the specific \"good news\" (gospel) preached to them."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, stripping yourselves of every kind of malice and all deceit, performative acts, envies, and every form of slander,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "crave the pure milk of the Word like newborn infants. By it, you will grow into salvation,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "if indeed you have tasted that the Lord is kind.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "As you come to him—a living stone rejected by men but chosen and precious in the sight of God—",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "you yourselves, like living stones, are being built into a spiritual house to be a holy priesthood, offering spiritual sacrifices that are acceptable to God through Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "For it stands written in Scripture: “Look! I am laying a stone in Zion, a chosen and precious cornerstone; and the one who trusts in him will never be put to shame.”",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Therefore, the honor belongs to you who believe; but for those who do not believe, “The stone that the builders rejected has become the head of the corner,”",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "and “a stone that makes people stumble and a rock that trips them up.” They stumble because they disobey the Word—a destiny to which they were appointed.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "But you are a chosen race, a royal priesthood, a holy nation, a people for God’s own possession, so that you may broadcast the excellencies of the one who called you out of darkness into his marvelous light.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Once you were not a people, but now you are God’s people; once you had not received mercy, but now you have received mercy.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Beloved, I urge you as resident aliens and visiting strangers to keep your distance from the cravings of the lower nature, which wage war against your soul.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "Conduct yourselves honorably among the nations so that, even when they slander you as evildoers, they may observe your good works and glorify God on the day he visits us.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Submit yourselves to every human institution for the Lord’s sake, whether to the emperor as the supreme authority,",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "or to governors as those sent by him to punish evildoers and to honor those who do good.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For it is God’s will that by doing good you should silence the ignorant talk of foolish people.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Live as free people—not using your freedom as a cover-up for malice, but living as God’s slaves.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Treat everyone with respect: love the family of believers, fear God, honor the emperor.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Household slaves, submit yourselves to your masters with all respect—not only to those who are good and gentle, but also to those who are crooked.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "For it is a mark of grace if, because of a consciousness of God, someone endures the pain of unjust suffering.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For what credit is there if you endure a beating for doing wrong? But if you endure suffering for doing good, this finds favor with God.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For to this you were called, because Christ also suffered for you, leaving you a tracing pattern so that you might follow in his footsteps.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "He committed no sin, and no deceit was found in his mouth.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "When he was insulted, he did not insult in return; while suffering, he made no threats, but kept entrusting himself to the one who judges justly.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "He himself carried our sins in his body onto the wooden beam, so that we might die to sins and live for righteousness. By his wounds you were healed.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "For you were wandering like sheep, but now you have returned to the Shepherd and Guardian of your souls.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Performative acts\" (v. 1)**: The Greek *hypokriseis* refers to the actions of a stage actor. In this context, it describes religious or social behavior intended for outward show rather than stemming from inward reality.\n\n**\"Pure milk of the Word\" (v. 2)**: The word *logikon* is notoriously difficult to translate. It is related to *logos* (word/reason). While many translate it as \"spiritual,\" for a first-century reader it likely evoked the \"living and abiding word\" mentioned in 1:23. It describes milk that is \"of the Word\" or \"rational/spiritual\" as opposed to physical milk. *Adolon* (\"pure\") literally means \"without deceit,\" creating a wordplay with the \"deceit\" (*dolon*) they are to strip away in verse 1.\n\n**\"Cornerstone\" / \"Head of the corner\" (v. 6, 7)**: These terms (*akrogōniaion* and *kephalēn gōnias*) refer to the primary stones used to orient or cap a building. In the context of the \"living stone\" metaphor, it emphasizes Jesus as the essential structural component of God's new temple.\n\n**\"Resident aliens and visiting strangers\" (v. 11)**: The terms *paroikous* and *parepidēmous* describe people living in a place that is not their legal home. This reinforces the author's theme that the believers' primary citizenship is heavenly, making them a minority subculture in the Roman Empire.\n\n**\"Human institution\" (v. 13)**: The Greek *ktisei* usually means \"creation\" or \"creature,\" but in this political context, it refers to \"things created by humans,\" specifically social and governmental structures.\n\n**\"Tracing pattern\" (v. 21)**: The word *hypogrammon* refers to a model of letters given to children to trace over while learning to write. It is a vivid image of precise imitation.\n\n**\"The wooden beam\" (v. 24)**: The Greek *xylon* means \"wood,\" \"tree,\" or \"timber.\" By using this term instead of *stauros* (cross), the author alludes to Deuteronomy 21:23, signaling that Christ took upon himself the curse associated with being \"hanged on a tree.\"\n\n**\"Guardian\" (v. 25)**: The Greek *episkopon* (often \"bishop\" or \"overseer\") refers to one who watches over or inspects. Combined with \"Shepherd,\" it emphasizes Christ's protective care and ultimate accountability for the \"souls\" of his people."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "In the same way, you wives should submit yourselves to your own husbands so that even if some of them refuse to obey the Word, they may be won over without a word through the way of life of their wives,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "as they observe your pure and reverent conduct.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Your adornment should not be the external kind—braiding hair, wearing gold jewelry, or putting on fine clothes.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Rather, let it be the hidden person of the heart, clothed in the incorruptible beauty of a spirit marked by gentle strength and tranquility, which is of great value in the sight of God.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For this is how the holy women of the past, who put their hope in God, used to adorn themselves: by submitting to their own husbands,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "just as Sarah obeyed Abraham and addressed him as \"lord.\" You have become her children by doing what is right and not giving in to any form of terror.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Husbands, in the same way, live together with your wives according to understanding. Show them honor as the more delicate vessel, since they are your fellow-heirs of the gift of life, so that nothing will cut off your prayers.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Finally, all of you should be of one mind, sympathetic, loving one another as a family, tenderhearted, and humble.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Do not repay evil with evil or insult with insult; on the contrary, respond with a blessing, because you were called to this so that you might inherit a blessing.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For: \"The one who desires to love life and see good days must keep their tongue from evil and their lips from speaking deceit;",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "they must turn away from evil and do good; they must seek peace and pursue it.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For the eyes of the Lord are on the righteous and his ears are open to their prayer, but the face of the Lord is set against those who do evil.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And who is there to harm you if you become enthusiasts for what is good?",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "But even if you should suffer for the sake of righteousness, you are blessed. Do not fear what they fear, and do not be shaken.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Instead, dedicate your hearts to Christ as Lord. Always be ready to give a reasoned defense to anyone who asks you for an explanation of the hope that is in you,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "but do so with gentleness and reverence. Maintain a clear conscience, so that in the very thing for which you are defamed, those who abuse your good way of life in Christ may be put to shame.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For it is better to suffer for doing good, if God’s will should allow it, than for doing evil.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For Christ also suffered for sins once for all—the righteous one on behalf of the unrighteous—in order to bring you to God. He was put to death in the flesh but made alive in the spirit.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "In that state, he went and made a proclamation to the spirits in prison,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "who were disobedient long ago when God’s patience waited in the days of Noah while the ark was being built. In it, a few—that is, eight souls—were brought safely through the water.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "This water prefigured the baptism that now saves you—not as the removal of dirt from the body, but as an appeal to God for a clean conscience through the resurrection of Jesus Christ,",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "who has gone into heaven and is at the right hand of God, with angels, authorities, and powers made subject to him.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Way of life\" (v. 1, 2, 16)**: The Greek *anastrophē* (ἀναστροφή) encompasses more than \"behavior\" or \"conduct\"; it refers to one's entire manner of living, social interactions, and moral character.\n\n**\"Won over without a word\" (v. 1)**: There is a deliberate wordplay here. The husbands \"disobey the Word\" (*tō logō*), but are won \"without a word\" (*aneu logou*). The wives' silent witness stands in contrast to the spoken Gospel they initially rejected.\n\n**\"Gentle strength\" (v. 4)**: The Greek *praeōs* (πραέως) describes strength under control or \"meekness\" in its classical sense—not weakness, but the gentleness of one who has the power to act otherwise. \n\n**\"Terror\" (v. 6)**: The word *ptoēsin* (πτόησιν) suggests a sudden, fluttering alarm or intimidation. In the context of the 1st-century household, this likely refers to the social and physical pressure a Christian wife might face from an unbelieving husband or a hostile society.\n\n**\"According to understanding\" (v. 7)**: *Kata gnōsin* (κατὰ γνῶσιν) implies living with a wife in a way that is informed by spiritual insight and practical consideration of her situation, rather than by cultural norms of dominance.\n\n**\"More delicate vessel\" (v. 7)**: The term *asthenesterō* (ἀσθενεστέρῳ) literally means \"weaker,\" but in the context of \"vessel\" (a common metaphor for the human person or body), it suggests something fine or fragile that requires specialized care. Peter is not making a claim about moral or intellectual inferiority, but rather instructing husbands to treat their wives with the care one gives to a valuable, delicate object, especially given their shared status as \"fellow-heirs.\"\n\n**\"Enthusiasts\" (v. 13)**: The Greek *zēlōtai* (ζηλωταὶ) means \"zealots\" or those burning with passion for a cause.\n\n**\"Dedicate your hearts to Christ as Lord\" (v. 15)**: Following the SBLGNT reading *kyrion de ton Christon hagiastate* (\"Sanctify Christ as Lord\"). This is an intentional allusion to Isaiah 8:12-13, where the prophet is told to sanctify the Lord of Hosts and not fear what the people fear. Peter applies this divine command directly to Christ.\n\n**\"Reasoned defense\" (v. 15)**: *Apologia* (ἀπολογία) refers to a formal speech in defense of a position, as in a court of law. It implies a rational, thoughtful response rather than a mere emotional reaction.\n\n**\"Appeal\" (v. 21)**: The word *eperōtēma* (ἐπερώτημα) is a technical legal term from the realm of contracts, referring to the formal question and answer that seals a pact. In baptism, the believer is not merely performing a ritual wash, but making a formal \"pledge\" or \"appeal\" to God, resulting in a clean conscience."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "Since Christ suffered in his human flesh, you must also arm yourselves with the same resolve; for the one who has suffered in the flesh has finished with sin,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "so that you might live the remainder of your earthly life no longer driven by human cravings, but by the will of God.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For you have already spent enough time doing what the pagans desire—living in unrestrained indecency, lusts, drunkenness, wild parties, drinking bouts, and lawless idolatries.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "They are now shocked that you do not plunge with them into the same flood of wasted life, and so they slander you.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But they will have to render an account to the one who stands ready to judge the living and the dead.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "This is why the good news was proclaimed even to those who are now dead: so that although they were judged in the flesh according to human standards, they might live in the spirit according to God’s standards.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "The end of all things is near. Therefore, be of sound mind and keep a clear head so that you can pray.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Above all, maintain a constant, straining love for one another, because love covers a multitude of sins.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Be hospitable to one another without grumbling.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Just as each of you has received a specific gift of grace, use it to serve one another as good stewards of the multi-faceted grace of God.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "If anyone speaks, let it be as one uttering the very oracles of God; if anyone serves, let it be from the strength that God supplies. Do this so that in all things God may be glorified through Jesus Christ, to whom belong the glory and the power forever and ever. Amen.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Beloved, do not be shocked by the fiery ordeal taking place among you to test you, as though something strange were happening to you.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Instead, insofar as you share in the sufferings of the Messiah, keep on rejoicing, so that you may also shout for joy when his glory is revealed.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "If you are insulted for the name of Christ, you are truly blessed, because the Spirit of glory—the very Spirit of God—rests upon you.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Certainly, let none of you suffer as a murderer, a thief, an evildoer, or as a meddler in the affairs of others.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But if anyone suffers as a \"Christian,\" let him not be ashamed, but let him glorify God in that name.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For it is time for judgment to begin with the household of God; and if it begins first with us, what will be the outcome for those who disobey the gospel of God?",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And \"if the righteous person is saved only with difficulty, where will the ungodly and the sinner appear?\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Therefore, let those who suffer according to the will of God entrust their lives to a faithful Creator by continuing to do what is good.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Human flesh\" (v. 1, 2)**: The Greek *sarx* (flesh) here denotes the sphere of human frailty, mortality, and the earthly condition. It is not inherently \"evil\" in Peter's usage here, but rather the arena where Christ suffered and where the believer’s transition from pagan desires to God’s will takes place.\n\n**\"Arm yourselves\" (v. 1)**: The verb *hoplisasthe* is a military command. The \"mindset\" or \"resolve\" (*ennoian*) is the weapon the believer uses to resist the pressure of former cravings.\n\n**\"Flood of wasted life\" (v. 4)**: The Greek *anachysin* refers to a pouring out or an overflow. In this context, it suggests a \"slop-bucket\" or a \"cesspool\" of excess. The term *asōtia* (wasted life/dissipation) refers to a lifestyle that is reckless and loses all \"saving\" or \"preserving\" qualities (the root is *a-sōzō*, \"not saving\").\n\n**\"Straining love\" (v. 8)**: The adjective *ektenē* suggests something stretched to its limit or held at full tension (like a taut rope). It implies that Christian love is not a passive feeling but an active, strenuous effort.\n\n**\"Oracles of God\" (v. 11)**: The word *logia* refers to divine utterances. In the Septuagint and other literature, it specifically refers to the inspired words of God given through prophets. The speaker is not merely sharing opinions but acting as a conduit for God’s own voice.\n\n**\"Fiery ordeal\" (v. 12)**: *Pyrōsei* literally means \"burning\" or \"smelting.\" It evokes the image of precious metal being refined in a furnace, suggesting that the \"test\" is intended to purify, not just to hurt.\n\n**\"Meddler in the affairs of others\" (v. 15)**: The Greek *allotriepiskopos* is a rare word (a *hapax legomenon*). It combines \"another’s\" and \"overseer.\" While often translated \"busybody,\" in a first-century context it may refer to someone who improperly interferes in social or political matters, potentially bringing unnecessary legal trouble upon the community.\n\n**\"Christian\" (v. 16)**: This term appears only three times in the New Testament. In the first century, it was likely a derogatory label used by outsiders (mocking them as \"partisans of Christ\"). Peter encourages his readers to take a name meant for shame and use it as a means to glorify God.\n\n**\"Entrust their lives\" (v. 19)**: The verb *paratithesthosan* is a technical term used for depositing money or valuables with a person for safekeeping. It implies a high level of trust that the \"deposit\" (the soul/life) will be protected by the \"faithful Creator.\""
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "To the elders among you, I appeal as a fellow-elder and a witness of the Messiah’s sufferings, as well as one who shares in the glory that is destined to be revealed:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Shepherd the flock of God that is in your care, exercising oversight not because you are forced to, but willingly, as God would have it; not out of a greedy desire for dishonest profit, but with a ready heart.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Do not act by dominating those in your charge, but by becoming models for the flock.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And when the Chief Shepherd is revealed, you will receive the unfading crown of glory.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "In the same way, you who are younger, yield to the authority of the elders. And all of you, gird yourselves with the apron of humility toward one another, because \"God sets himself against the arrogant, but gives grace to the humble.\"",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Humble yourselves, therefore, under the mighty hand of God, so that he may exalt you in the proper season,",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "throwing all your distracting anxiety upon him, because he cares for you.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Keep a clear head; stay alert. Your legal adversary, the Slanderer, prowls around like a roaring lion, seeking someone to swallow whole.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Stand against him, solid in your faith, knowing that the same kind of sufferings are being brought to completion by your family of believers throughout the world.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And after you have suffered a little while, the God of all grace, who called you into his eternal glory in Christ, will himself restore, support, strengthen, and establish you on a firm foundation.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "To him belongs the power throughout the ages. Amen.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Through Silvanus—whom I regard as a faithful brother to you—I have written briefly, encouraging you and testifying that this is the true grace of God. Stand firm in it.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "The sister-community in Babylon, chosen along with you, sends her greetings, as does Mark, my son.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Greet one another with a kiss of love. Peace to all of you who are in Christ.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Fellow-elder\" (v. 1)**: The Greek *sympresbyteros* is a rare term. By using it, the author places himself on the same level as the local leaders he is addressing, rather than emphasizing his apostolic rank, establishing a tone of fraternal appeal.\n\n**\"As God would have it\" (v. 2)**: The phrase *kata theon* (literally \"according to God\") implies more than just \"before God\"; it suggests performing the task in a manner consistent with God’s own character and will.\n\n**\"Dominating those in your charge\" (v. 3)**: *Katakyrieuontes* implies an oppressive, heavy-handed use of authority. The \"charges\" (*klērōn*) refers to the specific portions or groups of the community allotted to an elder’s care.\n\n**\"Apron of humility\" (v. 5)**: The verb *egkombōsasthe* refers to tying on a garment, specifically the work-apron worn by slaves to keep their clothes clean. This is a vivid cultural allusion to servanthood, likely echoing Jesus’s action of girding himself to wash the disciples' feet.\n\n**\"Mighty hand of God\" (v. 6)**: This is a standard Septuagint (LXX) idiom for God’s intervention in history, particularly in the Exodus. It carries a dual sense of God’s discipline and his power to deliver.\n\n**\"Legal adversary, the Slanderer\" (v. 8)**: The Greek *antidikos* is a technical term for an opponent in a lawsuit. *Diabolos* means \"slanderer\" or \"false accuser.\" Together, they depict the enemy not just as a monster, but as a prosecutor seeking to condemn believers.\n\n**\"Family of believers\" (v. 9)**: *Adelphotēti* is a collective noun (\"brotherhood\"). It emphasizes the corporate nature of the Christian experience; the readers are not suffering in isolation but as part of a global family.\n\n**\"Restore\" (v. 10)**: *Katartisei* means to mend or make complete. It was used for setting broken bones or mending fishing nets. It suggests that God will repair the damage done by persecution.\n\n**\"Babylon\" (v. 13)**: In the late first century, \"Babylon\" was a common Jewish and Christian cryptogram for Rome, the new center of worldly power and source of persecution. \n\n**\"The sister-community\" (v. 13)**: The Greek is a feminine singular adjective (*syneklektē*), meaning \"the co-chosen lady.\" While some traditional translations suggest \"she who is at Babylon,\" it is almost certainly a personification of the local church in that city."
    }
  ]
}