{
  "book": "1Thessalonians",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul, Silvanus, and Timothy, to the assembly of the Thessalonians in God the Father and the Lord Jesus Christ: Grace to you and peace.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "We always give thanks to God for all of you, mentioning you in our prayers,",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "constantly calling to mind the work produced by your faith, the labor prompted by your love, and the patient endurance inspired by your hope in our Lord Jesus Christ, in the presence of our God and Father.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For we know, brothers and sisters loved by God, that he has chosen you,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "because our good news did not come to you in word only, but also with power, with the Holy Spirit, and with deep conviction. You know what kind of men we proved to be among you for your sake.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And you became imitators of us and of the Lord, for you welcomed the message in the midst of great affliction with the joy of the Holy Spirit,",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "so that you became a model for all the believers in Macedonia and in Achaia.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For the message of the Lord has resounded from you—not only in Macedonia and Achaia, but your faith toward God has gone out to every place, so that we have no need to say anything.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For they themselves report about us, describing the kind of reception we had among you, and how you turned to God from idols to serve as bondservants to the living and true God,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "and to wait for his Son from the heavens, whom he raised from the dead—Jesus, the one who rescues us from the coming wrath.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Assembly\" (v. 1)**: The Greek *ekklesia* refers to a summoned group of people. In a Greek city-state, it was the assembly of citizens called to conduct civic business. By using this term, Paul identifies the believers as a formal, recognized body with a new \"citizenship\" in God and Christ. \"Church\" in modern English often carries architectural or institutional baggage that *ekklesia* lacks.\n\n**\"Work... labor... endurance\" (v. 3)**: The Greek uses a series of genitives (*ergou tēs pisteōs*, *kopou tēs agapēs*, *hypomonēs tēs elpidos*) that denote the source or characteristic of the action. The translation uses \"produced by,\" \"prompted by,\" and \"inspired by\" to capture the dynamic relationship: faith is active, love is wearying (the word *kopos* implies exhausting toil), and hope provides the capacity to remain under pressure.\n\n**\"Affliction\" (v. 6)**: The Greek *thlipsis* literally means pressure or crushing weight. In the first century, it described the social, economic, and physical persecution faced by those who abandoned the local cults for the \"assembly\" of Christ.\n\n**\"Resounded\" (v. 8)**: *Exechētai* is a rare and vivid verb (from which we get \"echo\") that suggests the blast of a trumpet or a loud, ringing sound that continues to reverberate. The message didn't just spread; it rang out.\n\n**\"Serve as bondservants\" (v. 9)**: The verb *douleuein* implies the total devotion and lack of autonomy of a *doulos* (slave/servant). In this context, it marks the shift from being \"enslaved\" to idols (v. 9) to a voluntary and exclusive service to the \"living and true God.\"\n\n**\"Rescues\" (v. 10)**: The Greek *rhuomenon* is a present participle, suggesting an ongoing or characteristic action. Jesus is \"the one who is rescuing us.\" It depicts a deliverer who snatches someone out of the path of danger. \n\n**\"Wrath\" (v. 10)**: *Orgē* does not refer to a temperamental outburst, but to the settled, holy opposition of God to evil and injustice—the \"coming judgment\" or \"retribution\" that was a standard part of early Christian eschatological expectation."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "For you yourselves know, brothers and sisters, that our entry among you was not without effect.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Instead, even though we had already suffered and been outrageously mistreated in Philippi—as you well know—we found the candid boldness in our God to speak the gospel of God to you in the face of intense opposition.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For our appeal does not spring from some delusion, or from impure motives, or from a desire to deceive.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Rather, because we have been tested and approved by God to be entrusted with the gospel, we speak as we do—not as those trying to please people, but to please God, the one who examines our hearts.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For as you know, we never used the language of flattery, nor did we put on a mask to hide greed—God is our witness.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Nor did we seek glory from human beings, whether from you or from others.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Although as Christ’s apostles we could have stood on our dignity and asserted our authority, we were gentle in your midst, like a nursing mother tenderly caring for her own children.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Having such a deep, yearning affection for you, we were delighted to share with you not only the gospel of God but our very lives, because you had become so dear to us.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For you remember, brothers and sisters, our labor and toil. We worked night and day so that we would not be a financial burden to any of you while we proclaimed to you the gospel of God.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "You are witnesses, and so is God, of how devoutly, righteously, and blamelessly we conducted ourselves toward you who believe.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "For you know how we treated each one of you like a father treats his own children—",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "encouraging you, comforting you, and imploring you to walk in a manner worthy of the God who calls you into his own kingdom and glory.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And for this reason we also thank God constantly: when you received the word of God’s message which you heard from us, you did not accept it as a human word, but as what it truly is—the word of God, which is also at work in you who believe.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "For you, brothers and sisters, became imitators of the churches of God in Christ Jesus that are in Judea, because you suffered the same things from your own countrymen as they did from the Judeans—",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "who killed both the Lord Jesus and the prophets, and drove us out. They do not please God and are hostile to all people,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "hindering us from speaking to the Gentiles so that they might be saved. In this way, they are always filling up the measure of their sins to the limit. But God’s indignation has finally overtaken them.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "As for us, brothers and sisters, when we were orphaned by being separated from you for a short time—in person, but not in heart—we were all the more eager, with intense longing, to see you face to face.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "For we wanted to come to you—I, Paul, tried again and again—but Satan thwarted us.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "For who is our hope or joy or crown of boasting before our Lord Jesus at his coming? Is it not you?",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Indeed, you are our glory and our joy.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Not without effect\" (v. 1)**: The Greek *kenē* (empty) can mean empty of content, but in this context of Paul’s \"entry,\" it refers to the results or the power of the mission. It wasn't a \"hollow\" or \"fruitless\" visit.\n\n**\"Candid boldness\" (v. 2)**: The verb *parrēsiazomai* refers to the Greco-Roman ideal of *parrhēsia*—the right and courage to speak the unvarnished truth, especially in the face of political or social pressure.\n\n**\"Intense opposition\" (v. 2)**: The Greek *agōn* (from which we get \"agony\") refers to an athletic contest or a legal struggle. It implies a strenuous, exhausting conflict.\n\n**\"Stood on our dignity and asserted our authority\" (v. 7)**: The phrase *en barei einai* literally means \"to be in weight.\" While often translated as \"being a burden\" (financially), the contrast with \"gentle\" and the title \"apostles\" suggests Paul is talking about the \"weight\" of his apostolic status—his right to demand honor and deference.\n\n**\"Nursing mother\" (v. 7)**: The Greek *trophos* refers specifically to a woman who provides nourishment, whether a mother or a wet-nurse. The verb *thalpē* means to warm or cherish, often used of a bird brooding over its nest.\n\n**\"Our very lives\" (v. 8)**: The Greek *psychas* is often translated \"souls,\" but in this context, it refers to the totality of their being or their very existence. They didn't just give a speech; they gave themselves.\n\n**\"Word of God’s message\" (v. 13)**: Literally \"the word of hearing\" (*logon akoēs*). This reflects a Hebrew/Aramaic idiom where \"hearing\" refers to the report or the message that was heard.\n\n**\"Hostile to all people\" (v. 15)**: Paul is likely alluding to the common Greco-Roman critique of the era (noted by historians like Tacitus) that Jews possessed *odium humani generis* (hatred of the human race) because of their refusal to participate in the social and religious life of the Gentiles. Paul repurposes this cultural trope to criticize those blocking the mission to the Gentiles.\n\n**\"Orphaned\" (v. 17)**: The Greek *aporphanisthentes* is a very strong term. While usually meaning a child losing a parent, it can mean any bereaved separation of a family unit. It conveys the visceral pain Paul felt at being torn away from the community.\n\n**\"Coming\" (v. 19)**: The Greek *parousia* originally referred to the arrival of a king or high official for a state visit. Paul uses it as a technical term for the royal return of Jesus.\n\n**\"Crown of boasting\" (v. 19)**: The *stephanos* was the laurel wreath given to the victor in an athletic contest. Paul views the Thessalonian believers as his \"victory wreath\" when he stands before Jesus."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, when we could no longer contain our concern, we thought it best to be left behind in Athens alone,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "and we sent Timothy—our brother and God’s fellow-worker in the Good News of the Anointed—to strengthen you and encourage you in your faith,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "so that no one would be unnerved by these crushing pressures. For you yourselves know that we are positioned for this very thing.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Indeed, when we were with you, we told you in advance that we were destined to be crushed by such pressure, and as you know, that is exactly what happened.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For this reason, when I could no longer contain my concern, I sent Timothy to find out about your faith, fearing that the Tempter had somehow tested you and that our hard labor might have been for nothing.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But now Timothy has just returned to us from you and has brought the good news of your faith and love. He told us that you always have kind memories of us and long to see us, just as we long to see you.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Because of this, brothers and sisters, in all our own distress and crushing pressure, we were encouraged concerning you through your faith.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For now we truly live, if you are standing firm in the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For how can we ever give enough thanks to God in return for you, considering all the joy we feel because of you in the presence of our God?",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Night and day we pray with intense earnestness that we might see you face to face and supply whatever is missing to make your faith complete.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Now may our God and Father himself and our Lord Jesus direct our way to you.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "And may the Lord cause you to increase and overflow in love for one another and for all people, just as we do for you.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "This is so that he may strengthen your hearts to be blameless in holiness before our God and Father at the Royal Arrival of our Lord Jesus with all his holy ones.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Could no longer contain our concern\" (v. 1, 5)**: The Greek *stegontes* (from *stegō*) literally refers to a roof or a vessel that \"covers\" or \"holds back\" water. In this context, it describes the emotional state of being unable to further restrain or \"hold in\" one's anxiety and care for the community.\n\n**\"Fellow-worker of God\" (v. 2)**: Some manuscripts read \"servant\" or \"minister,\" but the earliest and most difficult reading (SBLGNT/NA28) is *synergon tou theou*. This reflects Paul's high view of his team’s agency—they are not merely tools, but active participants alongside God in the work of the Good News.\n\n**\"The Anointed\" (v. 2)**: The Greek *Christos* is a translation of the Hebrew *Mashiach*. Using \"the Anointed\" reminds the reader that this is a title (the Messianic King) rather than a proper surname.\n\n**\"Unnerved\" (v. 3)**: The verb *sainesthai* originally referred to a dog wagging its tail or fawning. In the passive, it came to mean being agitated, disturbed, or \"shaken\" by external influences or flattery during trial. \"Unnerved\" captures the sense of losing one's internal resolve due to external pressure.\n\n**\"Crushing pressures\" (v. 3, 4, 7)**: The Greek *thlipsis* denotes a squeezing or pressing down. While often translated as \"affliction\" or \"tribulation,\" these words have become \"religious\" terms that lose the physical intensity of the original. \"Crushing pressure\" conveys the social and physical weight the Thessalonians were enduring.\n\n**\"Positioned\" (v. 3)**: The Greek *keimetha* means \"to be laid\" or \"set.\" It suggests that their suffering was not an accident of history but a divine appointment or a fundamental part of their situation in the world.\n\n**\"Make your faith complete\" (v. 10)**: The verb *katartisai* means to mend, repair, or fit together. It was used for mending fishing nets or setting broken bones. Paul sees their faith not as \"bad,\" but as needing the remaining \"pieces\" or \"repairs\" that only further apostolic instruction can provide.\n\n**\"Royal Arrival\" (v. 13)**: The Greek *parousia* refers to the presence or \"coming\" of a person. In the first century, it was the technical term for the formal visit of a king or emperor to a city (a \"royal advent\"). \"Arrival\" or \"Presence\" captures the tangible, political, and physical expectation better than the more abstract \"coming.\""
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "Now then, brothers and sisters, we ask and urge you in the Lord Jesus: you received from us instructions on how you must conduct your lives to please God—just as you are already doing—but we ask that you do so even more.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For you know what authoritative instructions we gave you through the Lord Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For this is the will of God: your consecration. This means you must stay away from sexual immorality.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Each of you must learn how to gain mastery over your own body in a way that is holy and honorable,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "not driven by lustful passion like the outsiders who do not know God.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "No one should overstep or take advantage of a brother or sister in this matter, because the Lord is the one who executes justice in all these things, just as we previously told you and solemnly warned you.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For God did not call us to a life of impurity, but to one of holiness.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Therefore, the person who rejects this is not rejecting a human being, but God—the very one who gives his Holy Spirit to you.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Now, concerning love for the family of believers, you have no need for anyone to write to you, for you yourselves have been taught by God to love one another.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Indeed, you are already doing this for all the brothers and sisters throughout Macedonia. But we urge you, brothers and sisters, to do so even more.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Make it your ambition to lead a quiet life, to mind your own business, and to work with your hands, just as we commanded you.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "In this way, your conduct will be respected by those outside the community, and you will not be dependent on anyone.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "We do not want you to be uninformed, brothers and sisters, about those who have fallen asleep in death, so that you do not grieve like the rest of the world, which has no hope.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "For since we believe that Jesus died and rose again, we also believe that God will bring with Jesus those who have fallen asleep through him.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For we tell you this by a word from the Lord: we who are still alive, who are left until the Arrival of the Lord, will certainly not precede those who have fallen asleep.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For the Lord himself will descend from heaven with a command of authority, with the call of an archangel, and with the trumpet-blast of God. Then, the dead in Christ will rise first.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Afterward, we who are still alive and remaining will be swept up together with them in the clouds to meet the Lord in the air as he arrives. And so we will be with the Lord forever.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Therefore, encourage one another with these words.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Conduct your lives\" (v. 1)**: The Greek *peripatein* literally means \"to walk.\" In both Jewish (*halakhah*) and Pauline thought, this is a standard idiom for one's moral conduct and daily lifestyle.\n\n**\"Authoritative instructions\" (v. 2)**: The term *parangelia* carries a military or official weight, denoting commands passed down from a superior officer. \n\n**\"Gain mastery over your own body\" (v. 4)**: The Greek *to heautou skeuos ktasthai* (literally \"to acquire/possess his own vessel\") is notoriously difficult. While some see \"vessel\" as a metaphor for a wife, the context of personal \"consecration\" and the contrast with \"lustful passion\" suggests Paul is referring to self-control over one’s own physical person. \"Gain mastery\" captures the sense of *ktasthai* as an ongoing discipline or acquisition of self-rule.\n\n**\"Love for the family of believers\" (v. 9)**: The Greek *philadelphia* refers specifically to the love between siblings. In the early Christian context, this was a radical reclaiming of kinship language for the faith community.\n\n**\"Fallen asleep in death\" (v. 13, 14, 15)**: The verb *koimaō* was a common euphemism for death, but in the New Testament context, it underscores the hope of resurrection—sleep implies a future awakening.\n\n**\"The Arrival\" (v. 15)**: The Greek *parousia* referred to the official visit of a king or high-ranking official to a city. It denotes not just a \"coming,\" but a royal presence that demands preparation.\n\n**\"To meet the Lord as he arrives\" (v. 17)**: The term *apantēsis* is a technical term used for a delegation of citizens who leave their city to meet a visiting dignitary on the road, in order to formally escort them back into the city. Paul’s imagery suggests that the believers meet the Lord in the air not to stay there, but to join His triumphal procession to earth."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "Now, concerning the chronology and the specific timing of these events, brothers and sisters, you have no need for anything to be written to you.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For you yourselves know with perfect accuracy that the Day of the Lord is coming like a thief in the night.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "While people are saying, “Peace and security,” then sudden destruction will come upon them, just as birth pains come upon a woman with a child in her womb, and they will certainly not escape.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But you, brothers and sisters, are not in the darkness, so that the Day should catch you by surprise like a thief.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "For you are all children of light and children of the day. We do not belong to the night or to the darkness.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "So then, let us not sleep as the rest do, but let us stay awake and keep our spiritual sobriety.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For those who sleep, sleep at night, and those who get drunk, get drunk at night.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But since we belong to the day, let us stay sober, putting on the breastplate of faith and love, and for a helmet, the hope of salvation.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For God did not appoint us for his wrath, but for the possession of salvation through our Lord Jesus Christ,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "who died for us so that whether we are awake or asleep, we might live together with him.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Therefore, encourage one another and build each other up, just as you are already doing.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "We ask you, brothers and sisters, to recognize those who labor among you, who lead you in the Lord and admonish you.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Hold them in the highest possible regard in love because of their work. Be at peace among yourselves.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And we urge you, brothers and sisters: Admonish the undisciplined, encourage the discouraged, take hold of the weak, and be patient with everyone.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "See to it that no one repays evil for evil to anyone, but always pursue what is good for one another and for all.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Rejoice always.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "Pray without ceasing.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "In every circumstance give thanks, for this is God’s will for you in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Do not extinguish the Spirit's fire.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Do not treat prophecies as if they are nothing.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Instead, test everything. Hold tightly to what is good.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Keep your distance from every form of evil.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Now may the God of peace himself set you apart as holy in every way; and may your whole being—spirit, soul, and body—be kept blameless at the *parousia* of our Lord Jesus Christ.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "The one who calls you is faithful, and he will do it.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Brothers and sisters, pray for us.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "Greet all the brothers and sisters with a holy kiss.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "I place you under a solemn oath before the Lord to have this letter read to all the brothers and sisters.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "The grace of our Lord Jesus Christ be with you.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Chronology and the specific timing\" (v. 1)**: The Greek distinguishes between *chronos* (linear, calendar time) and *kairos* (the appointed, critical, or opportune time). The plural usage here suggests Paul is addressing both the general timeframe and the specific nature of the end-times epochs.\n\n**\"Peace and security\" (v. 3)**: This phrase (*eirēnē kai asphaleia*) likely echoes the Roman imperial slogan *Pax et Securitas*. Paul is contrasting the false political stability promised by the Empire with the sudden reality of divine judgment.\n\n**\"Spiritual sobriety\" (v. 6, 8)**: The verb *nēphō* literally means to be sober (not drunk), but in this context, it refers to a state of mental and spiritual alertness, being clear-headed and vigilant.\n\n**\"Possession of salvation\" (v. 9)**: The Greek *peripoiēsin* carries the sense of acquiring, gaining, or preserving something for oneself. It implies that salvation is a result of God's appointment that the believer then enters into or takes possession of.\n\n**\"Undisciplined\" (v. 14)**: The word *ataktous* is a military term referring to soldiers who are out of rank or \"out of step.\" In the Thessalonian context, it likely refers to those who were being idle or disruptive to the community's order.\n\n**\"Encourage the discouraged\" (v. 14)**: The Greek *oligopsychous* literally means \"small-souled.\" It refers to those who are faint-hearted, losing hope, or overwhelmed by the pressure of persecution.\n\n**\"Do not extinguish the Spirit's fire\" (v. 19)**: The verb *sbennumi* is used for putting out a fire or a lamp. Paul treats the Spirit's presence and gifts as a flame that can be dampened by the community's attitudes or actions.\n\n**\"Treat prophecies as if they are nothing\" (v. 20)**: The Greek *exoutheneite* means to treat with contempt or regard as \"zero.\" It is stronger than merely \"despise.\"\n\n**\"Test everything\" (v. 21)**: The term *dokimazete* refers to the process of assaying metals to determine their purity. Paul is calling for a rigorous discernment of prophetic utterances.\n\n**\"Parousia\" (v. 23)**: This term is retained as it refers specifically to the \"arrival\" or \"royal presence\" of a high-ranking official or king. In the first century, it carried a specific political and social weight regarding the arrival of the Emperor, which Paul here applies to Jesus.\n\n**\"I place you under a solemn oath\" (v. 27)**: The Greek *enorkizō* is a very strong term, essentially adjuring the listeners as if in a court of law. Paul considers the public reading of this letter to be a matter of grave spiritual necessity."
    }
  ]
}