{
  "book": "1Timothy",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul, an apostle of Christ Jesus by the mandate of God our Savior and of Christ Jesus our hope,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "to Timothy, my true-born child in the faith: Grace, mercy, and peace from God the Father and Christ Jesus our Lord.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "I urge you now, as I did when I was leaving for Macedonia, to remain in Ephesus so that you may direct certain people not to teach different and distorting doctrines,",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "nor to occupy themselves with myths and endless genealogies. These things promote mere speculations rather than God’s ordered plan, which operates by faith.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "The goal of this directive is love that springs from a pure heart, a good conscience, and a non-performative faith.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Some people, having missed this mark, have veered off into meaningless chatter.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "They want to be teachers of the Law, yet they understand neither the words they are using nor the matters about which they make such confident assertions.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Now we know that the Law is excellent, provided that one uses it for its intended legal purpose.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "We must recognize that law is not enacted for the person who is already upright, but for those who are lawless and rebellious, the impious and the habitual sinners, the unholy and the profane. It is for those who strike their fathers or mothers, for murderers,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "for the sexually immoral, for men who bed other men, for slave-traders, for liars, for perjurers, and for whatever else stands in opposition to healthy teaching.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "This is consistent with the Good News of the glory of the blessed God, which was entrusted to me.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "I give thanks to the one who empowered me, Christ Jesus our Lord, because he considered me reliable and appointed me to his service—",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "even though I was formerly a slanderer, a persecutor, and an insolent bully. Yet I was shown mercy because I acted in the ignorance of unbelief,",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "and the grace of our Lord overflowed toward me, accompanied by the faith and love that are found in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "This is a trustworthy saying, deserving of full acceptance: Christ Jesus came into the world to save sinners—of whom I am the foremost.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But I was shown mercy for this very reason: so that in me, the foremost of sinners, Christ Jesus might demonstrate his exhaustive patience as a working model for those who would later believe in him for eternal life.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Now to the King of the Ages, the incorruptible, invisible, only God, be honor and glory throughout the ages of ages. Amen.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "I am entrusting this charge to you, Timothy, my child, in accordance with the prophecies previously made about you, so that by them you may wage the good campaign.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "Hold on to faith and a good conscience, which some have rejected and thereby suffered a shipwreck of their faith.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Among these are Hymenaeus and Alexander, whom I have handed over to the Accuser so that they may be disciplined to stop their slandering.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Mandate\" (v. 1)**: The Greek *epitagē* carries a sense of a royal decree or an authoritative directive. \"Command\" is common, but \"mandate\" better captures the official, commissioned nature of Paul's apostleship.\n\n**\"True-born child\" (v. 2)**: *Gnēsiō* refers to a legitimate, biological child as opposed to an illegitimate one. In this context, it highlights the authenticity and \"legal\" spiritual standing of Timothy’s relationship with Paul.\n\n**\"God’s ordered plan\" (v. 4)**: *Oikonomia* refers to the management of a household or an administration. In the context of \"faith,\" it suggests the way God has ordered his household and his dealings with humanity, contrasted with the chaotic \"speculations\" of the false teachers.\n\n**\"Non-performative faith\" (v. 5)**: The Greek *anypokritos* is the negation of *hypokritēs* (an actor or performer). Consistent with the translation of *hypokritai* as \"performers,\" this term describes a faith that is not a theatrical display for others but is genuine and sincere.\n\n**\"Intended legal purpose\" (v. 8)**: Paul uses a wordplay (*nomos* / *nomimōs*—law / lawfully). The translation \"intended legal purpose\" captures the idea that the Law has a specific function and boundary.\n\n**\"Men who bed other men\" (v. 10)**: *Arsenokoitais*. This compound word (*arsēn* \"male\" and *koitē* \"bed\") derives from the Septuagint (Leviticus 18:22 and 20:13). The translation focuses on the literal meaning of the Greek compound within the context of a list of social and moral violations.\n\n**\"Slave-traders\" (v. 10)**: *Andrapodistais* specifically refers to those who deal in the kidnapping and selling of human beings.\n\n**\"Insolent bully\" (v. 13)**: *Hybristēs* describes someone whose pride leads them to treat others with contempt and violent insolence. \"Bully\" captures the social dimension of this arrogance.\n\n**\"Foremost\" (v. 15, 16)**: *Prōtos* can mean first in time or first in rank. Paul is likely using it here to mean \"chief\" or \"prime example,\" rather than simply the \"first\" sinner chronologically.\n\n**\"Working model\" (v. 16)**: *Hypotypōsis* refers to an outline, a sketch, or a prototype. Paul’s conversion is the \"prototype\" that shows how God’s mercy works for everyone else.\n\n**\"The Accuser\" (v. 20)**: *Satanas* is a transliteration of the Hebrew *Satan*, which means \"the adversary\" or \"the accuser.\" In a context involving \"handing over\" for discipline, the functional title is more descriptive than the proper name.\n\n**\"Slandering\" (v. 20)**: *Blasphemein* in a first-century context often referred to slandering God's name or the truth of the gospel, rather than just \"cursing.\" Given the context of the false teachers in Ephesus, it refers to their damaging speech against the apostolic message."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "First of all, then, I urge that petitions, prayers, intercessions, and thanksgivings be made for all people—",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "for kings and all who sit in positions of eminence—so that we may lead a life of undisturbed stillness and peace, characterized by total reverence for God and serious-minded dignity.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "This is noble and welcome in the sight of God our Savior,",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "who desires all people to be saved and to come to a full recognition of the truth.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For there is one God, and there is one mediator between God and humanity: the man Christ Jesus,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "who gave himself as the ransom-price paid in place of all—the testimony to be proclaimed at its own appointed time.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "It was for this that I was appointed a herald and an emissary—I am telling the truth, I am not lying—a teacher of the nations in faith and truth.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Therefore, I want the men in every place of worship to pray, lifting up holy hands without anger or argumentative dispute.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Likewise, I want the women to adorn themselves in respectable apparel, with modesty and disciplined self-control, not with elaborate hair-braiding and gold or pearls or expensive clothing.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Instead, they should be distinguished by good works, as is proper for women who make a public profession of the worship of God.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Let a woman learn in quietness, in full submission to the established order.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "I do not permit a woman to teach or to exercise authority over a man; rather, she is to remain in a state of quietness.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For Adam was molded first, then Eve.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And Adam was not the one deceived; it was the woman who was thoroughly deceived and fell into transgression.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Yet she will be brought safely through the bearing of children, provided they continue in faith, love, and holiness, with disciplined self-control.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Petitions, prayers, intercessions, and thanksgivings\" (v. 1)**: The Greek employs four distinct terms for prayer. *Deēseis* refers to requests for specific needs; *proseuchas* is a general term for worshipful prayer; *enteuxeis* refers to bold petitions or appeals made to a superior; and *eucharistias* refers to gratitude.\n\n**\"Undisturbed stillness and peace\" (v. 2)**: The Greek *ēremon* and *hēsychion* carry a nuance of social and internal tranquility. The goal of praying for civil authorities is not necessarily their conversion, but a stable society where the Christian life can be lived without external disruption.\n\n**\"Full recognition\" (v. 4)**: The Greek *epignōsin* implies more than mere intellectual data; it refers to a deep, experiential acknowledgment or \"full knowledge\" of the truth.\n\n**\"Ransom-price paid in place of\" (v. 6)**: The term *antilytron* is a strong compound. While *lytron* means \"ransom,\" the prefix *anti-* emphasizes the substitutionary nature of the payment—a price paid *in the place of* others.\n\n**\"Disciplined self-control\" (v. 9, 15)**: The Greek *sōphrosynē* was a cardinal virtue in the Greco-Roman world, signifying a \"sound mind,\" \"discretion,\" or \"moderation.\" It is the ability to govern one's desires and impulses with wisdom.\n\n**\"Exercise authority\" (v. 12)**: The Greek *authentein* is a rare term (a *hapax legomenon* in the NT). In the first century, it could carry connotations ranging from \"assuming authority\" to \"domineering\" or \"instigating.\" Given the context of \"learning in quietness,\" it refers to a functional role of governing or taking the lead over the men in the assembly.\n\n**\"Quietness\" (v. 11, 12)**: The Greek *hēsychia* does not necessarily mean absolute silence (the absence of sound), but rather a settled, non-disruptive spirit that is ready to learn.\n\n**\"Brought safely through the bearing of children\" (v. 15)**: The Greek *sōthēsetai* (she will be saved/preserved) combined with *teknogonia* (the bearing of children) is notoriously difficult. Given the context of v. 14 (the Fall), this likely refers to the fact that while woman was the first to fall, she is \"brought safely\" through the domestic sphere of childbearing (which produced the Messiah, the \"seed\" of the woman) or that childbearing is the specific sphere in which the Christian woman works out her salvation in faithfulness. The shift from \"she\" (the woman/Eve) to \"they\" (women in general) indicates the representative nature of the statement."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "This is a reliable saying: If anyone aspires to the office of an overseer, they desire a noble task.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "It is necessary, then, for the overseer to be irreproachable—a man of one woman, clear-headed, self-controlled, orderly in conduct, hospitable, and skillful at teaching.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "He must not be a heavy drinker or a bully, but instead be gentle and yielding, non-combative, and free from the love of money.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "He must manage his own household well, keeping his children in holy order with all dignity.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "(For if someone does not know how to manage their own household, how will they care for God’s assembly?)",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "He must not be a recent convert, so that he does not become puffed up with conceit and fall into the same judgment as the slanderer.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Furthermore, he must have a good reputation among those outside the community, so that he does not fall into disgrace and into the slanderer’s snare.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Assistants, likewise, must be dignified, not double-tongued, not addicted to much wine, and not greedy for shameful gain.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "They must hold the revealed secret of the faith with a clean conscience.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Let these people also be tested first; then, if they are found beyond reproach, let them serve as assistants.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "The women, likewise, must be dignified, not slanderers, but clear-headed and faithful in all things.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Assistants must be men of one woman, managing their children and their own households well.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For those who have served well as assistants acquire a noble standing for themselves and great boldness in the faith that is in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "I am writing these things to you, hoping to come to you soon.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "But if I am delayed, I want you to know how one ought to conduct oneself in God’s household, which is the assembly of the living God, the pillar and foundation of the truth.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Beyond all dispute, the revealed secret of our devotion is great: He who was revealed in the flesh, was vindicated in the Spirit, was seen by messengers, was proclaimed among the nations, was believed on in the world, was taken up in glory.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Overseer\" (v. 1, 2)**: The Greek *episkopos* refers to one who watches over or guards a community. While often translated \"bishop,\" the term in the first century carried the sense of a functional guardian or superintendent within a household or civic organization.\n\n**\"A man of one woman\" (v. 2, 12)**: The Greek *mias gynaikos andra* is an idiom emphasizing character and marital fidelity. It literally means a \"one-woman man.\" Rather than a narrow legalistic requirement regarding remarriage or celibacy, it denotes a man who is entirely faithful to his wife.\n\n**\"Gentle and yielding\" (v. 3)**: The Greek *epieikēs* describes a person who does not insist on every legal right but is reasonable, equitable, and considerate. It is the opposite of being \"combative\" (*amachos*).\n\n**\"Slanderer\" (v. 6, 7, 11)**: The Greek *diabolos* can be a proper noun (the Devil) or a common noun (a slanderer/accuser). In verses 6 and 7, the term likely refers to the \"Accuser\" (Satan), but in verse 11, where it describes the women, it clearly refers to the character trait of gossiping or slander. The translation uses \"slanderer\" to maintain the semantic link between the character flaw and the source of the judgment.\n\n**\"Assistants\" (v. 8, 12)**: The Greek *diakonoi* means \"servants\" or \"ministers.\" In this context, it refers to a recognized group within the assembly who assist the overseers. \"Assistants\" captures the functional relationship better than the transliterated title \"deacons\" might for a modern reader.\n\n**\"The women\" (v. 11)**: The Greek *gynaikas* can mean \"wives\" or \"women.\" Because the text lacks a possessive pronoun (\"their wives\") and follows the same structural formula used to introduce the deacons (*hōsautōs*, \"likewise\"), it likely refers to women serving in the role of *diakonos* rather than the wives of the male assistants.\n\n**\"Revealed secret\" (v. 9, 16)**: The Greek *mystērion* is not a puzzle to be solved, but a truth that was once hidden and has now been disclosed by God. \"Mystery\" in modern English often implies something confusing; \"revealed secret\" captures the Koine sense of a divine disclosure.\n\n**\"Devotion\" (v. 16)**: *Eusebeia* is often translated \"godliness.\" In the Greco-Roman world, it referred to the proper respect and performance of duties toward the gods and the social order. In a Christian context, it refers to the lived reality of one’s faith and piety.\n\n**\"He who\" (v. 16)**: Following the SBLGNT and the earliest manuscript evidence (*hos*), the hymn begins with a relative pronoun (\"Who\" or \"He who\") referring back to the \"secret\" or \"Christ,\" rather than the later manuscript tradition's *Theos* (\"God\"). The hymn is a rhythmic, six-part confession of the Christ-event."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "Now the Spirit explicitly says that in later times some will desert the faith, devoting themselves instead to misleading spirits and the teachings of demons.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "These things come through the theatrical performance of liars whose own consciences have been branded with a red-hot iron and rendered insensitive.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "They forbid people to marry and command them to abstain from certain foods—foods which God created to be shared with thanksgiving by those who believe and have come to fully know the truth.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For every creature of God is good, and nothing is to be rejected if it is received with thanksgiving;",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "for it is set apart as holy through the word of God and petition.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "By pointing these things out to the brothers and sisters, you will be a good servant of Christ Jesus, nurtured on the words of the faith and the sound teaching that you have followed closely.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "But refuse those godless and silly myths fit only for the senile. Instead, train yourself for devotion to God.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For while physical training is beneficial to a small degree, devotion to God is beneficial in every way, since it holds a promise of life both now and in the age to come.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "This saying is trustworthy and deserves full acceptance:",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "“To this end we labor to exhaustion and are insulted, because we have set our hope on the living God, who is the Savior of all people, particularly of those who believe.”",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Command and teach these things.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "Let no one look down on you because of your youth, but become a model for the believers in your speech, in your way of life, in love, in faith, and in purity.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Until I arrive, devote yourself to the public reading of Scripture, to exhortation, and to teaching.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Do not neglect the spiritual gift within you, which was given to you through prophecy when the council of elders laid their hands on you.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Cultivate these things; be absorbed in them, so that your progress may be evident to everyone.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Keep a close watch on yourself and on your teaching. Persevere in them; for by doing this you will save both yourself and those who hear you.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Theatrical performance\" (v. 2)**: The Greek *hypokrisis* refers to the work of a stage actor. While modern \"hypocrisy\" implies a gap between belief and action, the original sense highlights the deceptive *performance* of the false teachers.\n\n**\"Branded... and rendered insensitive\" (v. 2)**: The verb *kekaustēriasmenōn* refers to cauterization. This carries a dual nuance: they are \"branded\" as the property of the demonic forces mentioned in verse 1, and their consciences have been \"seared\" or numbed, making them incapable of moral feeling.\n\n**\"Senile myths\" (v. 7)**: The Greek *graōdēis* literally means \"characteristic of an old woman.\" In the rhetorical context of the first century, this was a technical term of derision for stories that were considered intellectually vacuous, superstitious, or lacking in logical foundation.\n\n**\"Devotion to God\" (v. 7, 8)**: The term *eusebeia* (often \"godliness\") encompasses more than internal piety; it describes a right-ordered life that expresses proper reverence and duty toward God in the sight of the community.\n\n**\"Labor to exhaustion\" (v. 10)**: The verb *kopiaō* implies intense, wearying labor—the kind of work that leaves one depleted.\n\n**\"Savior of all people, particularly of those who believe\" (v. 10)**: The Greek *malista* (\"especially\" or \"particularly\") indicates a distinction in how God’s salvation is applied. He is the \"Savior of all\" in a general or providential sense (providing life and grace to all), but He is the Savior of believers in a specific, effective sense.\n\n**\"Public reading\" (v. 13)**: The Greek *anagnōsei* in this context refers specifically to the practice of reading the Hebrew Scriptures (and likely early apostolic writings) aloud in the gathered assembly, a central feature of early Christian worship.\n\n**\"Council of elders\" (v. 14)**: The Greek *presbyterion* refers to the collective body of elders in the local church, emphasizing the communal and authoritative nature of Timothy’s commissioning."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "Do not rebuke an older man harshly, but appeal to him as you would a father. Treat younger men as brothers,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "older women as mothers, and younger women as sisters, with absolute propriety.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Give due support to widows who are truly destitute.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "But if a widow has children or grandchildren, they should first learn to practice their religion at home by showing care for their own household and making a fair return to their parents and grandparents, for this is pleasing in the sight of God.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "The woman who is truly a widow—left entirely alone—has set her hope on God and continues in her petitions and prayers night and day.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But the widow who lives for self-indulgent pleasure is dead even while she lives.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Command these things so that they may be above reproach.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "If anyone does not provide for his own people, and especially for those of his own household, he has denied the faith and is worse than an unbeliever.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Let a widow be put on the support list only if she is at least sixty years old, has been the wife of one husband,",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "and is well-known for good works: if she has raised children, shown hospitality to strangers, washed the feet of God’s people, helped those in distress, and devoted herself to every kind of good work.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "But refuse to enroll younger widows. For when their sensual desires draw them away from Christ, they want to marry,",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "incurring judgment because they have set aside their first commitment.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "At the same time, they also learn to be idle, wandering from house to house; and not merely idle, but also gossips and busybodies, saying things they should not.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Therefore, I want younger widows to marry, have children, manage their households, and give the adversary no opportunity for slander.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For some have already turned away to follow Satan.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "If any believing woman has widows in her family, she should assist them so that the church is not burdened, enabling it to assist those who are truly destitute.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Elders who lead well should be considered worthy of double honor, especially those who labor in preaching and teaching.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "For the Scripture says, \"Do not muzzle an ox while it is treading out the grain,\" and \"The worker is worthy of his pay.\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Do not entertain an accusation against an elder unless it is supported by two or three witnesses.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "As for those who persist in sin, rebuke them in the presence of everyone, so that the rest may be afraid.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "I charge you before God and Christ Jesus and the chosen angels to keep these instructions without prejudgment, doing nothing out of favoritism.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "Do not be hasty in the laying on of hands, and do not share in the sins of others; keep yourself pure.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Stop drinking only water, but use a little wine for the sake of your stomach and your frequent ailments.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "The sins of some people are conspicuous, going before them to judgment, but the sins of others trail behind.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "In the same way, good works are also conspicuous, and even those that are not cannot remain hidden forever.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Older man / Older women\" (v. 1-2)**: The Greek *presbyteros* can mean \"elder\" (an official) or simply \"older person.\" Given the immediate contrast with \"younger men\" and \"younger women\" and the familial context (father, mother, brother, sister), the reference here is to age rather than office. The official sense returns in verse 17.\n\n**\"Truly destitute\" (v. 3, 5, 16)**: The Greek *ontōs chēras* means \"widows who are really/truly widows.\" In the social context of the first century, this specifically referred to widows who had no surviving family to support them, leaving them entirely dependent on the community.\n\n**\"Practice their religion at home\" (v. 4)**: The Greek *eusebein* (to be pious/godly) is used here transitively with \"their own household.\" This reflects the Greco-Roman and Jewish concept that \"piety\" began with fulfilling duties toward one's parents and ancestors (*pietas*).\n\n**\"Wife of one husband\" (v. 9)**: *henos andros gynē* (a one-man woman). Similar to the qualification for overseers in chapter 3, this denotes marital fidelity and singular devotion, excluding those who were polyandrous or perhaps those who had remarried after a divorce.\n\n**\"First commitment\" (v. 12)**: *tēn prōtēn pistin* is literally \"the first faith.\" In this context, it refers to the pledge or vow of service a widow made when she was enrolled on the church’s support list, which was viewed as a commitment to Christ.\n\n**\"Double honor\" (v. 17)**: *diplēs timēs*. In the Greco-Roman world, *timē* referred to both \"honor/respect\" and \"price/payment.\" The context of verse 18 (the ox and the worker’s pay) makes it clear that this includes financial remuneration or provision, not just verbal respect.\n\n**\"Laying on of hands\" (v. 22)**: This refers to the act of ordination or formal commissioning for ministry. The warning to not be \"hasty\" suggests a period of testing to ensure a candidate's character.\n\n**\"Stop drinking only water\" (v. 23)**: *mēketi hydropotei* means \"no longer be a water-drinker.\" In the ancient world, water was often contaminated. Diluted wine was the standard beverage and was frequently used for medicinal purposes (specifically for digestive issues). \n\n**\"Conspicuous\" (v. 24-25)**: The Greek *prodēlos* means \"evident beforehand\" or \"plain for all to see.\" The author is contrasting sins that are immediately obvious with those that only come to light later, providing a rationale for why Timothy must not be hasty in his judgments of others."
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "All who are slaves under a yoke must consider their own masters worthy of every honor, so that the name of God and our teaching may not be slandered.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Those who have believing masters should not look down on them because they are brothers; instead, they should serve them all the more, because those who benefit from their good service are believers and beloved. Teach and urge these things.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "If anyone teaches a different doctrine and does not devote themselves to the healthy words of our Lord Jesus Christ and the teaching that accords with true godliness,",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "they are clouded with pride and understand nothing. They have a morbid obsession with controversies and battles over words, out of which come envy, strife, slanders, evil suspicions,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "and the constant friction of people who are corrupted in their minds and deprived of the truth, imagining that godliness is a means of financial gain.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Now, godliness with contentment is indeed a great means of gain.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "For we brought nothing into the cosmos, and it is certain that we cannot take anything out of it.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But if we have food and shelter, we will be satisfied with these.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Those who want to be rich fall into temptation and a snare, and into many mindless and harmful desires that sink people into ruin and destruction.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For the love of money is a root of all kinds of evil. By reaching for it, some have wandered away from the faith and pierced themselves through with many griefs.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "But you, O man of God, flee from these things. Pursue righteousness, godliness, faith, love, endurance, and a gentle spirit.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "Compete in the good competition of the faith. Take hold of the eternal life to which you were called when you made the good confession in the presence of many witnesses.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "I charge you in the presence of God, who gives life to all things, and of Christ Jesus, who testified to the good confession before Pontius Pilate,",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "to keep the commandment unstained and irreproachable until the appearing of our Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "This appearing will be shown at the proper time by the blessed and only Sovereign, the King of those who reign and Lord of those who exercise lordship,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "who alone possesses immortality and dwells in unapproachable light, whom no human being has seen or is able to see. To him be honor and eternal power. Amen.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Command those who are rich in this present age not to be haughty, nor to set their hope on the uncertainty of wealth, but on God, who richly provides us with everything for our enjoyment.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Tell them to do good, to be rich in good works, to be generous and ready to share,",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "storing up for themselves the treasure of a good foundation for the future, so that they may take hold of the life that is truly life.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "O Timothy, guard the deposit entrusted to you. Turn away from the profane empty-chatter and the contradictions of what is falsely called \"knowledge,\"",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "which some have professed and, in doing so, have missed the mark regarding the faith. Grace be with you all.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Healthy words\" (v. 3)**: The Greek *hygiainousin* is a medical metaphor. While many translations use \"sound,\" the original carries the sense of \"health-giving\" or \"wholesome,\" contrasted with the \"morbid obsession\" (*nosōn*, literally \"being sick\") of the false teachers in verse 4.\n\n**\"Clouded with pride\" (v. 4)**: The verb *tetyphōtai* comes from *typhos* (smoke or mist). It describes someone whose intellect is obscured by the \"smoke\" of their own conceit, making them unable to see reality clearly.\n\n**\"Contentment\" (v. 6)**: The Greek *autarkeia* was a significant term in Stoic and Cynic philosophy, referring to a self-sufficiency that is independent of external circumstances. Here, it is redefined as a sufficiency found in God rather than oneself.\n\n**\"Food and shelter\" (v. 8)**: The word *skepasmata* can refer to both clothing and the covering of a roof (shelter). It implies the basic necessities of life.\n\n**\"Root of all kinds of evil\" (v. 10)**: The Greek text lacks the definite article before \"root,\" and the context suggests that the love of money is a source of various evils rather than the exclusive source of every single sin in existence.\n\n**\"Compete in the good competition\" (v. 12)**: The Greek *agōnizou ton kalon agōna* uses athletic and military imagery. \"Fight the good fight\" is traditional, but \"competition\" or \"contest\" captures the flavor of the Greek games (the *agōn*) familiar to Timothy’s audience.\n\n**\"A gentle spirit\" (v. 11)**: The Greek *praüpathia* is a rare word combining \"gentle\" (*praüs*) and \"feeling/disposition\" (*pathos*). It refers to a disciplined calmness and a refusal to be easily provoked.\n\n**\"The appearing\" (v. 14)**: *Epiphaneia* was used in the first century to describe the visible manifestation of a deity or the formal visit of an emperor to a city. It carries more weight than a simple \"coming.\"\n\n**\"Sovereign\" (v. 15)**: The Greek *dynastēs* (whence we get \"dynasty\") emphasizes absolute power and authority. In a Roman context, applying these titles to God was a subversive claim that His authority surpassed that of the Emperor.\n\n**\"The life that is truly life\" (v. 19)**: The Greek *tēs ontōs zōēs* literally means \"the really-existing life.\" It contrasts the fleeting, \"uncertain\" nature of material wealth with the substantial reality of life in Christ.\n\n**\"The deposit\" (v. 20)**: *Parathēkē* refers to something of great value placed in another’s trust for safekeeping. It was a legal term for a \"sacred trust.\"\n\n**\"With you all\" (v. 21)**: The Greek pronoun *hymōn* is plural, indicating that although the letter is addressed to Timothy, the final blessing is intended for the entire church community."
    }
  ]
}