{
  "book": "2Corinthians",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul, an apostle of Christ Jesus through the will of God, and Timothy our brother, to the assembly of God that is in Corinth, together with all of God’s holy people throughout the whole province of Achaia:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Grace to you and peace from God our Father and the Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Blessed be the God and Father of our Lord Jesus Christ, the Father of mercies and the God of all encouragement,",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "who encourages us in all our crushing mountain of trouble, so that we may be able to encourage those in any kind of trouble through the encouragement with which we ourselves are encouraged by God.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For just as the sufferings of the Christ overflow into our lives, so also through the Christ our encouragement overflows.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "If we are being crushed, it is for your encouragement and salvation; if we are being encouraged, it is for your encouragement, which proves its effectiveness as you patiently endure the very same sufferings that we also suffer.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Our hope for you is firmly grounded, knowing that as you are partners in the sufferings, so you are also partners in the encouragement.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For we do not want you to be uninformed, brothers and sisters, about the crushing pressure we experienced in the province of Asia. We were burdened so utterly beyond our strength that we despaired even of living.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "In fact, within ourselves we carried the official sentence of death. This happened so that we would not trust in ourselves, but in the God who raises the dead.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "He rescued us from such a deadly peril and he will rescue us again; on him we have set our hope that he will continue to rescue us,",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "as you also join in helping us through your petitions. Then, as many faces look toward God, thanks will be offered by many on our behalf for the gift of grace granted to us.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For this is our reason for boasting: the testimony of our conscience that we have conducted ourselves in the world, and especially toward you, with a God-given holiness and transparency—not by the standards of human cleverness but by the grace of God.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "For we are not writing anything to you other than what you can read and understand. I hope you will understand fully,",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "just as you have already understood us in part, that we are your reason for boasting just as you are ours on the day of our Lord Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Confident in this, I previously intended to come to you first, so that you might receive a second benefit of grace.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "My plan was to visit you on my way to Macedonia, and to come back to you from Macedonia, and then be sent on my way by you toward Judea.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Since I intended this, I certainly didn't act with fickleness, did I? Or do I make my plans according to the flesh, so that in the same breath I say “Yes, yes” and “No, no”?",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "As God is faithful, our word to you is not “Yes” and “No.”",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "For the Son of God, Jesus Christ, who was proclaimed among you by us—by me, Silvanus, and Timothy—did not become “Yes” and “No,” but in him it has always been “Yes.”",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For every one of God’s promises finds its “Yes” in him. That is why it is through him that we utter the “Amen” to the glory of God.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Now the one who confirms us with you into Christ and who has anointed us is God,",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "who also placed his seal upon us and gave us the Spirit in our hearts as a down payment on what is to come.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "I call upon God as a witness against my own soul: it was to spare you that I did not come again to Corinth.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "It is not that we lord it over your faith; rather, we are co-workers for your joy, for you stand firm by your own faith.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Encouragement\" (v. 3-7)**: The Greek *paraklesis* (and the verb *parakalein*) is often translated as \"comfort.\" However, in a first-century context, it carries the sense of \"strengthening\" or \"exhorting\"—it is the act of coming alongside someone to give them the courage to endure. \"Encouragement\" captures this better than \"comfort,\" which in modern English often implies mere emotional soothing.\n\n**\"Crushing mountain of trouble\" / \"Crushing pressure\" (v. 4, 8)**: The Greek *thlipsis* literally refers to pressure or squeezing. Paul uses it to describe external afflictions that feel physically or mentally weightier than one can bear. \n\n**\"Sentence of death\" (v. 9)**: *Apokrima* is a rare term, likely referring to an official judicial verdict or a formal response to an inquiry. Paul felt as though the \"verdict\" on his life had already been handed down by his circumstances.\n\n**\"Transparency\" (v. 12)**: *Eilikrineia* refers to something judged by the sunlight (pure, sincere). It suggests a life with nothing to hide, contrasting with the \"human cleverness\" (*sophia sarkike*—literally \"fleshly wisdom\") of which Paul’s opponents likely accused him.\n\n**\"Fickleness\" (v. 17)**: *Elaphria* literally means \"lightness.\" In this context, it refers to a lack of character or gravity—changing one's mind based on whim or convenience.\n\n**\"Amen\" (v. 20)**: This is a transliteration of the Hebrew *’āmēn*, meaning \"certainty\" or \"truth.\" Paul highlights that while Christ is God’s \"Yes\" to humanity, the \"Amen\" is the assembly's vocalized affirmation of that truth back to God.\n\n**\"Down payment\" (v. 22)**: *Arrabon* is a commercial term from the Phoenician/Semitic world (related to the Hebrew *‘erābôn*) referring to a deposit or \"earnest money\" given to ratify a contract. It is a portion of the total purchase price, functioning as a legal guarantee that the full amount will be paid.\n\n**\"To spare you\" (v. 23)**: Paul is defending his change of travel plans. In the honor-shame culture of the first century, a visit from an apostle to correct a community could be a severe and \"shaming\" event. Paul claims his absence was an act of mercy, not a lack of integrity."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "For I made up my mind on this: that I would not come to you in a way that causes pain again.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For if I cause you pain, who is there to make me glad except the very person I have made sad?",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And I wrote this very thing so that when I arrived, I would not be distressed by those who ought to be the source of my joy. I have this confidence in all of you: that my joy is the joy of you all.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For I wrote to you out of great affliction and an aching heart, with many tears—not to cause you pain, but so that you would realize the overflowing love I have for you.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Now, if someone has caused pain, he has not pained me alone, but to some extent—not to be too harsh—he has pained all of you.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "For such a person, the censure imposed by the majority is sufficient.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "So now, you should instead forgive and comfort him, so that he is not overwhelmed and consumed by excessive sorrow.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Therefore, I urge you to formally reaffirm your love for him.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For this was my purpose in writing: to see if you would pass the test—whether you are obedient in every respect.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Anyone you forgive, I forgive as well. Indeed, what I have forgiven—if there was anything to forgive—I did for your sake in the presence of Christ,",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "so that we might not be outwitted by Satan; for we are not ignorant of his schemes.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "When I arrived in Troas to proclaim the Good News of the Christ, even though a door for effective work had been opened for me by the Lord,",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "I had no peace of mind because I did not find my brother Titus there. So, I said goodbye to them and left for Macedonia.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "But thanks be to God, who always leads us like captives in Christ’s triumphal procession and uses us to spread the fragrance of the knowledge of him in every place.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "For we are the sweet aroma of Christ offered to God, perceived both among those who are being saved and among those who are perishing.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "To the latter, we are the scent of death leading to death, but to the former, the fragrance of life leading to life. And who is qualified for such a task?",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For we are not like the many who hawk the word of God for profit. Instead, we speak with sincerity as those sent from God, standing in the presence of God, in union with Christ.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"In the presence of Christ\" (v. 10)**: The Greek *en prosōpō Christou* literally means \"in the face\" or \"in the person\" of Christ. In a first-century context, this suggests acting under the direct gaze of Christ or as his representative. It carries more weight than simply \"in the name of Christ,\" implying a transparency of character before the Lord.\n\n**\"Outwitted\" (v. 11)**: The verb *pleonekteō* means to take advantage of, defraud, or outmaneuver someone to gain more for oneself. The translation \"outwitted\" captures the context of Satan using the community’s lack of forgiveness as a tactical advantage to cause division.\n\n**\"Peace of mind\" (v. 13)**: The Greek *anesin tō pneumati mou* literally means \"relief/rest for my spirit.\" This is not merely intellectual worry but a profound internal restlessness or lack of ease.\n\n**\"Triumphal procession\" (v. 14)**: The verb *thriambeuō* refers to the Roman *triumphus*, a grand parade where a victorious general led his soldiers and his conquered captives through the streets. Paul portrays God as the victorious general and himself as a captive led in Christ’s train. While some translations suggest \"leading us in triumph\" (meaning we share the victory), the cultural image is more likely that of being \"led as captives\" in God's victory.\n\n**\"Fragrance / Sweet aroma\" (vv. 14-15)**: Paul uses two different words, *osmē* (scent/smell) and *euōdia* (a sweet-smelling fragrance). In the Septuagint (LXX), *euōdia* is technical language for the \"soothing aroma\" of a sacrifice acceptable to God. Paul is framing his apostolic ministry as a sacrificial offering.\n\n**\"Hawk... for profit\" (v. 17)**: The Greek *kapēleuontes* refers to a *kapēlos*, a street-peddler or huckster known for adulterating their goods (like watering down wine) to increase profit. Paul is contrasting his sincere ministry with those who treat the gospel as a cheap commodity to be manipulated for personal gain."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "Are we beginning to recommend ourselves all over again? Or do we, like some people, need letters of recommendation to you, or perhaps from you?",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "You yourselves are our letter, written on our hearts, known and read by everyone.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "It is plain to see that you are a letter from Christ, delivered through our ministry, written not with ink but with the Spirit of the living God—not on tablets of stone, but on tablets of human hearts.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "This is the kind of confidence we have through Christ toward God.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "It is not that we are competent in ourselves to claim anything as coming from us; rather, our competence comes from God.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "He is the one who made us competent as ministers of a new covenant—not of a written code, but of the Spirit. For the written code kills, but the Spirit gives life.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Now if the ministry of death, which was carved in letters on stone, came with such glory that the people of Israel could not gaze at Moses’s face because of its glory (even though it was a fading glory),",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "will not the ministry of the Spirit be even more glorious?",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For if the ministry that brought condemnation had glory, the ministry that brings righteousness overflows with glory all the more!",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "In fact, what once had glory now has no glory at all in comparison to this surpassing glory.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For if what was being phased out came through glory, how much more does that which remains exist in glory!",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Therefore, since we have such a hope, we act with great openness and boldness.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "We are not like Moses, who would put a veil over his face to keep the people of Israel from gazing at the end of what was fading away.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "But their minds were calloused. For to this very day, the same veil remains whenever the old covenant is read; it is not lifted, because only in Christ is it done away with.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Yes, to this day, whenever Moses is read, a veil lies over their hearts.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But whenever someone turns to the Lord, the veil is taken away.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Now the Lord is the Spirit, and where the Spirit of the Lord is, there is freedom.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And all of us, with unveiled faces, reflecting the glory of the Lord as in a mirror, are being transformed into that same image from one degree of glory to another, just as from the Lord, who is the Spirit.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Recommend\" (v. 1)**: The Greek *synistanai* refers to the formal practice of personal commendation or introduction. In the ancient Mediterranean, \"letters of recommendation\" (*systatikon epistolon*) were essential for travelers to establish trust in new communities.\n\n**\"Tablets of human hearts\" (v. 3)**: The Greek *kardiais sarkinais* literally means \"hearts of flesh.\" However, in modern English, \"fleshly\" often connotes \"carnal\" or \"sinful.\" In this context, Paul is contrasting the hardness of \"stone\" (*lithinais*) with the living, responsive nature of a \"human\" heart, echoing the promise of Ezekiel 36:26.\n\n**\"Competence\" (v. 5-6)**: The words *hikanoi* and *hikanotes* are often translated as \"sufficient\" or \"sufficiency,\" but in this context of ministry and credentials, they refer to being \"qualified,\" \"capable,\" or \"competent\" to perform a task.\n\n**\"Written code\" (v. 6)**: The Greek *gramma* (letter) refers specifically to the Law as a written transcript or external regulation. It contrasts with the *pneuma* (Spirit) which operates internally.\n\n**\"Fading\" / \"Phased out\" (v. 7, 11, 13, 14)**: The verb *katargeō* is central to this passage. It means to render ineffective, nullify, or abolish. When applied to the \"glory\" on Moses’s face (v. 7), it implies a glory that was temporary or \"fading.\" When applied to the covenant/system (v. 11, 14), it implies something being \"phased out\" or \"rendered obsolete\" by the new.\n\n**\"Righteousness\" (v. 9)**: *Dikaiosynē* here refers to the state of being set right with God. The \"ministry of condemnation\" (the Law) is contrasted with the \"ministry of righteousness\" (the Gospel).\n\n**\"Openness and boldness\" (v. 12)**: *Parrhesia* refers to \"boldness of speech\" or \"plainness.\" It was a prized virtue in Greek civic life—the right to speak everything freely and clearly. Paul contrasts this with Moses’s \"veil,\" which obscured the truth.\n\n**\"Calloused\" (v. 14)**: *Epōrōthē* refers to the hardening of skin (like a callus) or the petrification of a substance. In a psychological sense, it refers to a mind that has become dull, insensitive, or closed off.\n\n**\"Reflecting... as in a mirror\" (v. 18)**: The verb *katoptrizomenoi* is a *hapax legomenon* (a word used only once) in the New Testament. It can mean \"beholding in a mirror\" or \"reflecting like a mirror.\" Given the context of the \"glory\" being seen on the \"unveiled face,\" it likely encompasses both: by looking at the Lord’s glory, we become mirrors that reflect it."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, since we have this ministry through the mercy shown to us, we do not lose heart.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Instead, we have renounced the shameful things people hide; we do not conduct ourselves with trickery or distort the word of God. Rather, by making the truth plain, we commend ourselves to every person’s conscience in the presence of God.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And even if our gospel remains veiled, it is veiled only among those who are perishing.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "In their case, the god of this current age has blinded the minds of those who do not believe, so they cannot see the light of the gospel of the glory of Christ, who is the very image of God.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For we are not proclaiming ourselves, but Christ Jesus as Lord, and ourselves as your slaves for the sake of Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Because the God who said, “Let light shine out of darkness,” is the one who has shone in our hearts to bring to light the knowledge of God’s glory in the face of Christ.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "But we have this treasure in common clay jars, so that the extraordinary power may be seen to belong to God and not to us.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "We are squeezed from every side but not crushed; perplexed but not driven to despair;",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "hunted down but not abandoned; struck down but not destroyed.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "We always carry the dying of Jesus in our body, so that the life of Jesus may also be made visible in our body.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For we who are alive are always being handed over to death for Jesus’s sake, so that the life of Jesus may be made visible in our mortal flesh.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "So then, death is at work in us, but life is at work in you.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And since we have the same spirit of faith—according to what is written: *I believed, therefore I spoke*—we also believe, and therefore we speak.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "We know that the one who raised the Lord Jesus will also raise us with Jesus and bring us into his presence along with you.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For all these things are for your sake, so that as grace spreads through more and more people, it may cause thanksgiving to overflow to the glory of God.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Therefore we do not lose heart. Even if our outer self is wasting away, our inner self is being renewed day by day.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "For this momentary, light burden of suffering is producing for us an eternal weight of glory that is beyond all comparison.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "We do not focus our attention on what is seen, but on what is unseen; for what is seen is temporary, but what is unseen is eternal.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Lose heart\" (v. 1, 16)**: The Greek *egkakoumen* carries the sense of flagging, behaving like a coward, or giving up under the pressure of exhaustion. It describes the internal collapse that often follows external opposition.\n\n**\"Distort\" (v. 2)**: The verb *dolountes* was used of wine merchants who \"watered down\" or adulterated their product to increase profit. It implies a deceptive manipulation of the message to make it more palatable or profitable.\n\n**\"God of this current age\" (v. 4)**: This refers to the spiritual power (Satan) dominating the current world-system. The term *aiōn* (age) emphasizes the temporal, passing nature of this power compared to the \"eternal\" reality mentioned in verse 18.\n\n**\"Slaves\" (v. 5)**: The Greek *doulos* is frequently softened to \"servant,\" but in the Roman world, it denoted total ownership and lack of personal autonomy. Paul uses this to emphasize that he has no personal agenda; he is entirely at the disposal of Christ and, by extension, the church.\n\n**\"Clay jars\" (v. 7)**: *Ostrakinois skeuesin* refers to cheap, breakable earthenware. In antiquity, these were used for lamps, storage, and even trash. Paul uses the metaphor to contrast the immense value of the Gospel \"treasure\" with the frailty and commonness of the human messengers.\n\n**\"Dying\" (v. 10)**: The word *nekrōsis* is not the common word for \"death\" (*thanatos*), but refers to the state of being put to death or the process of dying. It captures the ongoing, daily physical toll of Paul’s ministry.\n\n**\"Weight of glory\" (v. 17)**: This is a profound Hebraic allusion. The Hebrew word for glory (*kabod*) is derived from a root meaning \"heavy\" or \"weighty.\" To a Jewish thinker like Paul, glory is not a \"bright light\" so much as it is \"substance\" or \"significance.\" He contrasts the \"lightness\" of his current suffering with the \"massive weight\" of future glory.\n\n**\"Beyond all comparison\" (v. 17)**: The Greek *kath’ hyperbolēn eis hyperbolēn* is an idiomatic superlative, literally \"from excess to excess.\" It describes something that exhausts the capacity of language to describe it.\n\n**\"Temporary\" (v. 18)**: *Proskaira* literally means \"for a season.\" It suggests that visible things are not just short-lived, but are tied to a specific, passing moment in time."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "For we know that if the tent that serves as our earthly house is torn down, we have a permanent building from God, a house not made by human hands, eternal in the heavens.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For indeed, in this current tent we groan, longing to be further clothed with our dwelling that comes from heaven,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "since, having put it on, we will not be found naked.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For we who are in this tent groan under a heavy burden; it is not that we want to be stripped of our clothing, but rather to be clothed over, so that what is mortal may be swallowed up by life.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Now the one who has prepared us for this very purpose is God, who gave us the Spirit as a down payment.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Therefore, we are always confident. We know that while we are at home in the body, we are away from our home with the Lord—",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "for we walk by faith, not by what is seen—",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "but we are confident and would actually prefer to be away from the home of the body and to be at home with the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For this reason, we make it our ambition, whether at home or away, to be well-pleasing to him.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For we must all be laid bare before the judgment tribunal of Christ, so that each person may receive what is due for the things done through the body, whether good or worthless.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Therefore, because we know what it means to stand in awe of the Lord, we try to persuade people. What we truly are is already plain to God, and I hope it is also plain to your consciences.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "We are not commending ourselves to you again, but are giving you an opportunity to take pride in us, so that you may have an answer for those who take pride in outward appearances and not in what is in the heart.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For if we were \"out of our minds,\" it was for God; if we are of sound mind, it is for you.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For the love of Christ grips us, because we have concluded this: that one died for all, therefore all died.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And he died for all so that those who live should no longer live for themselves, but for him who died and was raised for their sake.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "So then, from now on, we recognize no one from a human perspective. Even if we once regarded Christ from a human perspective, we no longer know him that way.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "Therefore, if anyone is in Christ—new creation! The old things have passed away; look, new things have come into being.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "All this is from God, who reconciled us to himself through Christ and gave us the ministry of reconciliation:",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "that is, in Christ, God was reconciling the world to himself, not counting their trespasses against them, and he has committed to us the message of reconciliation.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Therefore, we are acting as ambassadors on behalf of Christ, as though God were making his appeal through us. We implore you on behalf of Christ: be reconciled to God.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "The one who did not know sin, God made to be sin for our sake, so that in him we might become the righteousness of God.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The tent that serves as our earthly house\" (v. 1)**: The Greek *tou skēnous* (the tent) is in apposition to \"earthly house.\" Paul uses the imagery of a temporary, nomadic tent (evoking the Tabernacle) to contrast with the *oikodomē* (a permanent, solid building) of the resurrection body.\n\n**\"Clothed over\" (vv. 2, 4)**: The verb *ependysasthai* literally means \"to put on over.\" Paul is not looking for a disembodied existence (which he calls \"nakedness\" in v. 3, a state feared in the Hellenistic world), but rather for the mortal body to be transformed by being \"clothed over\" with the immortal, heavenly body.\n\n**\"Down payment\" (v. 5)**: The Greek *arrabōn* is a Semitic loanword (Hebrew: *eravon*) used in commercial transactions. It refers to a legal deposit or earnest money that ratifies a contract and guarantees the full payment to follow.\n\n**\"At home / Away from home\" (vv. 6-9)**: Paul uses a wordplay with *endēmeō* (to be among one's own people/home) and *ekdēmeō* (to be away from one's people/home). \"At home in the body\" implies a state of exile from the Lord's immediate presence.\n\n**\"Laed bare\" (v. 10)**: The Greek *phanerōthēnai* is often translated as \"appear,\" but it means to be \"made manifest\" or \"revealed for what one truly is.\" Before the *bēma* (the magistrate's tribunal), all pretenses are stripped away.\n\n**\"Worthless\" (v. 10)**: The SBLGNT uses *phaulon* rather than *kakon* (evil). *Phaulon* denotes something trivial, ordinary, or good-for-nothing—the lack of value rather than active malice.\n\n**\"Grips us\" (v. 14)**: The verb *synechei* means to hold together, hem in, or compel. It suggests that Christ's love leaves Paul no other choice; it constrains his options and directs his path.\n\n**\"From a human perspective\" (v. 16)**: The phrase *kata sarka* (according to the flesh) refers to a viewpoint limited by fallen human standards, social status, and external appearances, rather than a Spirit-led understanding.\n\n**\"New creation!\" (v. 17)**: The Greek *kainē ktisis* lacks a verb. While it can mean \"he is a new creature,\" it more likely refers to the dawning of the new messianic age. When one is in Christ, they have entered the \"new creation\" that has already begun to break into the old world.\n\n**\"Made to be sin\" (v. 21)**: This is a profound and difficult idiom. It does not mean Jesus became a sinner, but that he was completely identified with the human condition of sin (potentially alluding to the \"sin offering\" of the LXX, though the Greek simply says *hamartian*—sin). In this exchange, he takes the \"sin\" and gives the \"righteousness.\""
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "As those who work together with God, we also appeal to you: do not receive the grace of God in a way that yields no result.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For he says: \"At the favorable time I listened to you, and on the day of deliverance I came to your aid.\" Look! Now is the highly favorable time; look, now is the day of deliverance.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "We give no one any cause for stumbling in anything, so that our ministry may not be discredited.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Instead, we prove ourselves in every way as God’s servants: in great endurance, in pressures, in hardships, in crushing stresses;",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "in beatings, in imprisonments, in riots, in exhausting labors, in sleepless nights, in hunger;",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "in purity, in knowledge, in patience, in kindness, in a holy spirit, in sincere love;",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "in the word of truth, in the power of God; through the weapons of righteousness in the right hand and in the left;",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "through glory and dishonor, through slander and good report. We are treated as impostors, and yet we are true;",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "as unknown, and yet we are fully recognized; as dying, and yet—look!—we live; as disciplined, and yet not put to death;",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "as grieved, yet always rejoicing; as impoverished, yet enriching many; as having nothing, and yet possessing everything.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "We have spoken freely to you, Corinthians; our heart is opened wide.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "You are not being squeezed for space by us, but you are squeezed within your own deepest affections.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Now, to reciprocate in kind—I speak as to my children—you, too, must open your hearts wide.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Do not become mismatched under a different yoke with those who do not believe. For what partnership can there be between righteousness and lawlessness? Or what fellowship has light with darkness?",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "What harmony is there between Christ and Beliar? Or what does a believer share in common with an unbeliever?",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "What agreement can the temple of God have with idols? For we are the temple of the living God, just as God said: \"I will make my home among them and walk among them; I will be their God, and they will be my people.\"",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Therefore, \"Come out from among them and be set apart,\" says the Lord, \"and touch nothing unclean; then I will welcome you.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "\"And I will be a Father to you, and you will be sons and daughters to me,\" says the Lord Almighty.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Yields no result\" (v. 1)**: The Greek *eis kenon* is traditionally \"in vain.\" In the context of Paul’s agrarian and labor metaphors, it suggests a gift that fails to produce its intended fruit or purpose.\n\n**\"Deliverance\" (v. 2)**: The Greek *sōtēria* is often rendered \"salvation,\" but in the context of the Isaiah 49:8 quote and the immediate hardships Paul describes, it carries the concrete sense of rescue, safety, and deliverance from distress.\n\n**\"Crushing stresses\" (v. 4)**: The Greek *stenochōriais* literally means \"narrowness of place.\" It evokes the feeling of being trapped in a tight spot with no room to move. This creates a wordplay with verses 11-13, where Paul tells the Corinthians they are \"squeezed\" (*stenochōreisthe*) in their own hearts.\n\n**\"Exhausting labors... hunger\" (v. 5)**: *Kopois* refers to labor that produces weariness, and *nēsteiais* can refer to religious fasting, but in a list of involuntary hardships, it likely refers to the lack of food due to poverty or travel.\n\n**\"A holy spirit\" (v. 6)**: The Greek *pneumati hagiō* lacks the definite article. While it can refer to the Holy Spirit, in this list of virtues (purity, knowledge, patience), it may also refer to the \"holy spirit\" or \"holy disposition\" of the minister. The translation maintains this ambiguity.\n\n**\"Sincere love\" (v. 6)**: *Agapē anypokritō* is literally \"un-hypocritical love.\" Following the guideline for *hypokritai* as \"performers,\" this refers to love that is not a theatrical performance or an act.\n\n**\"Deepest affections\" (v. 12)**: The Greek *splangchnois* refers to the internal organs (heart, liver, lungs). In the ancient world, these were seen as the seat of deep emotion and compassion, similar to the modern English use of \"gut feeling\" or \"heart,\" but more visceral.\n\n**\"Mismatched under a different yoke\" (v. 14)**: *Heterozygon* refers to yoking together two different kinds of animals (e.g., an ox and a donkey), which was prohibited in the Torah (Deut 22:10). It suggests a fundamental incompatibility in the \"pull\" or direction of one's life.\n\n**\"Beliar\" (v. 15)**: This is a Greek transliteration of the Hebrew/Aramaic *Beli-ya'al* (\"worthless one\"). It was a common Dead Sea Scrolls and Second Temple period name for the personification of evil or the leader of the forces of darkness. Retaining the name preserves the specific cultural-religious landscape of the audience.\n\n**\"Lord Almighty\" (v. 18)**: The Greek *pantokratōr* is the Septuagint’s rendering of *Sabaoth* (Lord of Hosts). It emphasizes God’s absolute sovereignty over all powers and cosmic forces."
    },
    {
      "chapter": 7,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, since we have these promises, dear friends, let us cleanse ourselves from every defilement of body and spirit, bringing holiness to its full fruition in the fear of God.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Make room for us in your hearts! We have wronged no one, we have ruined no one, we have exploited no one.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "I do not say this to condemn you; for I have said before that you are in our hearts so deeply that we would die together or live together.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "I am speaking to you with great openness; I take great pride in you. I am filled with encouragement; I am overflowing with joy in the midst of all our affliction.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For even when we arrived in Macedonia, our physical bodies had no relief. Instead, we were hard-pressed at every turn—battles on the outside, fears on the inside.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "But God, who encourages the downcast, encouraged us by the arrival of Titus.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "and it was not only by his arrival, but also by the encouragement he received from you. He reported to us your deep longing, your mourning, and your fervent zeal for me, which made me rejoice all the more.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For even if I grieved you with my letter, I do not regret it—even if I did regret it then (for I see that that letter grieved you, though only for a while).",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Now I rejoice, not because you were pained, but because your pain led to a change of heart. You were grieved as God intended, so that you were not harmed by us in any way.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For the grief that is according to God’s will produces a change of heart that leads to salvation and leaves no regrets; but the grief of the world produces death.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Just look at what this very \"godly grief\" has produced in you: what earnestness, what a clearing of yourselves, what indignation, what alarm, what deep longing, what zeal, what a readiness to see justice done! In every way you have proven yourselves to be innocent in this matter.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "So, even though I wrote to you, it was not primarily for the sake of the one who did the wrong, nor for the sake of the one who was wronged, but so that your own devotion to us might be revealed to you in the sight of God.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Because of this, we have been encouraged. In addition to our own encouragement, we rejoiced even more at the joy of Titus, because his spirit has been set at ease by all of you.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For if I have boasted to him about you in any way, I was not put to shame; but just as everything we spoke to you was true, so our boasting to Titus has also proven to be the truth.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And his deepest affections flow even more strongly toward you as he remembers the obedience of you all—how you received him with such reverence and awe.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "I rejoice that I can have complete confidence in you.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Defilement of body and spirit\" (v. 1)**: The Greek *molysmos* refers to ritual or moral pollution. Paul uses \"flesh and spirit\" (*sarkos kai pneumatos*) to encompass the whole person. \"Body\" is used here for *sarx* because the context is about physical/ritual purity rather than the theological \"sinful nature.\"\n\n**\"Bringing holiness to its full fruition\" (v. 1)**: The verb *epiteleō* means to bring a process to its intended goal or completion. It suggests that holiness is an ongoing cultivation that Paul desires to see reach its peak.\n\n**\"Exploited\" (v. 2)**: The Greek *pleonekteō* means to take advantage of someone, often for financial gain or out of greed.\n\n**\"Change of heart\" (vv. 9–10)**: This translates *metanoia*, which is traditionally rendered \"repentance.\" While \"repentance\" is accurate, it has become a \"church word\" that often loses the Greek sense of a fundamental change in one's mind, perspective, and direction of life.\n\n**\"Leaves no regrets\" (v. 10)**: This translates *ametamēlēton*. There is a subtle wordplay in the Greek between *metanoia* (a change of mind/life) and *metamelomai* (to feel regret or remorse). Godly grief leads to a life-change (*metanoia*) that you will never regret (*ametamēlēton*).\n\n**\"Justice done\" (v. 11)**: The Greek *ekdikēsis* is often translated as \"vengeance\" or \"punishment,\" but in this context, it refers to the congregation's desire to see justice carried out regarding the \"offender\" mentioned in verse 12.\n\n**\"Deepest affections\" (v. 15)**: The Greek *splanchna* literally refers to the internal organs (bowels/intestines), which the ancients regarded as the seat of deep emotion. In English, the \"heart\" is the closest equivalent for this visceral level of feeling.\n\n**\"Reverence and awe\" (v. 15)**: The Greek idiom *phobos kai tromos* (\"fear and trembling\") denotes a state of high anxiety to do one's duty or a profound respect for a person of authority. It describes the seriousness and respect with which the Corinthians received Paul’s emissary."
    },
    {
      "chapter": 8,
      "verses": [
        {
          "verse": 1,
          "text": "Now we want you to know, brothers and sisters, about the grace of God that has been poured out among the churches of Macedonia.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Even while undergoing a severe trial of affliction, the abundance of their joy and their deepest poverty overflowed into a wealth of single-minded generosity.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "I can testify that they gave according to their means, and even beyond their means, of their own accord.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "With much urgent pleading, they begged us for the favor of participating in this service to the holy ones.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And they did more than we had hoped—they gave their own selves first to the Lord and then to us, through the will of God.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "This led us to encourage Titus that, just as he had already made a start, he should also complete this act of grace among you.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "But just as you excel in everything—in faith, in speech, in knowledge, in all earnestness, and in the love we have sparked in you—see that you also excel in this act of grace.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "I am not saying this as a command, but I am testing the genuineness of your love by comparison with the earnestness of others.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "For you know the grace of our Lord Jesus Christ: though he was rich, for your sake he became poor, so that through his poverty you might become rich.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "I am giving my best judgment in this matter, for this is to your advantage. A year ago, you were the first not only to begin the work but to have the desire to do it.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "So now, finish the work as well, so that your readiness to desire it may be matched by its completion, based on what you have.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For if the readiness is there, the gift is acceptable according to what one has, not according to what one does not have.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Our purpose is not that others should have relief while you are burdened, but that there should be equality.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "At the present time, your abundance serves their need, so that their abundance may also serve your need, resulting in equality.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "As it is written: *The one who gathered much had nothing extra, and the one who gathered little had no lack.*",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Thanks be to God, who put into the heart of Titus the same earnestness for you that I have.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "He not only welcomed our appeal, but being even more earnest himself, he is coming to you of his own accord.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "We are sending with him the brother whose praise in the gospel is known throughout all the churches.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Not only that, but he was also commissioned by the churches to be our traveling companion in this work of grace that we are administering, for the glory of the Lord himself and as a sign of our readiness.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "We are taking this precaution so that no one will find fault with us regarding this large sum we are administering;",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "for we intend to do what is right and honorable, not only in the sight of the Lord but also in the sight of people.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "We are also sending with them our brother whom we have often tested and found to be earnest in many matters, and who is now even more earnest because of his great confidence in you.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "As for Titus, he is my partner and co-worker for your benefit; as for our brothers, they are envoys of the churches, the glory of Christ.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Therefore, demonstrate the proof of your love and the reason for our boasting about you to these men, in the presence of the churches.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Single-minded generosity\" (v. 2)**: The Greek *haplotetos* literally refers to \"singleness\" or \"simplicity.\" In the context of giving, it suggests a heart that is not divided by ulterior motives or greed, resulting in \"sincerity\" or \"liberality.\" \"Single-minded generosity\" captures the intersection of the giver's internal disposition and their outward action.\n\n**\"Favor of participating\" (v. 4)**: The Greek uses two heavy terms: *charin* (grace/favor) and *koinonian* (fellowship/participation). The Macedonians did not see giving as a chore but begged for the \"favor\" of having a \"partnership\" in the relief effort.\n\n**\"Act of grace\" (v. 6, 7, 19)**: The word *charis* appears throughout this chapter with shifting nuances. While it often means \"undeserved favor\" (as in v. 9), Paul uses it here to describe the collection itself. It is a \"grace\" because it originates from God’s grace and is performed as an act of worship.\n\n**\"Became poor\" (v. 9)**: The verb *eptōcheusen* is related to *ptōchos*, which refers to the \"abject poor\" or \"beggar\" (in contrast to *penēs*, the working poor). Paul uses this to highlight the extreme nature of the Incarnation—Christ did not just become \"less rich,\" he entered a state of total dependency.\n\n**\"Equality\" (v. 13, 14)**: The Greek *isotēs* refers to fairness, equity, or balance. Paul is not advocating for a forced communalism, but a reciprocal system of support within the body of Christ where those with a temporary surplus sustain those with a temporary deficit.\n\n**\"Commissioned\" (v. 19)**: The Greek *cheirotonētheis* literally means \"to stretch out the hand,\" originally referring to voting in an assembly by a show of hands. It indicates that this brother was formally elected or appointed by the churches, not just selected by Paul, ensuring financial accountability.\n\n**\"Large sum\" (v. 20)**: The Greek *hadrotēti* refers to \"thickness,\" \"abundance,\" or \"ripeness.\" In this context, it specifically refers to a substantial amount of money.\n\n**\"Envoys\" (v. 23)**: While the Greek is *apostoloi*, it is used here in its functional sense of \"messengers\" or \"delegates\" sent by specific local churches for a specific task, rather than \"Apostles\" in the foundational, office-holding sense. \"Envoys\" prevents confusion for the modern reader."
    },
    {
      "chapter": 9,
      "verses": [
        {
          "verse": 1,
          "text": "Now, concerning the relief mission for God’s holy people, it is actually redundant for me to write to you.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For I am well aware of your eagerness, which I boast about to the Macedonians on your behalf—telling them that Achaia has been prepared since last year—and your zeal has stirred up the majority of them.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "But I have sent the brothers so that our boasting about you would not prove to be empty words in this specific matter, but so that you might be fully prepared, just as I said you would be.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Otherwise, if any Macedonians come with me and find you unprepared, we—not to mention you—would be put to shame for being so confident in this undertaking.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Therefore, I considered it necessary to urge the brothers to go on ahead to you and arrange in advance this \"blessing-gift\" you previously promised. I want it to be ready as a genuine expression of blessing, and not as something extorted from you.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Consider this: the one who sows sparingly will also reap sparingly, and the one who sows with a spirit of blessing will also reap with a spirit of blessing.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Each person should give just as they have pre-determined in their heart, not out of regret or from a sense of compulsion, for God loves a cheerful giver.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And God is able to make every kind of grace overflow to you, so that in every way, at all times, having everything you need to be self-reliant, you may overflow in every good work.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "As it is written: *He scattered widely; he gave to the poor; his righteousness endures forever.*",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Now, the one who supplies seed to the sower and bread for food will supply and multiply your seed and will increase the harvest of your righteousness.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "You will be enriched in every way for every kind of sincere generosity, which—through our agency—is producing thanksgiving to God.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For the ministry of this sacred service is not only fully supplying the needs of God’s holy people, but it is also overflowing through many thanksgivings to God.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Because of the proven character shown in this ministry, they will glorify God for the obedience that flows from your confession of the Good News of Christ, and for the sincerity of your partnership with them and with everyone.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And in their prayer for you, they will long for you because of the surpassing grace of God that rests upon you.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Thanks be to God for his indescribable gift!",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Relief mission\" (v. 1)**: The Greek *diakonia* (service/ministry) refers here specifically to the collection Paul was organizing for the impoverished believers in Jerusalem. \"Relief mission\" captures the practical, charitable nature of this service.\n\n**\"God’s holy people\" (v. 1, 12)**: *Hagioi* (traditionally \"saints\") refers to those set apart for God. In this context, it specifically refers to the Judean Christians.\n\n**\"Blessing-gift\" (v. 5)**: The Greek *eulogia* is usually translated as \"blessing.\" Here, it refers to the financial gift itself. Paul contrasts a gift given as a \"blessing\" (generous and willing) with *pleonexia* (greed/extortion).\n\n**\"Something extorted\" (v. 5)**: *Pleonexia* usually means \"greed\" or \"covetousness.\" In this context, it refers to a contribution given under pressure, as if the person collecting it were \"extorting\" it or the person giving it felt they were being taken advantage of.\n\n**\"With a spirit of blessing\" (v. 6)**: The phrase *ep’ eulogiais* is idiomatic. Rather than just \"generously,\" it suggests giving that is rooted in the \"blessings\" God has provided, intending to be a blessing in return.\n\n**\"Self-reliant\" (v. 8)**: The Greek *autarkeia* was a major virtue in Stoic philosophy, meaning \"self-sufficiency\" or \"contentment.\" Paul adopts the term but gives it a Theo-centric twist: the believer is \"self-sufficient\" only because God provides everything necessary.\n\n**\"Righteousness\" (v. 9, 10)**: *Dikaiosynē* here carries the nuance of the Hebrew *tsedaqah*, which links internal righteousness with external acts of charity and justice.\n\n**\"Sincere generosity\" (v. 11, 13)**: The Greek *haplotēs* literally means \"singleness\" or \"simplicity\" (an undivided heart). In the context of giving, it refers to a purity of motive that manifests as open-handed generosity.\n\n**\"Sacred service\" (v. 12)**: *Leitourgia* (liturgy) was used in Greek culture for a public service performed for the state by a wealthy citizen at their own expense. In the Septuagint and New Testament, it refers to priestly or religious service. Paul uses it here to frame the financial collection as a sacred, sacrificial act of worship.\n\n**\"Confession\" (v. 13)**: *Homologia* refers to a public declaration or \"agreement\" with the truths of the Gospel. Paul is noting that their financial generosity is the physical proof that they actually believe the message they claim to follow."
    },
    {
      "chapter": 10,
      "verses": [
        {
          "verse": 1,
          "text": "Now I, Paul, appeal to you personally by the gentle strength and gracious forbearance of Christ—I, who am \"humble\" when face-to-face with you, but \"bold\" toward you when away.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I beg of you that when I am present, I may not have to show the kind of bold confidence that I reckon I will dare to use against those who reckon us to be living by merely human standards.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For though we live in the human condition, we do not wage war by human standards.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "The weapons of our warfare are not merely human; they are powerful through God for the demolition of fortresses. We demolish sophisticated arguments",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "and every arrogant obstacle raised up against the knowledge of God, and we take every thought captive to lead it into the obedience of Christ.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "We are also standing ready to punish every act of disobedience, once your own obedience is complete.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "You look at things based on surface appearances. If anyone is confident in himself that he belongs to Christ, let him consider this again for himself: just as he belongs to Christ, so do we.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "For even if I boast somewhat excessively about our authority—which the Lord gave for building you up and not for tearing you down—I will not be put to shame.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "I say this so that I do not seem to be trying to terrify you through my letters.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For some say, \"His letters are weighty and forceful, but his physical presence is weak and his public speaking is contemptible.\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Let such a person consider this: what we are in the words of our letters while absent, we will be in action when present.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "We do not dare to classify or compare ourselves with some of those who recommend themselves. But when they measure themselves by one another and compare themselves with one another, they show no understanding.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "We, however, will not boast beyond our limits, but will stay within the limits of the sphere of influence that God assigned to us—a sphere that reaches as far as you.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For we are not overextending ourselves as if we had not reached you; we were the first to come all the way to you with the good news of the Christ.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "We do not boast beyond our limits in the labors of others, but we have the hope that as your faith increases, our influence among you will be greatly enlarged within our assigned sphere,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "so that we may preach the good news to the regions beyond you, without boasting about work already prepared in someone else’s sphere.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "\"Let the one who boasts, boast in the Lord.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For it is not the person who recommends himself who is approved, but the one whom the Lord recommends.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Gentle strength\" (v. 1)**: The Greek *prautēs* is often translated as \"meekness,\" but it refers to power under control—the composure of one who has the strength to act but chooses gentleness.\n\n**\"Gracious forbearance\" (v. 1)**: The Greek *epieikeia* describes a quality of justice that goes beyond the letter of the law to its spirit; it is the magnanimity of a ruler who is fair and kind rather than strictly legalistic.\n\n**\"Living by merely human standards\" (vv. 2–3)**: The Greek phrase *kata sarka* (\"according to the flesh\") refers to a life oriented toward worldly values, selfish impulses, and limited human perspectives. The translation uses \"human condition\" for *en sarki* (v. 3) to distinguish the physical reality of living in a body from the ethical/spiritual orientation of *kata sarka*.\n\n**\"Demolition of fortresses\" (v. 4)**: The word *kathairesis* (demolition/tearing down) is a military term. Paul intentionally contrasts this in verse 8 with the purpose of his authority: *oikodomē* (building up).\n\n**\"Sophisticated arguments\" (v. 5)**: *Logismoi* refers to reasonings, calculations, or mental schemes. In this context, it refers to the prideful intellectual constructs used by his opponents to undermine the gospel.\n\n**\"Surface appearances\" (v. 7)**: The phrase *ta kata prosōpon* literally means \"the things according to the face.\" Paul is critiquing his opponents' focus on outward credentials, rhetorical style, and physical presence.\n\n**\"Sphere of influence\" (vv. 13–16)**: The Greek *kanōn* refers to a measuring rod, a rule, or a defined geographical boundary. Paul is arguing that Corinth falls within the \"jurisdiction\" assigned to him by God because he was the first to evangelize there.\n\n**\"Approved\" (v. 18)**: The term *dokimos* refers to something that has been tested and found to be genuine, like refined metal or coinage that meets the legal standard."
    },
    {
      "chapter": 11,
      "verses": [
        {
          "verse": 1,
          "text": "I wish you would put up with a little nonsense from me. But of course, you are already doing that!",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I am jealous for you with a jealousy that comes from God, for I betrothed you to one husband—to present you as a pure virgin to Christ.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "But I am afraid that just as the serpent deceived Eve by his craftiness, your minds might somehow be corrupted from a sincere and pure devotion to Christ.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For if someone comes and preaches another Jesus than the one we preached, or if you receive a different spirit than the one you received, or a different gospel than the one you accepted, you put up with it beautifully.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "I consider myself not at all inferior to these \"super-apostles.\"",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Even if I am an amateur in public speaking, I am certainly not so in knowledge; in every way and in all circumstances, we have made this clear to you.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Or did I commit a sin by humbling myself so that you might be exalted, because I preached the gospel of God to you free of charge?",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "I plundered other churches by taking support from them to serve you.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And when I was present with you and ran out of resources, I was not a dead weight on anyone; for the brothers who came from Macedonia fully supplied my needs. I have kept myself from being a burden to you in any way, and I will continue to do so.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "As the truth of Christ is in me, this boast of mine will not be silenced in the regions of Achaia.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Why? Because I do not love you? God knows I do!",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And what I am doing I will continue to do, in order to cut the ground out from under those who want an opportunity to be regarded as our equals in the things they boast about.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "For such men are pseudo-apostles, deceitful workers, masquerading as apostles of Christ.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And no wonder, for even Satan masquerades as an angel of light.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "It is no great thing, then, if his ministers also masquerade as ministers of righteousness. Their end will correspond to their actions.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "I say again, let no one think I am a fool. But if you do, then at least receive me as a fool, so that I too may boast a little.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "What I am saying in this confident boasting, I am not saying according to the Lord’s way, but as if in a fit of nonsense.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Since many are boasting according to the flesh, I will boast too.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "For you gladly put up with fools, being so \"wise\" yourselves!",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "In fact, you put up with it if someone enslaves you, if someone devours you, if someone takes advantage of you, if someone puts on airs, if someone hits you in the face.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "To my shame I must say, we were too \"weak\" for that! But in whatever anyone else dares to boast—I am speaking in nonsense—I dare to boast as well.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Are they Hebrews? So am I. Are they Israelites? So am I. Are they descendants of Abraham? So am I.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Are they ministers of Christ? I am talking like a madman—I am more so: with far greater labors, far more imprisonments, countless beatings, and often near death.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Five times I received from the Jews the forty lashes minus one.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Three times I was beaten with rods, once I was stoned, three times I was shipwrecked, I have spent a night and a day adrift on the open sea.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "I have been on frequent journeys, in dangers from rivers, dangers from bandits, dangers from my own people, dangers from the Gentiles, dangers in the city, dangers in the wilderness, dangers at sea, and dangers among false brothers;",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "through toil and hardship, through many sleepless nights, through hunger and thirst, often without food, in cold and exposure.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Besides everything else, there is the daily onslaught of my concern for all the churches.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Who is weak, and I am not weak? Who is led into sin, and I do not burn with indignation?",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "If I must boast, I will boast of the things that show my weakness.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "The God and Father of the Lord Jesus, who is blessed forever, knows that I am not lying.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "In Damascus, the governor under King Aretas was guarding the city of the Damascenes in order to seize me,",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "but I was lowered in a wicker basket through a window in the wall and escaped his hands.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Nonsense\" (v. 1, 17, 21)**: The Greek *aphrosyne* is often translated as \"folly\" or \"foolishness.\" However, in this context of rhetorical sparring, Paul is mockingly adopting the persona of a \"fool\" who brags about himself—something considered social \"nonsense\" or a lack of sound judgment in the Greco-Roman world.\n\n**\"Super-apostles\" (v. 5)**: The term *hyperlian apostolōn* is Paul’s sarcastic coinage. It literally means \"the extra-very-much apostles.\" Using \"super-apostles\" captures the biting irony Paul intends for his rivals in Corinth.\n\n**\"Amateur\" (v. 6)**: The Greek *idiōtēs* refers to a person who lacks professional training or status. Paul is acknowledging that he does not have the polished, professional rhetorical training that the \"super-apostles\" used to impress the Corinthians.\n\n**\"Dead weight\" (v. 9)**: The verb *katenarkēsa* literally means \"to become numb\" or \"torpid,\" and idiomatically refers to being a burden or an idle weight on someone else.\n\n**\"According to the flesh\" (v. 18)**: *kata sarka* refers to boasting by worldly standards—lineage, credentials, and outward appearances—rather than spiritual reality.\n\n**\"Forty lashes minus one\" (v. 24)**: This refers to the Jewish judicial limit based on Deuteronomy 25:3. To ensure they did not accidentally exceed the law’s limit of forty, they stopped at thirty-nine.\n\n**\"Daily onslaught\" (v. 28)**: The Greek *epistasis* carries the sense of a pressure, a crowd, or an assault. Paul describes his care for the churches not as a quiet meditation, but as a daily, pressing burden.\n\n**\"Wicker basket\" (v. 33)**: A *sarganē* was a hamper or basket made of braided ropes or wicker. Paul ends his \"boast\" not with a victory, but with the indignity of being smuggled out of a city like cargo, highlighting his theme of \"boasting in weakness.\""
    },
    {
      "chapter": 12,
      "verses": [
        {
          "verse": 1,
          "text": "It is necessary to boast. While there is nothing to be gained by it, I will move on to visions and revelations from the Lord.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I know a man in Christ who, fourteen years ago—whether in the body I do not know, or outside the body I do not know, God knows—was snatched up to the third heaven.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And I know that this man—whether in the body or apart from the body I do not know, God knows—",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "was snatched up into Paradise and heard words that cannot be spoken, things that no human is permitted to utter.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "On behalf of such a man I will boast, but on my own behalf I will not boast, except in my weaknesses.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "For if I should ever desire to boast, I would not be a fool, because I would be speaking the truth. But I restrain myself, so that no one might credit me with more than what they see in me or hear from me,",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "even considering the extraordinary nature of these revelations. Therefore, to keep me from becoming arrogant, a sharp stake was driven into my flesh—a messenger of Satan to beat me down—to keep me from becoming arrogant.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Three times I pleaded with the Lord about this, that it might leave me.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "But he has said to me, “My grace is enough for you, for my power is brought to its full expression in weakness.” Most gladly, therefore, I will boast all the more in my weaknesses, so that the power of the Christ might spread its tent over me.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For this reason, I am well-content with weaknesses, with insults, with catastrophes, with persecutions and crushing difficulties for the sake of Christ. For when I am weak, then I am powerful.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "I have become a fool! You forced me to it. For I ought to have been commended by you, since I am in no way inferior to those “extra-special apostles,” even if I am nothing.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "The signs of a true apostle were certainly performed among you with ultimate endurance—by signs, wonders, and acts of power.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For in what way were you treated as less than the rest of the churches, except that I myself never sponged off you? Forgive me for this \"injustice\"!",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Look, for this third time I am ready to come to you, and I still will not be a dead weight on you. For I do not seek what is yours, but you. Children, after all, are not expected to pile up a fortune for their parents, but parents for their children.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "I will most gladly spend everything I have and be utterly spent for the sake of your souls. If I love you more abundantly, am I to be loved the less?",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But be that as it may, I did not personally weigh you down. Yet, because I am \"crafty,\" you say I \"trapped you by trickery.\"",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Did I take advantage of you through any of those I sent to you?",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "I urged Titus to go and sent our brother with him. Titus didn't take advantage of you, did he? Did we not walk in the same spirit? Did we not take the same steps?",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Have you been thinking all this time that we are merely defending ourselves to you? It is before God, in Christ, that we are speaking. Everything we do, dear friends, is for your spiritual upbuilding.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "For I am afraid that perhaps when I come I may find you not as I wish, and that I may be found by you not as you wish—that perhaps there will be quarreling, jealousy, outbursts of anger, selfish factions, slanders, whispers of gossip, arrogance, and disorder.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "I am afraid that when I come again my God might humble me in your presence, and I will have to mourn over many of those who previously lived in sin and have not repented of the ritual impurity, sexual immorality, and unbridled lust they have practiced.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Third heaven\" (v. 2)**: In the cosmology of the first century, the \"third heaven\" refers to the highest realm, the immediate presence of God, beyond the immediate atmosphere (first heaven) and the stars (second heaven).\n\n**\"Sharp stake\" (v. 7)**: The Greek *skolops* can mean a splinter or a thorn, but in ancient literature, it often refers to a stake used for impaling or a jagged piece of wood. \"Stake\" captures the agonizing and debilitating nature of the affliction better than the traditional \"thorn,\" especially given the context of being \"beaten down.\"\n\n**\"Beat me down\" (v. 7)**: The verb *kolaphizō* means to strike with the fist or to buffet. It suggests a repetitive, humiliating physical violence.\n\n**\"Spread its tent over me\" (v. 9)**: The Greek *episkēnōō* literally means to pitch a tent or tabernacle over someone. This is a rich allusion to the *Shekhinah* glory of God dwelling in the Tabernacle in the Hebrew Scriptures. It implies that Christ's power provides a protective, divine presence in the midst of Paul's vulnerability.\n\n**\"Extra-special apostles\" (v. 11)**: Paul uses the term *hyperlian apostolōn* (\"super-beyond apostles\") sarcastically to refer to his opponents in Corinth who boasted of their superior credentials and rhetorical polish.\n\n**\"Sponged off / Dead weight\" (v. 13, 14)**: The verb *katenarkēsa* is a rare term derived from the *narkē* (the torpedo fish that numbs its prey). It means to be a financial burden or to live at someone else's expense, effectively \"numbing\" their resources.\n\n**\"Selfish factions\" (v. 20)**: The Greek *eritheiai* refers to a self-seeking ambition or a \"party spirit.\" It describes the maneuvering for position and the creation of cliques within a community.\n\n**\"Unbridled lust\" (v. 21)**: The term *aselgeia* denotes a lack of self-constraint or a flagrant disregard for social and moral boundaries. It is more than just \"sensuality\"; it implies an insolent indulgence in one's own desires."
    },
    {
      "chapter": 13,
      "verses": [
        {
          "verse": 1,
          "text": "This is the third time I am coming to you. As the Scripture says, “Every legal matter must be established by the testimony of two or three witnesses.”",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I have already warned those who previously sinned and all the rest, and I am warning you again now—just as I did when I was present during my second visit, though I am currently absent: if I come again, I will not be lenient.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "You are demanding evidence that Christ is truly speaking through me. He is not weak in his dealings with you, but is powerful among you.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "For even though he was crucified out of human weakness, he lives by the power of God. In the same way, we are weak in him, but for your sake, we will live with him by the power of God.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Put yourselves to the test to see if you are in the faith; examine yourselves. Or do you not recognize this about yourselves—that Jesus Christ is in you? Unless, of course, you fail the test.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "But I hope you will realize that we have not failed the test.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "We pray to God that you do nothing wrong—not so that we may appear to have passed the test, but so that you may do what is right, even if we appear to have failed.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For we have no power to act against the truth, but only for the sake of the truth.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "We actually rejoice when we are weak and you are strong; this is exactly what we pray for: your complete restoration.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "This is why I am writing these things while I am away, so that when I arrive I may not have to deal with you harshly. I want to use the authority the Lord gave me for building you up, not for tearing you down.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Finally, brothers and sisters, rejoice. Be restored, be encouraged, think in harmony, live in peace; and the God of love and peace will be with you.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "Greet one another with a holy kiss. All of God's people here greet you.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "The grace of the Lord Jesus Christ, the love of God, and the shared life of the Holy Spirit be with you all.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Every legal matter must be established\" (v. 1)**: Paul quotes Deuteronomy 19:15 from the Septuagint. The Greek *rhēma* (literally \"word\" or \"thing\") in this legal context refers to a \"charge\" or \"case.\" Paul is signaling that his third visit will involve a formal judicial procedure regarding the conduct of the community.\n\n**\"Human weakness\" (v. 4)**: The Greek *astheneia* refers to the limitations, fragility, and vulnerability of the human condition. In Paul’s theology here, Christ’s crucifixion was the ultimate expression of entering into human vulnerability, which is then vindicated by divine power (*dynamis*).\n\n**\"Test... Examine... Failed the test\" (v. 5-7)**: There is a sustained wordplay on the root *dokim-*. The Corinthians want \"proof\" (*dokimēn*, v. 3) of Paul’s authority. Paul retorts that they should \"examine\" (*dokimazete*) themselves. If they find Christ in themselves, it proves Paul’s ministry is valid, because he brought the gospel to them. The term *adokimoi* (v. 5, 6, 7), often translated as \"reprobate\" or \"disqualified,\" refers specifically to someone who fails this examination or is found to be counterfeit.\n\n**\"Restoration\" (v. 9, 11)**: The Greek *katartisis* (noun) and *katartizesthe* (verb) refer to the act of mending, repairing, or bringing something into its proper alignment. It was used for mending fishing nets or setting broken bones. Paul’s goal is not to punish, but to bring the fractured Corinthian church back into a state of structural and spiritual integrity.\n\n**\"Shared life\" (v. 13)**: The Greek *koinōnia* is often translated as \"fellowship,\" but in this benediction, it carries the weight of a \"common participation in\" or \"partnership.\" It refers to the collective experience and vital connection that the Holy Spirit creates among believers.\n\n**\"God's people\" (v. 12)**: The Greek *hagioi* (literally \"holy ones\" or \"saints\") refers to the community set apart for God. In modern English, \"saints\" often implies an elite class of exceptionally pious people, whereas Paul uses it to refer to the entire local body of believers."
    }
  ]
}