{
  "book": "2John",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "The Elder, to the chosen lady and her children, whom I love in the Truth—and not I alone, but also all those who have come to know and experience the Truth—",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "because of the Truth that remains within us and will be with us into the age to come.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Grace, mercy, and peace will be with us from God the Father and from Jesus Christ, the Father’s Son, in the sphere of truth and love.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "I was overjoyed to find some of your children conducting their lives according to the Truth, just as we were commanded by the Father.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "And now I ask you, lady—not as though I were writing a new kind of regulation to you, but the one we have had from the beginning—that we should love one another.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And this is what love is: that we direct our lives according to his instructions. This is the instruction, just as you heard from the beginning, so that you might conduct your lives within it.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "I say this because many impostors have gone out into the world, people who do not acknowledge the reality of Jesus Christ coming in human flesh. Such a person is the deceiver and the antichrist.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Watch yourselves, so that you do not destroy what we have worked to achieve, but instead may receive your wages in full.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Anyone who pushes on ahead and does not remain within the teaching of the Christ does not have God; the one who remains within this teaching has both the Father and the Son.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "If anyone comes to you and does not bring this teaching, do not receive him into your home and do not even give him a greeting.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For the one who gives him a greeting shares in his wicked work.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Although I have much to write to you, I do not want to do so with paper and ink. Instead, I hope to be with you and to speak face to face, so that our joy may be filled to the brim.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "The children of your chosen sister send you their greetings.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The Elder\" (v. 1)**: The Greek *ho presbyteros* denotes a position of seniority and official oversight. While it can mean \"old man,\" in the context of the Johannine community, it functions as a specific title of authority.\n\n**\"The chosen lady\" (v. 1)**: While *eklektē kyria* could theoretically be a proper name (Lady Electa or the Lady Kyria), it is almost certainly a personification of a local church. This fits the metaphor of \"children\" (members) and the \"chosen sister\" (v. 13, a sister church).\n\n**\"In the Truth\" (v. 1, 2, 3, 4)**: The Greek *alētheia* in Johannine literature is not merely the absence of falsehood; it is a divine reality, often associated with the Logos or the Spirit. Capitalizing \"the Truth\" helps the modern reader see it as a technical term for the Gospel or Christ himself.\n\n**\"Conducting their lives\" (v. 4, 6)**: The Greek *peripateō* literally means \"to walk.\" In Jewish and early Christian idiom (reflecting the Hebrew *halakhah*), it refers to one's entire manner of life, conduct, and moral path.\n\n**\"Coming in human flesh\" (v. 7)**: The present participle *erchomenon* (\"coming\") emphasizes the ongoing reality or the essential characteristic of the incarnation, specifically countering early Gnostic or Docetic claims that Jesus only *seemed* to be physical or that the \"Christ-spirit\" left the man Jesus before the crucifixion.\n\n**\"Pushes on ahead\" (v. 9)**: The Greek *proagōn* carries the sense of \"going beyond the limits\" or \"advancing.\" It likely targets \"progressive\" teachers who claimed to have moved beyond the basic apostolic teaching into higher \"mysteries.\" This translation captures the arrogance of leaving the foundation behind.\n\n**\"Receive your wages in full\" (v. 8)**: The term *misthos* refers to pay or a reward for labor. The verb *apolabēte* (\"receive in full\") mirrors the commercial language found in the Gospels (cf. Matthew 6:2), suggesting the completion of a transaction.\n\n**\"Greeting\" (v. 10, 11)**: The Greek *chairein* was the standard opening for a letter or a verbal \"hello.\" In this context, offering a greeting was not a mere social nicety but an act of hospitality that signaled religious fellowship and endorsement of the teacher's message.\n\n**\"Face to face\" (v. 12)**: The Greek is literally \"mouth to mouth\" (*stoma pros stoma*), a Hebraic idiom (cf. Numbers 12:8) denoting intimate, direct communication without intermediaries. \"Face to face\" is the functional English equivalent."
    }
  ]
}