{
  "book": "2Peter",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Symeon Peter, a slave and emissary of Jesus Christ, to those who have been assigned a faith of equal standing to ours through the justice of our God and Savior, Jesus Christ.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "May grace and peace be multiplied to you in the experiential knowledge of God and of Jesus our Lord.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For his divine power has gifted us with everything required for life and reverence, through the experiential knowledge of the one who called us by his own glory and excellence.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Through these he has gifted us with his precious and superlative promises, so that through them you might become sharers in the divine nature, having escaped the corruption that is in the world caused by disordered desire.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For this very reason, apply every ounce of diligence to supplement your faith with moral excellence, and moral excellence with knowledge,",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "and knowledge with self-mastery, and self-mastery with patient endurance, and patient endurance with reverence,",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "and reverence with brotherly affection, and brotherly affection with selfless love.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For if these qualities belong to you and are increasing, they ensure you are neither useless nor unfruitful in your experiential knowledge of our Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "But the one who lacks these is blind, being so short-sighted that they have forgotten the purification of their former sins.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Therefore, brothers and sisters, be all the more diligent to make your calling and election secure; for by doing these things, you will never stumble.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "For in this way, the entrance into the eternal kingdom of our Lord and Savior Jesus Christ will be richly supplied to you.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Therefore, I intend to keep reminding you of these things, even though you know them and are firmly established in the truth that is present with you.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "I consider it right, as long as I am in this temporary tent, to keep you alert by way of a reminder,",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "since I know that the laying aside of my tent is coming soon, just as our Lord Jesus Christ made clear to me.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And I will be diligent to see that at every opportunity after my departure, you are able to recall these things.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For we did not follow cleverly engineered fables when we made known to you the power and coming of our Lord Jesus Christ, but we were eyewitnesses of his majesty.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "For he received honor and glory from God the Father when a voice was brought to him by the Majestic Glory, saying: \"This is my Son, my Beloved, in whom I am well-pleased.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "We ourselves heard this voice brought from heaven when we were with him on the holy mountain.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And so we have the prophetic word made more secure. You do well to pay attention to it as to a lamp shining in a squalid place, until the day dawns and the morning star rises in your hearts.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Know this above all: no prophecy of Scripture comes from one’s own interpretation,",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "for no prophecy was ever produced by human will, but people spoke from God as they were carried along by the Holy Spirit.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Symeon\" (v. 1)**: The Greek uses the more Hebraic form *Symeon* (Συμεὼν) rather than the more common Greek *Simon*. This reflects the author's Jewish heritage and perhaps the Aramaic *Shimon*.\n\n**\"Equal standing\" (v. 1)**: The Greek *isotimes* (ἰσότιμον) literally means \"equal in honor\" or \"equal in price/value.\" It suggests that the faith received by the Gentile or later-generation audience is just as precious and valid as that of the original apostles.\n\n**\"God and Savior\" (v. 1)**: Following the Granville Sharp rule of Greek grammar, the single article governing both \"God\" and \"Savior\" indicates that both titles refer to one person: Jesus Christ.\n\n**\"Experiential knowledge\" (v. 2, 3, 8)**: The word *epignōsis* (ἐπίγνωσις) implies a more intensive, relational, or experiential knowledge than the simple *gnōsis*. It is a key theme in 2 Peter, likely used to counter \"knowledge\" (Gnosticism) that was merely intellectual or speculative.\n\n**\"Reverence\" (v. 3, 6, 7)**: *Eusebeia* (εὐσέβειαν) is often translated as \"godliness,\" but in the first century, it referred to the proper conduct and respect one owes to God—piety in action.\n\n**\"Sharers in the divine nature\" (v. 4)**: This phrase (*theias koinōnoi physeōs*) uses the language of contemporary Hellenistic philosophy to describe the goal of the Christian life. It does not mean becoming a god, but participating in the life and character of God (theosis).\n\n**\"Disordered desire\" (v. 4)**: *Epithymia* (ἐπιθυμίᾳ) is often \"lust,\" but it refers more broadly to any intense craving or desire that is directed away from God and toward the self.\n\n**\"Supplement\" (v. 5)**: The verb *epikhorēgēsan* (ἐπιχορηγήσατε) originally referred to a *khorēgos*, a wealthy patron who would pay the expenses for a chorus in a Greek drama. It implies a lavish, generous provision.\n\n**\"Self-mastery\" (v. 6)**: *Egkrateia* (ἐγκράτειαν) refers to the internal control of one's impulses and passions.\n\n**\"Tent\" (v. 13-14)**: *Skēnōma* (σκηνώματι) refers to a temporary dwelling or tabernacle. Peter uses it as a metaphor for the physical body, emphasizing the transience of earthly life.\n\n**\"Departure\" (v. 15)**: The Greek word is *exodos* (ἔξοδον), a clear allusion to the Israelites' departure from Egypt and a euphemism for death.\n\n**\"Cleverly engineered fables\" (v. 16)**: *Sesophismenois mythois* (σεσοφισμένοις μύθοις) suggests myths that have been crafted with deceptive ingenuity or \"sophistry.\"\n\n**\"Eyewitnesses\" (v. 16)**: The term *epoptai* (ἐπόπται) was a technical term used in mystery religions for those who had reached the highest level of initiation and \"beheld\" the secrets of the cult. Peter repurposes it to claim a superior, historical authority based on the Transfiguration.\n\n**\"Squalid place\" (v. 19)**: *Aukhmērō* (αὐχμηρῷ) means dry, parched, dark, or dingy. It describes the world’s condition without the light of revelation.\n\n**\"Morning star\" (v. 19)**: *Phōsphoros* (φωσφόρος) literally means \"light-bringer.\" It refers to the planet Venus, which heralds the dawn.\n\n**\"Carried along\" (v. 21)**: *Pheromenoi* (φερόμενοι) is a nautical term used for a ship being driven by the wind (as in Acts 27:15). It suggests the Spirit provided the impulse and direction for the biblical authors."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "But there were also false prophets among the people, just as there will be false teachers among you. These are people who will secretly introduce destructive sects, even denying the Master who bought them, bringing swift ruin upon themselves.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Many will follow their path of unrestrained debauchery, and because of them, the Way of Truth will be slandered.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Driven by greed, they will exploit you with fabricated stories; but their judgment, decreed long ago, has not been idle, and their destruction is not asleep.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For if God did not spare angels when they sinned, but consigned them to the deepest pits of the abyss, handing them over to be kept in chains of gloom until the judgment;",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "and if he did not spare the ancient world, but preserved Noah—a herald of righteousness—as one of only eight people when he brought a cataclysm upon the world of the ungodly;",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "and if he condemned the cities of Sodom and Gomorrah to ashes, reducing them to total ruin as a warning of what is coming for the ungodly;",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "and if he rescued righteous Lot, who was worn down by the licentious conduct of those who acknowledge no law",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "(for that righteous man, as he lived among them day after day, was tormented in his righteous soul by the lawless deeds he saw and heard)—",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "then the Lord knows how to rescue the godly from their trials, while keeping the unrighteous under punishment until the day of judgment.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "This is especially true of those who follow after the flesh in its defiling desires and who despise all lordship. Bold and self-willed, they do not tremble when they slander celestial dignities,",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "whereas even angels, though greater in might and power, do not bring a slandering judgment against such beings before the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "But these people, like unreasoning animals—creatures of instinct born only to be caught and slaughtered—slander things they do not even understand. In the midst of their own corruption, they will surely be destroyed,",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "suffering harm as the wages for the harm they have done. They consider it a pleasure to revel in broad daylight. They are stains and blemishes, feasting luxuriously in their own deceptions while they dine with you.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "They have eyes full of adultery that never cease from sin; they bait unstable souls. They have hearts trained in greed—children of a curse!",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Abandoning the straight path, they have gone astray, following the path of Balaam son of Bosor, who loved the wages of unrighteousness",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "but received a rebuke for his own lawbreaking: a voiceless beast of burden spoke with a human voice and restrained the prophet’s madness.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "These people are waterless springs and mists driven by a storm, for whom the gloom of utter darkness has been reserved.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "By speaking high-sounding, empty words, they use the unrestrained desires of the flesh to bait those who are only just escaping from the people who live in error.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "They promise them freedom, while they themselves are slaves to corruption; for a person is a slave to whatever has defeated them.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For if, after escaping the pollutions of the world through the full knowledge of our Lord and Savior Jesus Christ, they are again entangled in them and defeated, their last state has become worse for them than the first.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "It would have been better for them never to have fully known the way of righteousness than, after knowing it, to turn back from the holy commandment handed down to them.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "What has happened to them proves the truth of the proverb: \"A dog returns to its own vomit,\" and, \"A scrubbed sow goes back to wallowing in the muck.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Master\" (v. 1)**: The Greek *despotēs* denotes absolute ownership and authority. In this context, it emphasizes that these teachers are rebelling against the very one who \"purchased\" them (likely a reference to the manumission of slaves).\n\n**\"Destructive sects\" (v. 1)**: *Haireseis* (the root of \"heresy\") in the first century referred to a self-chosen school of thought or a faction. The emphasis here is on the divisive and communal nature of their error, not just the abstract ideas.\n\n**\"Exploit you with fabricated stories\" (v. 3)**: The verb *emporeuontai* is a commercial term meaning to trade or do business. It suggests these teachers view the congregation as merchandise to be sold for profit. *Plastois* (\"fabricated\") implies words molded like clay to serve a deceptive purpose.\n\n**\"The deepest pits of the abyss\" (v. 4)**: The Greek verb is *tartarōsas*, meaning to cast into Tartarus. In Greek thought, Tartarus was the lowest subterranean prison for rebellious immortals (like the Titans). Peter uses this specific Hellenistic imagery to describe the imprisonment of the \"sons of God\" who sinned in the Enochic tradition.\n\n**\"Celestial dignities\" (v. 10)**: *Doxas* (literally \"glories\") refers to high-ranking spiritual or angelic beings. The false teachers are criticized for their arrogance in mocking supernatural powers that even powerful angels treat with restraint.\n\n**\"Creatures of instinct\" (v. 12)**: *Physika* suggests beings governed entirely by their natural, animalistic impulses rather than by reason (*aloga*—\"without logos\").\n\n**\"Wages for the harm\" (v. 13)**: There is a wordplay in the Greek *adikoumenoi misthon adikias*. They are \"wronged\" (receive the penalty) as the \"wage of their wrongdoing.\" The translation \"suffering harm as the wages for the harm\" attempts to preserve this rhetorical connection.\n\n**\"Eyes full of adultery\" (v. 14)**: The Greek *ophthalmous echontes mestous moichalidos* literally reads \"having eyes full of an adulteress.\" It suggests that everywhere they look, they see only a potential partner for sin; their vision is saturated with illicit desire.\n\n**\"Corruption\" (v. 12, 19)**: *Phthora* carries a dual meaning of moral decay and physical destruction. The false teachers are slaves to moral decay, and that decay leads directly to their ultimate ruin.\n\n**\"Muck\" (v. 22)**: *Borborou* refers to thick, foul-smelling mud or filth. The contrast is between the external \"scrubbing\" (the initial change of life) and the internal nature of the animal that longs for the filth."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "This is now the second letter I am writing to you, beloved, and in both of them I am trying to stir up your pure and discerning mind by way of a reminder.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I want you to recall the words spoken long ago by the holy prophets and the commandment of the Lord and Savior delivered by your apostles.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Understand this first of all: in the last days, mockers will come with their mockery, living according to their own self-centered cravings",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "and asking, “Where is the promise of his royal presence? For ever since the fathers fell asleep in death, everything remains exactly as it has been from the very beginning of creation.”",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "They willfully ignore the fact that by the word of God the heavens existed long ago and the earth was formed out of water and held together through water.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "By these same means, the world that then existed was flooded with water and destroyed.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And by that same word, the present heavens and earth are being treasured up for fire, kept under guard until the day of judgment and the destruction of godless people.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But do not let this one fact escape your notice, beloved: with the Lord, a single day is like a thousand years, and a thousand years are like a single day.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "The Lord is not slow concerning his promise, as some people define slowness; rather, he is being patient toward you, not wishing for any to perish but for all to find their way to repentance.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "But the Day of the Lord will come like a thief. On that day, the heavens will pass away with a rushing roar, the cosmic elements will be dissolved by intense heat, and the earth and the works done within it will be exposed.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Since all these things are to be dissolved in this way, what kind of people is it necessary for you to be? You must live in holy conduct and godliness,",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "waiting for and even hastening the arrival of the day of God. Because of that day, the heavens will be dissolved by fire and the cosmic elements will melt in the heat.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "But according to his promise, we are looking forward to new heavens and a new earth, where righteousness makes its home.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Therefore, beloved, since you are looking forward to these things, strive to be found by him in peace, spotless and blameless.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "Regard the patience of our Lord as salvation, just as our beloved brother Paul also wrote to you according to the wisdom given to him.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "He speaks about these things in all his letters. There are some things in them that are difficult to grasp, which the ignorant and unstable warp—as they do the rest of the Scriptures—to their own destruction.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "You, therefore, beloved, since you already know these things, be on your guard so that you are not carried away by the error of lawless people and fall from your own firm footing.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Instead, grow in the grace and knowledge of our Lord and Savior Jesus Christ. To him be the glory both now and to the day of eternity. Amen.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Pure and discerning mind\" (v. 1)**: The Greek *eilikrinē* carries the sense of being \"judged by sunlight.\" It refers to a mind that is unmixed, sincere, and has been tested and found pure. \n\n**\"Royal presence\" (v. 4)**: The term *parousia* is often translated simply as \"coming.\" However, in the first century, it specifically referred to the formal arrival of a king or high-ranking official visiting a city. \"Royal presence\" or \"appearing\" captures the weight of this anticipated arrival better than a generic word for movement.\n\n**\"Willfully ignore\" (v. 5)**: The Greek *lanthanei gar autous touto thelontas* literally means \"this escapes them, they being willing [for it to].\" It implies a deliberate closing of the eyes to historical and theological reality.\n\n**\"Treasured up\" (v. 7)**: The verb *thēsaurizō* means to store up or treasure. It suggests that the current cosmos is being \"reserved\" or \"stored away\" for a specific purpose (judgment), just as a treasure is kept for a specific time.\n\n**\"Rushing roar\" (v. 10)**: The Greek *rhoizēdon* is an onomatopoeic adverb describing a whistling, hissing, or crackling roar—the sound of something moving rapidly through the air or the sound of a consuming flame.\n\n**\"Cosmic elements\" (v. 10, 12)**: *Stoicheia* can refer to the basic components of matter (earth, air, fire, water) or, in a first-century context, the celestial bodies (stars and planets). \"Cosmic elements\" covers both the physical and the \"heavenly\" scope of this dissolution.\n\n**\"Exposed\" (v. 10)**: Following the earliest and most reliable manuscripts (including Sinaiticus and Vaticanus), the SBLGNT uses *heurethēsetai* (\"will be found\"). Many later manuscripts and traditional translations use \"burned up.\" \"Exposed\" or \"laid bare\" reflects the difficult but superior reading: the earth isn't just destroyed; it is stripped of its coverings and its works are revealed for judgment.\n\n**\"Hastening\" (v. 12)**: The Greek *speudontas* can mean \"earnestly desiring\" or \"striving for,\" but it also carries the sense of \"accelerating\" or \"speeding up.\" In the context of early Jewish and Christian thought, holy living and repentance were believed to \"hurry\" the coming of God’s kingdom.\n\n**\"Warp\" (v. 16)**: The Greek *streblousin* refers to a rack or a windlass used to twist or torture something. It is a vivid metaphor for people who \"put the text on the rack\" to force it to say something it does not mean.\n\n**\"The day of eternity\" (v. 18)**: The literal Greek *hēmeran aiōnos* (\"day of the age\") is an unusual expression. It suggests a day that marks the beginning of the eternal age—a \"day\" that does not end in night."
    }
  ]
}