{
  "book": "2Thessalonians",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul, Silvanus, and Timothy, to the assembly of the Thessalonians that exists in God our Father and the Lord Jesus Christ:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Grace to you and peace from God the Father and the Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "We are obligated to thank God always for you, brothers and sisters, as is only fitting, because your faith is flourishing beyond measure and the love that every single one of you has for each other is increasing.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "As a result, we ourselves boast about you among the assemblies of God for your steadfast endurance and faith in the midst of all your persecutions and the crushing pressures you are sustaining.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "This is a clear sign of God’s righteous judgment, intended to prove you worthy of the kingdom of God, for which you are indeed suffering.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "For it is surely a matter of justice for God to repay those who are crushing you with pressure,",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "and to grant you, who are being crushed, a release from that tension along with us. This will happen at the revelation of the Lord Jesus from heaven with his powerful angels",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "in a flame of fire, as he executes vindicating justice upon those who refuse to acknowledge God and those who do not obey the good news of our Lord Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "These will pay the penalty of eternal ruin, separated from the presence of the Lord and from the glory of his inherent strength,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "on that day when he comes to be glorified among his holy ones and to be marveled at among all those who have believed—because our testimony to you was indeed believed.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Toward this end, we also pray for you always, that our God may consider you worthy of his calling and may, by his power, bring to full fruition every desire for goodness and every work produced by faith.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "In this way, the name of our Lord Jesus may be glorified in you, and you in him, according to the grace of our God and the Lord Jesus Christ.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Assembly\" (v. 1)**: The Greek *ekklēsia* refers to a gathered body of citizens called out to manage the affairs of a city. While traditionally \"church,\" this can evoke modern buildings or institutions. \"Assembly\" captures the social reality of a distinct community gathered under a new authority.\n\n**\"Flourishing beyond measure\" (v. 3)**: The verb *hyperauxanei* is an intensified form of \"to grow.\" Paul uses this rare compound to emphasize that their growth is exceeding normal expectations despite their environment.\n\n**\"Crushing pressures\" (v. 4, 6, 7)**: The Greek *thlipsis* literally refers to pressure, such as the pressing of grapes or a heavy weight. Modern \"affliction\" or \"tribulation\" has become a religious abstraction; \"crushing pressure\" restores the visceral sense of being squeezed by external social and political forces.\n\n**\"Release from that tension\" (v. 7)**: The Greek *anesis* means a loosening, relaxation, or the slacking of a bowstring. It is the direct lexical opposite of *thlipsis* (pressure). Where their current experience is one of being \"pressed,\" their future is one of \"release.\"\n\n**\"Vindicating justice\" (v. 8)**: The term *ekdikēsis* is often translated \"vengeance,\" but in a first-century context, it refers to the legal execution of justice or the settling of a rightful claim. It is not about emotional spite but about the cosmic restoration of right order.\n\n**\"Eternal ruin\" (v. 9)**: The Greek *olethros* refers to destruction or death, but in a judicial context, it implies the loss of everything that makes life worth living. \"Ruin\" captures the sense of something being permanently broken or discarded rather than simply extinguished.\n\n**\"Separated from the presence\" (v. 9)**: The Greek *apo prosōpou* (\"from the face\") is a Semitism (reflecting the Hebrew *mippĕnê*) that refers to being in someone’s direct presence. The preposition *apo* here functions locally to indicate separation—the essence of the \"ruin\" is exclusion from the divine presence.\n\n**\"Bring to full fruition every desire for goodness\" (v. 11)**: The Greek *plērōsē pasan eudokian agathōsynēs* is dense. *Eudokian* refers to a \"good pleasure\" or \"purpose.\" The translation emphasizes the active completion (*plērōsē*) of their internal moral leanings toward good.\n\n**\"The name\" (v. 12)**: In both Hebrew and Greek thought, the \"name\" (*onoma*) is not just a label but represents the person’s character, authority, and reputation. To glorify the \"name\" is to bring honor to the person of Jesus himself."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "Now we ask you, brothers and sisters, regarding the royal presence of our Lord Jesus Christ and our gathering together to meet him:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "do not let your minds be easily shaken or disturbed—whether by some spiritual revelation, or by a spoken message, or by a letter allegedly from us—claiming that the Day of the Lord has already arrived.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Do not let anyone deceive you in any way. For that day will not come unless the Great Rebellion occurs first and the Man of Lawlessness is unveiled—the one destined for destruction.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "He is the adversary who exalts himself above every so-called god or object of worship, even going so far as to seat himself in the inner sanctuary of God, displaying himself as being God.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Do you not remember that while I was still with you, I used to tell you these things?",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And you know what is currently restraining him, so that he will be unveiled only when his own proper time comes.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For the secret power of lawlessness is already at work; but there is one who restrains it for now, until he is taken out of the way.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Then the Lawless One will be unveiled, whom the Lord Jesus will slay with the breath of his mouth and render powerless by the manifest splendor of his royal presence.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "The presence of the Lawless One is in accordance with the operative power of Satan, accompanied by every kind of counterfeit power, signs, and wonders,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "and every sort of wicked deception for those who are perishing. They perish because they did not welcome the love of the truth so as to be saved.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For this reason, God sends them an operative power of delusion so that they will believe the Lie,",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "in order that all who did not believe the truth but instead took pleasure in injustice may be judged.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "But we are always obligated to give thanks to God for you, brothers and sisters beloved by the Lord, because God chose you as the firstfruits for salvation through the sanctifying work of the Spirit and faith in the truth.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "He called you to this through our good news, so that you might acquire the glory of our Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "So then, brothers and sisters, stand firm and hold fast to the traditions you were taught by us, whether by a spoken word or by our letter.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "May our Lord Jesus Christ himself and God our Father—who loved us and by his grace gave us eternal encouragement and good hope—",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "encourage your hearts and strengthen you in every good work and word.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Royal presence\" (v. 1, 8, 9)**: The Greek *parousia* refers to the arrival or presence of a high-ranking official or king. In the first century, it specifically evoked the state visit of an emperor. Traditional translations use \"coming,\" but \"presence\" or \"royal presence\" better captures the weight of a King arriving to take residence with his people.\n\n**\"Already arrived\" (v. 2)**: The verb *enestēken* means \"to be present\" or \"to have set in.\" The Thessalonians weren't worried that the Day of the Lord was *near*; they were terrified by a report that they had missed it and it was already happening.\n\n**\"Great Rebellion\" (v. 3)**: *Apostasia* carries a political and military nuance—a revolt or a formal abandonment of allegiance. In this context, it refers to a climactic, definitive defiance of God’s authority.\n\n**\"Man of Lawlessness\" (v. 3)**: *Anomia* is more than just breaking rules; it is a fundamental rejection of God’s divine order and law.\n\n**\"Inner sanctuary\" (v. 4)**: The Greek *naos* refers specifically to the central temple building—the dwelling place of the deity—rather than the *hieron* (the entire temple complex).\n\n**\"Secret power of lawlessness\" (v. 7)**: *Mystērion* (mystery) refers to something previously hidden that is now beginning to operate. Combined with *energeitai* (at work/energized), it suggests a hidden, supernatural agency already active behind the scenes.\n\n**\"The Lie\" (v. 11)**: The use of the definite article (*tō pseudei*) suggests a specific deception—likely the Lawless One’s claim to divinity mentioned in verse 4—rather than falsehood in general.\n\n**\"Firstfruits\" (v. 13)**: The SBLGNT reads *aparchēn* (\"firstfruits\"), a term rooted in the Septuagint's sacrificial system. It denotes the first portion of the harvest, which is holy and serves as a pledge of the full harvest to come.\n\n**\"Encouragement\" (v. 16, 17)**: *Paraklēsis* is often translated as \"comfort,\" but in a Greco-Roman context, it frequently refers to exhortation or strengthening a soldier’s resolve. \"Encouragement\" captures this blend of solace and empowerment."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "Finally, brothers, pray for us, that the word of the Lord may spread rapidly and be honored just as it was among you,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "and that we may be rescued from perverse and malicious people; for not everyone possesses the faith.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "But the Lord is faithful, and he will strengthen you and guard you from the Evil One.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "We have confidence in the Lord regarding you, that you are doing and will continue to do the things we command.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "May the Lord direct your hearts into the love of God and into the endurance of Christ.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Now we command you, brothers, in the name of our Lord Jesus Christ, to keep yourselves away from every brother who is breaking rank and not living according to the tradition that they received from us.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "For you yourselves know how it is necessary to imitate us: we did not break rank when we were among you,",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "nor did we eat anyone’s bread without paying for it. On the contrary, we worked with labor and toil night and day so that we would not be a financial burden to any of you.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "This was not because we do not have the right to support, but so that we might offer ourselves as a model for you to imitate.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For even when we were with you, we gave you this command: “If anyone is not willing to work, neither let him eat.”",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For we hear that some among you are breaking rank—not working at all, but instead acting as busybodies.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "To such people we command and exhort in the Lord Jesus Christ that by working with a settled spirit, they may eat their own bread.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "As for you, brothers, do not lose heart in doing what is good.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "If anyone does not obey our word in this letter, take special note of that person and do not associate with them, so that they may be brought to a point of healthy shame.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Yet do not regard them as an enemy, but warn them as a brother.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Now may the Lord of peace himself give you peace at all times and in every way. The Lord be with you all.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "This greeting is in my own hand—Paul’s—which is the distinguishing mark in every letter; this is how I write.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "The grace of our Lord Jesus Christ be with you all.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Perverse\" (v. 2)**: The Greek *atopōn* literally means \"out of place\" or \"unusual.\" In this context, it refers to people whose behavior or thinking is morally distorted or \"out of bounds.\"\n\n**\"The faith\" (v. 2)**: The presence of the definite article (*hē pistis*) suggests Paul is referring to the specific body of Christian belief or the capacity for such belief, rather than \"faith\" as a general human quality.\n\n**\"The Evil One\" (v. 3)**: The Greek *tou ponērou* can be translated as \"evil\" (abstract) or \"the Evil One\" (Satan). Given the personal nature of the preceding \"faithful Lord\" and the \"malicious people\" in verse 2, the masculine/personal reference to the source of evil is more likely.\n\n**\"Breaking rank\" (vv. 6, 7, 11)**: The Greek *ataktōs* and its verbal form *ētaktēsamen* are military terms referring to a soldier who is out of order or has broken formation. In the context of the Thessalonian church, it refers to those who have abandoned the social and ethical \"order\" of the community, specifically by refusing to work and relying on others' charity. Traditional translations like \"disorderly\" or \"idle\" capture only part of the nuance.\n\n**\"Acting as busybodies\" (v. 11)**: Paul uses a wordplay in the Greek (*ergazomenous* vs. *periergazomenous*) that is difficult to replicate in English. He is saying they are \"not working, but 'working around' the business of others.\" \n\n**\"Settled spirit\" (v. 12)**: The Greek *hēsychia* is often translated as \"quietness,\" but it implies a state of being tranquil and undisturbed—the opposite of the frantic meddling described in verse 11.\n\n**\"Healthy shame\" (v. 14)**: The verb *entrapē* literally means \"to turn back into oneself.\" It refers to a social and internal shaming intended to produce self-reflection and eventual repentance, rather than a destructive or exclusionary shame.\n\n**\"Warn\" (v. 15)**: The Greek *noutheteite* means to place a matter on the mind. It is a corrective instruction rooted in concern, distinct from a harsh condemnation.\n\n**\"Distinguishing mark\" (v. 17)**: Paul typically used a scribe to write his letters but would sign the end himself to authenticate the document. This was a \"sign\" (*sēmeion*) or proof against forgeries, which he mentions earlier in the letter (2 Thess 2:2)."
    }
  ]
}