{
  "book": "2Timothy",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul, an envoy of Christ Jesus through the will of God, sent to announce the promise of the life found in Christ Jesus,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "to Timothy, my beloved child: Grace, mercy, and peace from God the Father and Christ Jesus our Lord.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "I am grateful to God, whom I serve with a clear conscience as my ancestors did, when I constantly remember you in my petitions night and day.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "I long to see you, remembering your tears, so that I may be completely filled with joy.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "I am reminded of your genuine faith—a faith free from any acting—which lived first in your grandmother Lois and your mother Eunice, and I am fully convinced now lives in you as well.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "For this reason, I am reminding you to fan into a flame the gift of God that is within you through the laying on of my hands.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "For God did not give us a spirit of cowardice, but one of power, and of love, and of wise self-mastery.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Therefore, do not be ashamed of the testimony about our Lord, nor of me his prisoner. Instead, take your share of suffering for the Good News, relying on the power of God.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "He is the one who saved us and called us with a holy calling, not because of anything we have done, but according to his own purpose and the grace given to us in Christ Jesus before the beginning of time.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "This grace has now been made visible through the appearing of our Savior Christ Jesus, who rendered death powerless and brought life and incorruptibility into the light through the Good News.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For this Good News I was appointed a herald, an envoy, and a teacher.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "This is why I suffer as I do. But I am not ashamed, for I know the one in whom I have placed my trust, and I am convinced that he is able to guard the sacred trust I have committed to him until that Day.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Hold to the sketch of healthy words which you heard from me, in the faith and love that are in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Guard this beautiful sacred trust through the Holy Spirit who makes his home within us.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "You know this: that everyone in the province of Asia has turned away from me, including Phygelus and Hermogenes.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "May the Lord grant mercy to the household of Onesiphorus, because he often refreshed me and was not ashamed of my imprisonment.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "On the contrary, when he arrived in Rome, he searched for me with great diligence and found me.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "May the Lord grant that he finds mercy from the Lord on that Day! And you know very well how much he served in Ephesus.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Envoy\" (v. 1, 11)**: The Greek *apostolos* refers to a messenger or representative sent with authorized credentials. While \"apostle\" is the traditional loanword, \"envoy\" captures the functional reality of a person acting with the authority of the sender in a first-century context.\n\n**\"Genuine faith—a faith free from any acting\" (v. 5)**: The Greek *anypokritos* is the negation of *hypokritēs* (an actor/performer). Paul is emphasizing that Timothy’s faith is not a theatrical display or a mask, but a sincere, \"un-acted\" reality.\n\n**\"Wise self-mastery\" (v. 7)**: The Greek *sōphronismos* suggests more than just \"self-control\" or \"a sound mind.\" It implies the result of a disciplined, balanced, and restored mind—the ability to act with sobriety and judgment under pressure.\n\n**\"Rendered death powerless\" (v. 10)**: The verb *katargeō* means to make ineffective, nullify, or strip of power. \"Abolished\" is common but can be misleading since physical death still occurs; the Greek emphasizes that Christ has broken the power and authority that death once held.\n\n**\"Incorruptibility\" (v. 10)**: *Aphtharsia* refers to the state of being beyond the reach of decay, ruin, or death. It is the quality of the resurrected life.\n\n**\"Sacred trust\" (v. 12, 14)**: The Greek *parathēkē* is a legal and financial term for a \"deposit\" or \"consignment\" left in someone’s care. In verse 12, it refers to Paul's life/ministry committed to God; in verse 14, it refers to the Good News committed to Timothy.\n\n**\"Sketch\" (v. 13)**: The Greek *hypotypōsis* refers to an outline, pattern, or preliminary sketch used by an artist or writer. Paul is telling Timothy to use his teachings as the foundational blueprint for his own ministry.\n\n**\"Healthy words\" (v. 13)**: The Greek *hygiainontōn* is the root of the English \"hygiene.\" It refers to teaching that is life-giving, wholesome, and \"spiritually healthy,\" as opposed to the \"diseased\" or \"gangrenous\" talk of false teachers mentioned elsewhere in the letter.\n\n**\"Refreshed\" (v. 16)**: The Greek *anepsyxen* literally means \"to cool off\" or \"to give fresh air.\" It suggests that Onesiphorus provided relief and recovery to Paul in the stifling conditions of a Roman prison."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "You then, my child, find your strength in the grace that is found in Christ Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "The things you heard from me in the presence of many witnesses, entrust these as a sacred deposit to reliable people who will be competent to teach others as well.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Join me in suffering hardship like a noble soldier of Christ Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "No one serving as a soldier gets entangled in the business of daily life; he stays focused so that he may please the one who enlisted him.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Likewise, if anyone competes as an athlete, he is not awarded the victor’s wreath unless he competes according to the rules.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "It is the hard-working farmer who must be the first to receive a share of the crops.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Reflect on what I am saying, for the Lord will give you insight into all these things.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Keep Jesus Christ in your mind—raised from the dead and descended from the seed of David—according to my good news.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "For this message I suffer hardship even to the point of being bound in chains like a criminal. But the word of God is not in chains!",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For this reason, I endure everything for the sake of the chosen ones, so that they too may obtain the salvation that is in Christ Jesus, along with eternal glory.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "This saying is trustworthy: If we died with him, we will also live with him;",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "If we endure, we will also reign with him; If we deny him, he will also deny us;",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "If we are unfaithful, he remains faithful, for he is unable to deny his own nature.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Keep reminding them of these things. Charge them solemnly before God not to engage in battles over words; such wrangling is of no use and only brings ruin to those who listen.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "Make every effort to present yourself to God as one who has passed the test—a worker who has no reason to be ashamed, cutting a straight path through the word of truth.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But sidestep godless, empty chatter, for those who indulge in it will only progress into further ungodliness.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Their talk will spread like a consuming gangrene. Hymenaeus and Philetus are among them;",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "they have missed the mark regarding the truth by claiming that the resurrection has already happened, and they are overturning the faith of some.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Nevertheless, the solid foundation of God stands firm, bearing this seal: “The Lord knows those who are his,” and, “Let everyone who names the name of the Lord depart from unrighteousness.”",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Now in a large household there are not only vessels of gold and silver, but also of wood and clay; some are for honorable use and some for ordinary use.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Therefore, if anyone cleanses himself from these things, he will be a vessel for honor—set apart as holy, highly useful to the Master of the house, and prepared for every good work.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Run away from youthful cravings. Instead, chase after righteousness, faith, love, and peace, along with those who call on the Lord out of a pure heart.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "Have nothing to do with foolish and undisciplined speculations, knowing that they only breed fights.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "A bondservant of the Lord must not be a fighter; instead, he must be kind to everyone, skillful at teaching, and patient when wronged.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "He must correct those in opposition with gentle strength, in the hope that God may perhaps grant them a change of heart that leads to a full recognition of the truth.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Then they may sober up and escape from the trap of the slanderer, after having been captured alive by him to do his will.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Entrust these as a sacred deposit\" (v. 2)**: The Greek *parathou* is a banking and legal term. It refers to a \"deposit\" or \"trust\" handed over to another for safekeeping. Paul views the apostolic teaching as a treasure that must be guarded and passed on intact.\n\n**\"Noble soldier\" (v. 3)**: The word *kalos* is often translated as \"good,\" but in the context of a soldier or athlete, it carries the sense of \"noble,\" \"excellent,\" or \"exemplary.\"\n\n**\"The business of daily life\" (v. 4)**: The Greek *pragmateiais* refers to civil or commercial occupations. The soldier’s focus is singular; the metaphor emphasizes the necessity of avoiding distractions that dilute one's primary mission.\n\n**\"According to the rules\" (v. 5)**: *Nomimōs* refers to the specific regulations of the Greek games, which included not only the rules of the event but also the requirements for training.\n\n**\"Cutting a straight path\" (v. 15)**: The Greek *orthotomounta* literally means \"to cut straight\" (like a tentmaker cutting fabric or a mason cutting stone). It implies precision and directness in handling and explaining the message of truth.\n\n**\"Consuming gangrene\" (v. 17)**: The Greek *gangraina* refers to a sore or ulcer that spreads and eats away at the flesh. The term *nomēn* refers to the \"pasture\" or \"range\" of the disease, describing its aggressive movement through the body (or in this case, the community).\n\n**\"Ordinary use\" (v. 20)**: The contrast between *timēn* (honor/value) and *atímian* (without honor) distinguishes between vessels used for special occasions/noble purposes and those used for common, menial, or even \"dishonorable\" purposes (like waste).\n\n**\"Youthful cravings\" (v. 22)**: *Neōterikas epithymias* encompasses more than just sexual desire; in the ancient world, it also referred to the impulsivity, pride, and love of contention associated with young men.\n\n**\"Gentle strength\" (v. 25)**: The Greek *prautēti* (often \"meekness\") describes power under control. It is the disposition of a person who has the authority or strength to react harshly but chooses gentleness instead.\n\n**\"Sober up\" (v. 26)**: The Greek *ananēpsōsin* literally means to become sober again after being drunk. It suggests that those caught in false teaching are in a state of spiritual intoxication or stupor.\n\n**\"Captured alive\" (v. 26)**: *Ezōgrēmenoi* is a term used in hunting or warfare for taking prisoners alive rather than killing them. The Greek text here is grammatically difficult regarding the pronouns (*autou* and *ekeinou*). This translation interprets \"him\" (*autou*) as the slanderer/devil and \"his\" (*ekeinou*) as the devil's will, describing the state of those currently ensnared."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "But understand this: in the final days, harsh and difficult times will set in.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For people will be lovers of self, lovers of money, braggarts, arrogant, abusive in their speech, disobedient to parents, ungrateful, profane,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "heartless toward family, unwilling to reconcile, malicious gossips, lacking self-restraint, savage, hostile to what is good,",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "treacherous, reckless, blinded by their own conceit, and lovers of pleasure rather than lovers of God.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "They will maintain a facade of godliness while having denied its actual power. Turn away from such people.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "For among them are those who worm their way into households and captivate vulnerable women who are weighed down by sins and led astray by all sorts of cravings—",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "women who are always trying to learn but are never able to arrive at a full knowledge of the truth.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "In the same way that Jannes and Jambres stood against Moses, these people also stand against the truth. They are men whose minds are corrupted, who have failed the test regarding the faith.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "But they will not make much further progress, for their senselessness will be plain to everyone, just as it was with those two men.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "You, however, have closely followed my teaching, my way of life, my purpose, my faith, my patience, my love, and my endurance,",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "as well as the persecutions and sufferings that came upon me in Antioch, Iconium, and Lystra. You saw what kind of persecutions I endured, yet the Lord rescued me out of all of them.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Indeed, everyone who is determined to live a godly life in Christ Jesus will be persecuted.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "But wicked people and charlatans will go from bad to worse, deceiving others and being deceived themselves.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "But as for you, remain in the things you have learned and have become convinced of, knowing from whom you learned them,",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "and that from your infancy you have known the sacred writings which are able to give you the wisdom that leads to salvation through the faith that is in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Every scripture is breathed out by God and is profitable for teaching, for pointing out error, for setting things right, and for disciplined training in righteousness,",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "so that the person who belongs to God may be fully capable, equipped for every good work.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Harsh and difficult times\" (v. 1)**: The Greek *chalepoi* carries a sense of being \"hard to deal with,\" \"savage,\" or \"dangerous.\" It describes a season that is not merely inconvenient, but actively perilous and difficult to endure.\n\n**\"Heartless toward family\" (v. 3)**: The Greek *astorgoi* is the negation of *storgē*, the natural affection between family members. It denotes a breakdown of the most fundamental human bonds.\n\n**\"Unwilling to reconcile\" (v. 3)**: The Greek *aspondoi* literally refers to those who refuse to enter into a *spondē* (a libation or treaty). These are people who are implacable and refuse to make peace.\n\n**\"Facade of godliness\" (v. 5)**: *Morphōsis* refers to the outward shape, form, or appearance of something. In this context, it suggests an external silhouette of piety that lacks the internal substance (the *dynamis* or \"power\").\n\n**\"Vulnerable women\" (v. 6)**: The Greek *gunaikaria* is a diminutive of \"women.\" While often translated as \"weak women,\" the diminutive here functions to describe a specific target demographic of the false teachers—those who are spiritually or socially vulnerable to manipulation.\n\n**\"Charlatans\" (v. 13)**: The word *goētes* originally referred to sorcerers or wailers (who used incantations). By the first century, it had come to describe itinerant swindlers, tricksters, or impostors who used emotional manipulation to deceive.\n\n**\"Breathed out by God\" (v. 16)**: *Theopneustos* is a rare term. While \"inspired\" is the traditional translation, \"breathed out\" more accurately reflects the Greek compound (God + breath/spirit), emphasizing the divine origin of the text rather than the subjective experience of the human authors.\n\n**\"Setting things right\" (v. 16)**: *Epanorthōsis* refers to restoring something to its proper, upright state. It is the corrective process of \"straightening out\" what has become crooked.\n\n**\"Fully capable\" (v. 17)**: The Greek *artios* refers to being \"fit\" or \"complete\" for a specific purpose. It implies a state of proficiency where nothing is lacking for the task at hand."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "I solemnly charge you in the presence of God and of Christ Jesus—who is about to judge the living and the dead—and by his appearing and his kingdom:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Proclaim the message; stand ready whether the timing is favorable or unfavorable; convict, rebuke, and encourage, with the utmost patience and careful instruction.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For a time is coming when people will not tolerate healthy teaching. Instead, to suit their own desires, they will accumulate for themselves a swarm of teachers to tickle their ears.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "They will turn their hearing away from the truth and wander off into myths.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "As for you, keep a clear head in every situation, endure hardship, do the work of an evangelist, and fulfill every aspect of your service.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "For I am already being poured out as a sacrificial libation, and the moment of my release has arrived.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "I have competed well in the great contest; I have finished the race; I have guarded the faith.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Now there is laid up for me the victor’s wreath of righteousness, which the Lord, the righteous Judge, will award to me on that Day—and not only to me, but also to all those who have deeply loved his appearing.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Make every effort to come to me soon.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "For Demas, having loved the present age, has abandoned me and gone to Thessalonica. Crescens has gone to Galatia, and Titus to Dalmatia.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Luke alone is with me. Get Mark and bring him with you, for he is useful to me for service.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "I have sent Tychicus to Ephesus.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "When you come, bring the traveling cloak I left with Carpus at Troas, and the scrolls—especially the parchments.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Alexander the metalworker did me much harm; the Lord will repay him according to his deeds.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "You too must be on guard against him, for he vehemently opposed our message.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "At my first legal defense, no one stood by me; everyone abandoned me. May it not be held against them!",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "But the Lord stood by me and gave me strength, so that through me the proclamation might be fully completed and all the Gentiles might hear it. And I was rescued from the lion’s mouth.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "The Lord will rescue me from every evil deed and will bring me safely into his heavenly kingdom. To him be the glory forever and ever, Amen.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Greet Prisca and Aquila, and the household of Onesiphorus.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Erastus remained in Corinth, but I left Trophimus behind in Miletus because he was ill.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Make every effort to arrive before winter. Eubulus greets you, as do Pudens, Linus, Claudia, and all the brothers and sisters.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "The Lord be with your spirit. Grace be with you all.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Solemnly charge\" (v. 1)**: The Greek *diamartyromai* carries a legal and sacral weight, suggesting a testimony given under oath or a command delivered in a divine courtroom setting.\n\n**\"Tickle their ears\" (v. 3)**: The Greek *knēthomai tēn akoēn* is a vivid idiom. It describes a craving for physical sensation—specifically, seeking out speakers who provide the \"itch\" of novelty or validation for one's own desires rather than the \"health\" of sound doctrine.\n\n**\"Sacrificial libation\" (v. 6)**: The verb *spendomai* refers specifically to the pouring out of a drink offering (usually wine) that accompanied a primary sacrifice. Paul views his impending execution not as a tragedy, but as the final ritual act of his service to God.\n\n**\"Release\" (v. 6)**: The word *analysis* refers to unloosing or undoing. In a first-century context, it was used for weighing anchor to set sail or striking a tent to move camp. It views death as a departure to a new destination.\n\n**\"Great contest\" (v. 7)**: *Agōn* (from which we get \"agony\") refers to any strenuous exertion, particularly in athletic games or military combat. \"Fought the good fight\" is traditional, but \"competed in the contest\" better captures the athletic metaphors (race, wreath) that follow.\n\n**\"Victor’s wreath\" (v. 8)**: *Stephanos* refers to the laurel wreath given to winning athletes, not a royal gold crown (*diadēma*). It emphasizes the completion of a disciplined struggle.\n\n**\"Legal defense\" (v. 16)**: *Apologia* is a technical term for a formal courtroom defense. Paul is likely referring to the *prima actio* (the first hearing) of his second Roman imprisonment.\n\n**\"Lion’s mouth\" (v. 17)**: This is likely an allusion to Psalm 22:21 (LXX 21:22). While it could refer to the arena, it more likely functions as a metaphor for extreme peril or the power of the enemy (Satan/Rome) from which God delivered him during his first hearing.\n\n**\"Parchments\" (v. 13)**: *Membranas* refers to vellum or skins, which were more expensive and durable than papyrus. These may have been Paul's personal copies of the Hebrew Scriptures or his own notebooks and records."
    }
  ]
}