{
  "book": "Acts",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "I composed the first treatise, O Theophilus, concerning all that Jesus began both to do and to teach,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "until the day he was taken up, after he had given instructions through the Holy Spirit to the apostles whom he had chosen.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "To these men he also presented himself alive after his suffering by many convincing proofs, appearing to them over a period of forty days and speaking about the matters of the Kingdom of God.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "While eating salt with them, he commanded them not to depart from Jerusalem, but to wait for the promise of the Father, \"which,\" he said, \"you heard from me;",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "for while John baptized with water, you will be baptized in the Holy Spirit not many days from now.\"",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "So when they had come together, they began asking him, \"Lord, is it at this time that you are restoring the sovereignty to Israel?\"",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "He said to them, \"It is not for you to know the spans of time or the appointed moments which the Father has set within his own authority.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But you will receive power when the Holy Spirit has come upon you, and you will be my witnesses in Jerusalem, in all Judea and Samaria, and to the furthest reaches of the earth.\"",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "After he had said these things, while they were watching, he was lifted up, and a cloud took him from their sight.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "As they were gazing intently into the sky while he was going, look! Two men in white clothing stood beside them",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "and said, \"Men of Galilee, why do you stand looking into the sky? This same Jesus, who was taken up from you into heaven, will come in the same way you saw him going into heaven.\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Then they returned to Jerusalem from the mount called 'of Olives,' which is near Jerusalem, a Sabbath’s journey away.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "When they entered the city, they went up to the upstairs room where they were staying: Peter and John and James and Andrew, Philip and Thomas, Bartholomew and Matthew, James the son of Alphaeus and Simon the Zealot and Judas the son of James.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "All these were persisting with one mind in prayer, along with the women and Mary the mother of Jesus, and with his brothers.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "In those days, Peter stood up in the midst of the brothers (the crowd of persons gathered together was about one hundred and twenty) and said,",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "\"Brothers, it was necessary for the Scripture to be fulfilled which the Holy Spirit spoke beforehand through the mouth of David concerning Judas, who became a guide for those who arrested Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For he was numbered among us and was allotted a share in this ministry.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "(Now this man acquired a field with the reward of his unrighteousness, and falling face-forward, he burst open in the middle and all his intestines spilled out.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "This became known to everyone living in Jerusalem, so that the field was called in their own dialect 'Akeldama,' that is, 'Field of Blood.')",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "\"For it is written in the Book of Psalms: *Let his homestead become desolate and let there be no one living in it*, and, *Let another take his position of oversight.*",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Therefore, it is necessary that of the men who accompanied us during all the time the Lord Jesus went in and out among us—",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "beginning from the baptism of John until the day he was taken up from us—one of these must become a witness of his resurrection along with us.\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "So they put forward two: Joseph called Barsabbas, who was also called Justus, and Matthias.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "And they prayed and said, \"You, Lord, who know the hearts of everyone, show which one of these two you have chosen",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "to take the place in this ministry and apostleship from which Judas turned aside to go to his own place.\"",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Then they cast lots for them, and the lot fell on Matthias, and he was counted together with the eleven apostles.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"First treatise\" (v. 1)**: The Greek *logos* here refers to a formal written account or book. Using \"treatise\" honors the literary structure of Luke-Acts as a two-volume work.\n\n**\"Convincing proofs\" (v. 3)**: The term *tekmēriois* refers to evidence that is demonstrable and certain, distinguishing it from mere testimony or hearsay.\n\n**\"While eating salt with them\" (v. 4)**: The Greek *synalizomenos* is a difficult term. While some translate it simply as \"gathering with them,\" its etymological roots and the Aramaic cultural context suggest \"sharing salt\"—a metaphor for table fellowship and the sealing of a covenant. Given Jesus’s post-resurrection appearances often involved eating (Luke 24:41-43), this rendering captures the intimate, communal nature of the setting.\n\n**\"Sovereignty\" (v. 6)**: The Greek *basileia* is often \"kingdom,\" but in the context of the disciples’ question, they are asking about the restoration of national self-rule and political power to Israel. \"Sovereignty\" captures this political dimension.\n\n**\"Spans of time or appointed moments\" (v. 7)**: This preserves the distinction between *chronous* (quantitative time, durations) and *kairous* (qualitative time, decisive or divinely appointed moments).\n\n**\"Furthest reaches of the earth\" (v. 8)**: The phrase *eschatou tēs gēs* likely refers not just to distance, but to the ends of the known world (the Roman ecumene), signaling the universal scope of the mission.\n\n**\"A Sabbath's journey\" (v. 12)**: This is a specific Jewish measurement (approx. 2,000 cubits or 0.6 miles) based on Rabbinic interpretations of the Law. It signals to the reader the proximity of the mount to the city while grounding the narrative in Jewish legal reality.\n\n**\"Persons\" (v. 15)**: The Greek *onomatōn* literally means \"names,\" but in this context, it is a Semitic idiom (often found in the Septuagint) referring to people in a census or list.\n\n**\"Allotted a share\" (v. 17)**: The Greek *elachen ton klēron* uses the language of \"lots.\" This creates a literary \"bookend\" with verse 26, where the replacement is chosen by lot.\n\n**\"Position of oversight\" (v. 20)**: The Greek *episkopēn* refers to an office or a charge of responsibility. It is the term from which \"bishop\" is derived, but here it refers to the specific functional role Judas vacated.\n\n**\"Know the hearts of everyone\" (v. 24)**: The Greek *kardiognōsta* is a compound word (\"heart-knower\"). It is an attribute of God common in Jewish prayer, emphasizing divine election over human preference."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "When the day of Pentecost had fully arrived, they were all gathered together in one place.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Suddenly, a sound like the rush of a violent blast of wind came from heaven and filled the entire house where they were sitting.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Divided tongues, appearing like fire, became visible to them and settled on each one of them.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "They were all filled with the Holy Spirit and began to speak in different languages, as the Spirit gave them the ability to speak with inspired colonial weight.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Now there were devout Jews from every nation under heaven living in Jerusalem.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "When this sound occurred, the crowd gathered and was thrown into confusion, because each person heard them speaking in their own native dialect.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "They were completely astonished and amazed, saying, \"Look, are not all these who are speaking Galileans?",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "How is it then that each of us hears them in our own native dialect in which we were born?",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Parthians, Medes, and Elamites; residents of Mesopotamia, Judea and Cappadocia, Pontus and Asia,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Phrygia and Pamphylia, Egypt and the regions of Libya near Cyrene; visitors from Rome,",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "both Jews and converts to Judaism; Cretans and Arabs—we hear them speaking in our own languages about the magnificent works of God!\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "They were all utterly perplexed and stayed in a state of uncertainty, saying to one another, \"What does this mean?\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "But others were mocking them, saying, \"They are full of new, sweet wine!\"",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "But Peter, standing with the eleven, raised his voice and addressed them with inspired solemnity: \"Men of Judea and all who live in Jerusalem, let this be known to you, and pay close attention to my words.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "These men are not drunk, as you suppose, for it is only the third hour of the day.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Rather, this is what was spoken through the prophet Joel:",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "‘And it shall be in the last days,’ says God, ‘that I will pour out from my Spirit upon all flesh; your sons and your daughters shall prophesy, your young men shall see visions, and your old men shall dream dreams.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Even upon my male servants and my female servants in those days I will pour out from my Spirit, and they shall prophesy.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "I will produce wonders in the heaven above and signs on the earth below: blood, and fire, and a cloud of smoke.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "The sun shall be turned into darkness and the moon into blood, before the arrival of the great and glorious day of the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "And it shall be that everyone who calls upon the name of the Lord will be saved.’",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "“Men of Israel, listen to these words: Jesus the Nazarene was a man publicly authenticated to you by God through miracles, wonders, and signs that God performed through him in your midst, just as you yourselves know.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "This man, delivered up by the predetermined counsel and foreknowledge of God, you executed by nailing him to a cross through the hands of lawless men.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "But God raised him up, having released the birth-pangs of death, because it was impossible for him to be held in its power.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "For David says concerning him: ‘I saw the Lord before me continually, for he is at my right hand so that I will not be shaken.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Therefore my heart was glad and my tongue rejoiced; moreover, my flesh will live in hope.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "For you will not abandon my soul to Hades, nor will you allow your Holy One to experience decay.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "You have made known to me the paths of life; you will fill me with gladness in your presence.’",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "“Brothers, I can speak with confidence to you about the patriarch David, that he both died and was buried, and his tomb is among us to this day.",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "Therefore, since he was a prophet and knew that God had sworn to him with an oath to seat one of his descendants upon his throne,",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "he spoke with foresight concerning the resurrection of the Messiah: that he was neither abandoned to Hades, nor did his flesh experience decay.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "This Jesus, God raised up, and of this we are all witnesses.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "Therefore, having been exalted to the right hand of God, and having received from the Father the promise of the Holy Spirit, he has poured out this which you both see and hear.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "For David did not ascend into the heavens, but he himself says: ‘The Lord said to my Lord: “Sit at my right hand,",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "until I make your enemies a footstool for your feet.”’",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "“Therefore, let the entire house of Israel know with certainty that God has made him both Lord and Messiah—this Jesus whom you crucified!”",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "Now when they heard this, they were pierced to the heart and said to Peter and the rest of the apostles, “Brothers, what should we do?”",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "Peter said to them, “Repent—change your hearts and lives—and let each of you be baptized in the name of Jesus Christ for the forgiveness of your sins, and you will receive the gift of the Holy Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "For the promise is for you, and for your children, and for all those who are far away—as many as the Lord our God may call to himself.”",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "With many other words he continued to testify and to exhort them, saying, “Be saved from this crooked and perverse generation!”",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "So those who welcomed his message were baptized, and about three thousand souls were added that day.",
          "paragraphStart": true
        },
        {
          "verse": 42,
          "text": "They were devoting themselves to the teaching of the apostles and to the common life, to the breaking of bread and to the prayers.",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "A sense of awe came over every soul, and many wonders and signs were being performed through the apostles.",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "All who believed were together and held all things in common;",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "they would sell their possessions and property and distribute the proceeds to everyone, according to what anyone needed.",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "Every day, they continued to meet together in the temple courts with a single purpose, and breaking bread from house to house, they shared their food with gladness and sincerity of heart,",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "praising God and having the goodwill of all the people. And every day the Lord added to their number those who were being saved.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Pentecost\" (v. 1)**: The Greek *pentēkostēs* refers to the \"fiftieth\" day after Passover. To the original audience, this was the Feast of Weeks (*Shavuot*), a harvest festival that also came to be associated with the giving of the Torah at Sinai.\n\n**\"Inspired solemnity / Inspired weight\" (v. 4, 14, 40)**: The Greek *apophhtheggesthai* is more than simple speaking (*lalein*). It refers to the bold, public utterance of a prophet or a philosopher under divine influence. The translation \"inspired\" captures this specialized, elevated tone.\n\n**\"Dialect\" (v. 6, 8)**: The text uses *dialektō* rather than just *glōssa* (language). This suggests the listeners heard not just the general language, but their specific local vernaculars.\n\n**\"New, sweet wine\" (v. 13)**: *Gleukous* refers to the juice that drips from the grapes before they are pressed—a high-sugar \"must\" that ferments into a very potent, sweet wine.\n\n**\"From my Spirit\" (v. 17, 18)**: The Greek uses the partitive *apo* (\"from\" or \"of\"). This nuances the pouring out as an bestowal from the infinite source of God’s Spirit, rather than the Spirit being a finite liquid.\n\n**\"Lawless men\" (v. 23)**: *Anomōn* refers specifically to those \"without the Law\" (*Torah*), meaning the Gentiles (specifically the Romans) who carried out the execution.\n\n**\"Birth-pangs of death\" (v. 24)**: This preserves the striking Greek metaphor *ōdinas tou thanatou*. While many translations use \"pains\" or \"agony,\" the Greek term specifically refers to labor pains. This suggests that death was not an end, but a labor that could not hold the life of the Messiah.\n\n**\"Hades\" (v. 27, 31)**: The Greek *hadēs* is used here (as in the Septuagint) to translate the Hebrew *Sheol*, the place of the dead. Using \"Hades\" avoids the modern geographic or moral connotations of \"Hell.\"\n\n**\"Decay\" (v. 27, 31)**: *Diaphthoran* refers to the physical decomposition and corruption of a corpse.\n\n**\"Repent\" (v. 38)**: *Metanoēsate* implies a total \"change of mind\" or radical reorientation of one's life and direction, rather than mere regret.\n\n**\"Common life\" (v. 42)**: *Koinōnia* is often translated \"fellowship,\" but in the context of the following verses (sharing property and meals), it implies a deep, tangible communal participation.\n\n**\"Sincerity of heart\" (v. 46)**: *Aphelotēti* literally means \"smoothness\" (as in a field with the stones removed). It suggests a heart without hidden bumps or agendas—simplicity and singleness of purpose."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "Now Peter and John were going up to the temple for the three o’clock hour of prayer.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "A certain man who had been lame from his mother’s womb was being carried there; every day they would place him at the temple gate known as \"The Beautiful Gate\" so he could beg for charity from those entering the temple complex.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "When he saw Peter and John about to go into the temple, he began asking them for a gift of mercy.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Peter, along with John, looked at him with an intense, fixed gaze and said, \"Look at us!\"",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "The man fixed his attention on them, expecting to receive something from them.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But Peter said, \"I have no silver or gold, but what I do have, I give to you: In the name of Jesus Christ the Nazarene, walk!\"",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Then, taking him by the right hand, Peter raised him up. Immediately the man’s feet and ankles were made firm.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Leaping up, he stood and began to walk; then he entered the temple with them, walking and leaping and praising God.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "All the people saw him walking and praising God.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "They recognized him as the one who used to sit for charity at the Beautiful Gate of the temple, and they were filled with a sense of awe and sheer astonishment at what had happened to him.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "While the man was still clinging to Peter and John, all the people—utterly overwhelmed—ran together to them at the portico called Solomon’s.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "When Peter saw this, he addressed the people: \"Men of Israel, why are you amazed at this? Or why do you stare so intensely at us, as if by our own power or personal piety we had made him walk?",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "The God of Abraham, Isaac, and Jacob—the God of our fathers—has glorified his Servant Jesus, whom you handed over and rejected in the presence of Pilate, even though he had decided to release him.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "You rejected the Holy and Righteous One and demanded that a murderer be granted to you as a favor.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "You killed the Source and Sovereign of Life, whom God raised from the dead—of which we are witnesses.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And by faith in his name, his name itself has made this man strong, whom you see and know. Indeed, the faith that comes through Jesus has given this man this complete wholeness in the presence of you all.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "\"And now, brothers, I know that you acted in ignorance, just as your rulers did.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "But in this way, God fulfilled what he had announced beforehand through the mouth of all the prophets—that his Messiah would suffer.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Repent, therefore, and turn back to God, so that your sins may be wiped away,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "so that seasons of refreshing relief may come from the presence of the Lord, and that he may send the Messiah appointed for you, Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "He must remain in heaven until the time for the restoration of all things, which God spoke about long ago through the mouth of his holy prophets.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "\"Moses indeed said, 'The Lord your God will raise up for you a prophet like me from among your own brothers. You must listen to him in everything he says to you.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "And every soul that does not listen to that prophet will be completely cut off from the people.'",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "And all the prophets from Samuel and those who followed, as many as have spoken, also announced these days.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "You are the heirs of the prophets and of the covenant that God established with your fathers when he said to Abraham, 'And through your offspring, all the families of the earth will be blessed.'",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "When God raised up his Servant, he sent him to you first, to bless you by turning each of you away from your wicked ways.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Three o'clock hour\" (v. 1)**: The Greek text specifies the \"ninth hour.\" In the first-century Jewish reckoning of time, the day began at sunrise (roughly 6:00 AM), making the ninth hour 3:00 PM—the time of the evening sacrifice and prayer.\n\n**\"Charity\" / \"Gift of mercy\" (v. 2, 3)**: The Greek *eleēmosynē* (the root of the English word \"almoner\") refers to acts of mercy or the money given to the poor. Using \"charity\" or \"gift of mercy\" captures the religious obligation and the spirit of the act better than the more archaic \"alms.\"\n\n**\"Intense, fixed gaze\" (v. 4)**: The verb *atenizō* is a favorite of Luke’s, denoting a piercing, unwavering look. It implies more than just \"looking\"; it suggests a moment of divine or spiritual concentration.\n\n**\"The Nazarene\" (v. 6)**: The Greek *tou Nazōraiou* is a specific title. While it relates to his hometown of Nazareth, it functioned as a distinct identifier (and sometimes a slur) that Peter here reclaims as a title of power.\n\n**\"Servant\" (v. 13, 26)**: The Greek *pais* can mean \"child\" or \"servant.\" In this context, it is a deliberate allusion to the \"Servant of the Lord\" (*Ebed Yahweh*) in the Septuagint version of Isaiah (e.g., Isaiah 42, 52-53).\n\n**\"Source and Sovereign of Life\" (v. 15)**: The term *archēgos* is difficult to translate with one word. It refers to a pioneer, a founder, a chief leader, or the originator of something. He is the one who \"leads the way\" into life. \"Source and Sovereign\" attempts to capture both the creative and the ruling nuances.\n\n**\"Complete wholeness\" (v. 16)**: The Greek *holoklēria* refers to a state of being \"whole in all its parts.\" It emphasizes that the healing wasn't just functional but a total restoration of the man’s physical integrity.\n\n**\"Messiah\" (v. 18, 20)**: The Greek *christos* is the translation of the Hebrew *mashiach*. In a speech addressed to \"Men of Israel\" (v. 12) regarding the \"God of Abraham\" (v. 13), the title's Jewish meaning is primary. \"Messiah\" captures the national and theological expectations of the audience better than the transliterated \"Christ.\"\n\n**\"Wiped away\" (v. 19)**: The verb *exaleiphō* means to erase, as one would wipe ink off a papyrus or a wax tablet. The imagery is the total removal of a written record of debt or sin.\n\n**\"Refreshing relief\" (v. 20)**: The Greek *anapsyxis* literally means a \"recovery of breath\" or a \"cooling.\" It suggests a relief from heat or a respite from burdens.\n\n**\"Restoration of all things\" (v. 21)**: *Apokatastasis* is a technical term for the return of a situation to its original, intended state. In the context of Jewish prophecy, it refers to the renewal of the world and the fulfillment of God's promises to Israel.\n\n**\"Offspring\" (v. 25)**: The Greek *sperma* (seed) is singular, which Peter (and other NT authors like Paul) understood as pointing specifically to the Messiah as the representative descendant of Abraham."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "While they were still speaking to the people, the priests, the captain of the temple guard, and the Sadducees came upon them.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "They were deeply disturbed because the apostles were teaching the people and proclaiming that in the person of Jesus there is a resurrection from among the dead.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "They seized them and put them in custody until the next morning, for it was already evening.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But many of those who had heard the message believed, and the number of the men grew to about five thousand.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "The next day, the rulers, the elders, and the scholars of the Law gathered in Jerusalem,",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "including Annas the High Priest, Caiaphas, John, Alexander, and all those of the high-priestly lineage.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "They made the apostles stand in their midst and began to interrogate them: “By what kind of power or by what name did people like you do this?”",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Then Peter, filled with the Holy Spirit, said to them: “Rulers of the people and elders,",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "if we are being cross-examined today regarding a good deed done to a frail man—specifically, by what means he has been made whole—",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "let it be known to all of you and to all the people of Israel that by the name of Jesus Christ the Nazarene, whom you crucified but whom God raised from the dead—by him this man stands before you healthy.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "This Jesus is ‘the stone rejected by you builders, which has become the cornerstone.’",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "There is no salvation in anyone else, for there is no other name under heaven given among humanity by which it is necessary for us to be made whole.”",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "When they observed the outspoken confidence of Peter and John and realized that they were men untrained in letters and mere commoners, they were amazed; they also began to recognize them as having been with Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "But since they could see the man who had been healed standing right there with them, they had nothing to say in response.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "So they ordered them to step outside the Sanhedrin and began to confer with one another,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "saying, “What should we do with these men? For that a noteworthy sign has occurred through them is evident to everyone living in Jerusalem, and we cannot deny it.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "But to keep this from spreading any further among the people, let us threaten them to speak no longer to anyone on the basis of this name.”",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "After calling them back in, they commanded them absolutely not to utter a sound or teach on the basis of the name of Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "But Peter and John answered them, “Whether it is right in the sight of God to listen to you rather than to God, you must judge;",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "for we cannot stop speaking about what we have seen and heard.”",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "After threatening them further, they released them, finding no way to punish them because of the people, for everyone was glorifying God over what had happened.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "For the man on whom this sign of healing had occurred was more than forty years old.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "When they were released, they went to their own people and reported everything the chief priests and the elders had said to them.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "When the believers heard it, they raised their voices to God with one mind and said: “Sovereign Master, you are the one who made the heaven, the earth, the sea, and everything in them.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "You said by the Holy Spirit through the mouth of our father David, your servant: ‘Why did the nations rage, and the peoples plot in vain?",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "The kings of the earth took their stand, and the rulers gathered together as one against the Lord and against his Anointed.’",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "For in truth, they gathered together in this city against your holy servant Jesus, whom you anointed—both Herod and Pontius Pilate, along with the Gentiles and the peoples of Israel—",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "to do whatever your hand and your purpose had predestined to happen.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "And now, Lord, look upon their threats and grant your bondservants the ability to speak your word with all outspoken confidence,",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "while you stretch out your hand for healing, and signs and wonders take place through the name of your holy servant Jesus.”",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "When they had prayed, the place where they were gathered was shaken, and they were all filled with the Holy Spirit and began to speak the word of God with outspoken confidence.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "Now the entire group of those who believed were of one heart and soul, and not even one person claimed that any of his possessions was his own, but they held everything in common.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "With great power the apostles continued to give their testimony to the resurrection of the Lord Jesus, and great grace was upon them all.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "There was not a single needy person among them, for as many as were owners of lands or houses would sell them, bring the proceeds of the sales,",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "and lay them at the feet of the apostles. It was then distributed to each according to their need.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "Joseph, whom the apostles called Barnabas (which means “Son of Encouragement”), a Levite and a Cypriot by birth,",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "sold a field that belonged to him, brought the money, and laid it at the feet of the apostles.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Deeply disturbed\" (v. 2)**: The Greek *diaponoumenoi* suggests a mixture of being pained, annoyed, and intensely worked up. It captures the visceral frustration of the Sadducees, who specifically rejected the doctrine of the resurrection.\n\n**\"Made whole / Salvation\" (v. 9, 12)**: The Greek verb *sōzō* and noun *sōtēria* carry a dual sense of physical healing/rescue and spiritual salvation. By using \"made whole\" in verse 9 (referring to the lame man) and verse 12 (referring to the human condition), the translation preserves the wordplay and the theological argument Peter is making: the physical healing is a sign of the greater restoration available only through Jesus.\n\n**\"Untrained in letters and mere commoners\" (v. 13)**: *Agrammatoi* means they lacked formal rabbinic education; *idiōtai* refers to those who are \"private\" or \"lay\" people—not professionals or specialists. \"Commoners\" captures the social stigma intended by the Sanhedrin.\n\n**\"Outspoken confidence\" (v. 13, 29, 31)**: *Parrēsia* is a key term in Acts. It refers to the democratic ideal of \"free speech\" or \"boldness,\" specifically the courage to speak the truth plainly in the face of intimidating power. \n\n**\"Sovereign Master\" (v. 24)**: *Despota* (from which we get \"despot\") refers to a master with absolute authority. In this context of political persecution, the believers appeal to the one whose power overrules the \"rulers of the earth.\"\n\n**\"Servant\" (v. 25, 27, 30)**: The Greek *pais* can mean \"child\" or \"servant.\" In these verses, it alludes to the \"Servant of the Lord\" from the Septuagint’s version of Isaiah (the *Ebed Adonai*), a messianic figure who suffers and is vindicated.\n\n**\"Son of Encouragement\" (v. 36)**: *Paraklēsis* is difficult to translate with one word, as it encompasses comfort, exhortation, and encouragement. \"Encouragement\" is the most common fit for Barnabas’s character throughout Acts."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "But a certain man named Ananias, together with his wife Sapphira, sold a piece of property.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "With his wife’s full knowledge, he secretly misappropriated some of the proceeds for himself; he brought only a portion of the money and laid it at the feet of the apostles.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "But Peter said, “Ananias, why has Satan filled your heart to lie to the Holy Spirit and to secretly misappropriate some of the proceeds from the land?",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "While it remained unsold, did it not remain your own? And after it was sold, was the money not under your own authority? Why is it that you conceived this deed in your heart? You have not lied to mere men, but to God.”",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "As Ananias heard these words, he fell down and breathed his last. And a great fear came upon all who heard of it.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "The younger men stood up, wrapped him in burial cloths, carried him out, and buried him.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Now an interval of about three hours passed, and his wife came in, unaware of what had happened.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Peter addressed her: “Tell me, did you sell the land for this amount?” She said, “Yes, for that amount.”",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Then Peter said to her, “Why is it that you agreed together to put the Spirit of the Lord to the test? Look! The feet of those who buried your husband are at the door, and they will carry you out as well.”",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Instantly, she fell at his feet and breathed her last. When the young men entered, they found her dead; they carried her out and buried her beside her husband.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And a great fear came upon the whole assembly and upon all who heard these things.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Now many signs and wonders were happening among the people through the hands of the apostles. They were all together with one mind in Solomon’s Portico.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "None of the rest dared to join themselves to them, yet the people held them in high regard.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Furthermore, believers were being added to the Lord in increasing numbers—multitudes of both men and women—",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "so that they even carried the sick out into the main streets and laid them on cots and sleeping mats, so that as Peter passed by, at least his shadow might fall on some of them.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "The multitude from the towns surrounding Jerusalem also gathered, bringing the sick and those tormented by unclean spirits, and every one of them was healed.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "But the high priest and all his associates—that is, the sect of the Sadducees—rose up, filled with jealous indignation.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "They arrested the apostles and put them in the public jail.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "But during the night, an angel of the Lord opened the doors of the prison, led them out, and said,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "“Go, stand in the temple courts and continue speaking to the people all the words of this Life.”",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Having heard this, they entered the temple courts at daybreak and began to teach. Now when the high priest and his associates arrived, they summoned the Sanhedrin—the entire Senate of the sons of Israel—and sent word to the prison for the apostles to be brought.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But when the officers arrived, they did not find them in the prison; so they returned and reported,",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "“We found the prison locked with all security and the guards standing at the doors, but when we opened them, we found no one inside.”",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "When the captain of the temple guard and the chief priests heard these words, they were utterly at a loss concerning them, wondering what this would come to.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Then someone arrived and reported to them, “Look! The men you put in prison are standing in the temple courts and teaching the people!”",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Then the captain went with the officers and brought them back—though not by force, for they were afraid of being stoned by the people.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Having brought them, they stood them before the Sanhedrin. The high priest questioned them,",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "saying, “We gave you strict orders not to teach in this name, yet look—you have filled Jerusalem with your teaching and you intend to bring this man’s blood upon us.”",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "But Peter and the apostles answered, “It is necessary to obey God as the ultimate authority rather than men.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "The God of our fathers raised Jesus, whom you disposed of by hanging him on a tree.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "God exalted this man to his right hand as Pioneer-Leader and Savior, to give repentance to Israel and forgiveness of sins.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "And we are witnesses of these matters, as is the Holy Spirit, whom God has given to those who obey him as their leader.”",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "When they heard this, they were sawn with rage and wanted to execute them.",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "But a certain Pharisee in the Sanhedrin named Gamaliel, a teacher of the law honored by all the people, stood up and ordered that the men be put outside for a short time.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "He said to them, “Men of Israel, take care regarding what you are about to do to these men.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "For some time ago Theudas rose up, claiming to be somebody, and a number of men, about four hundred, joined him. He was killed, and all who were persuaded by him were dispersed and came to nothing.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "After him, Judas the Galilean rose up in the days of the census and drew people away after him. He also perished, and all who were persuaded by him were scattered.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "So in the present case, I tell you: keep away from these men and let them alone. For if this plan or this work is of human origin, it will be overthrown;",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "but if it is from God, you will not be able to overthrow them—you might even be found to be warring against God.” They were persuaded by him.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "After calling the apostles in and flogging them, they ordered them not to speak in the name of Jesus and released them.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "So they went out from the presence of the Sanhedrin, rejoicing that they had been considered worthy to be dishonored for the sake of the Name.",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "And every day, in the temple courts and from house to house, they did not cease teaching and proclaiming the good news that Jesus is the Anointed One.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Secretly misappropriated\" (v. 2, 3)**: The Greek *enosphisato* carries the sense of siphoning off or embezzling funds for oneself. Significantly, this is the same word used in the Septuagint (Joshua 7:1) to describe Achan’s theft of the \"devoted things.\" For an audience steeped in the Hebrew scriptures, this would immediately signal that Ananias’s sin was a violation of the community's holiness, mirroring the sin that brought judgment upon early Israel.\n\n**\"Breathed his last\" (v. 5, 10)**: The Greek *exepsyxen* is a specific term for expiring or \"giving up the ghost.\" It evokes a sense of sudden, divine judicial intervention rather than a natural medical collapse.\n\n**\"Assembly\" (v. 11)**: *Ekklēsia* is often translated \"church,\" but in this early context, it retains the sense of the \"assembly\" of Israel. This is the first time the word appears in the book of Acts.\n\n**\"Sect\" (v. 17)**: *Hairesis* refers to a school of thought or a faction within a larger religion. While it is the root of the English \"heresy,\" here it describes the Sadducees as a distinct party or \"denomination\" within Judaism.\n\n**\"The words of this Life\" (v. 20)**: This is a Semitic idiom. \"This Life\" refers to the new era of resurrection life inaugurated by Jesus. It is not just \"lifestyle,\" but the reality of the Messianic age.\n\n**\"Obey God as the ultimate authority\" (v. 29, 32)**: The verb *peitharchein* specifically means to obey a ruler or an authority. It is more specific than the general word for \"obey\" (*hypakouō*). It emphasizes a conflict of jurisdictions—the apostles are choosing the higher government (God) over the lower one (the Sanhedrin).\n\n**\"Hanging him on a tree\" (v. 30)**: The use of *xylou* (wood/tree) instead of \"cross\" is a deliberate allusion to Deuteronomy 21:22-23. To a Jewish audience, this emphasized the \"curse\" associated with the manner of Jesus's death, which Peter then contrasts with God’s exaltation of him.\n\n**\"Pioneer-Leader\" (v. 31)**: *Archēgos* means a founder, a pathfinder, or a prince who leads the way. It implies Jesus is the one who opens the path to salvation for others to follow.\n\n**\"Sawn with rage\" (v. 33)**: The Greek *dieprionto* literally means \"they were sawn through.\" Most translations use \"cut to the heart,\" but the Greek describes a much more violent, visceral agitation than the \"piercing\" of the heart found in Acts 2:37. It is the friction of extreme internal fury.\n\n**\"Warring against God\" (v. 39)**: The Greek *theomachoi* is a powerful compound word. In Greek literature (like Euripides’ *Bacchae*), a *theomachos* is someone who foolishly attempts to fight against the inescapable will of a god. Gamaliel is warning the council of the cosmic danger of their actions.\n\n**\"The Anointed One\" (v. 42)**: The Greek *ton christon Iēsoun* is translated here with the meaning of the title \"Christ\" (Messiah). The apostles were not just teaching \"Jesus Christ\" as a name, but were proclaiming the core claim that Jesus is indeed the promised Messiah."
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "During those days, as the disciples were increasing in number, a complaint broke out among the Greek-speaking Jews against the local Aramaic-speaking Jews, because their widows were being overlooked in the daily distribution of food.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "So the Twelve summoned the whole assembly of the disciples and said, \"It is not right for us to neglect the message of God in order to serve at tables.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Therefore, brothers, look for seven men from among yourselves who are well-regarded, full of the Spirit and wisdom, whom we will appoint to this responsibility.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But we will devote ourselves to prayer and to the service of the message.\"",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "This proposal was pleasing to the entire assembly. They chose Stephen, a man full of faith and the Holy Spirit, along with Philip, Prochorus, Nicanor, Timon, Parmenas, and Nicolaus, a convert to Judaism from Antioch.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "They presented these men to the apostles, who prayed and laid their hands on them.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And so the message of God continued to spread. The number of disciples in Jerusalem increased dramatically, and a large crowd of priests began to obey the faith.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Now Stephen, full of grace and power, was performing great wonders and signs among the people.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "However, resistance arose from some members of the \"Synagogue of the Freedmen\" (as it was called)—comprised of Cyrenians, Alexandrians, and those from Cilicia and Asia. They began debating with Stephen,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "but they were not strong enough to withstand the wisdom and the Spirit by which he spoke.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then they secretly instigated men to say, \"We heard him speaking blasphemous words against Moses and against God.\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "They stirred up the people, the elders, and the scholars of the Law; they confronted Stephen, seized him, and brought him before the High Council.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "They put forward false witnesses who said, \"This man never stops speaking against this holy place and the Law.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "For we have heard him saying that this Jesus the Nazarene will destroy this place and will change the customs that Moses handed down to us.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "As everyone sitting in the Council stared intently at Stephen, they saw that his face looked like the face of an angel.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Greek-speaking Jews / Aramaic-speaking Jews\" (v. 1)**: The Greek terms *Hellēnistōn* and *Hebraious* refer to a cultural and linguistic division within the early Jewish-Christian community. The \"Hellenists\" were Jews from the Diaspora who spoke Greek and adopted more Greek customs, while the \"Hebrews\" were local Judean Jews who spoke Aramaic (the \"Hebrew\" language of the period) and were more culturally traditional.\n\n**\"Distribution of food / Service\" (v. 1, 2, 4)**: The Greek *diakonia* (noun) and *diakonein* (verb) refer to practical service. While often translated as \"ministry,\" it carries the concrete sense of \"waiting on tables\" or \"distributing resources.\" The author uses the same root for both the food distribution (v. 1) and the \"service of the message\" (v. 4), suggesting that both are vital forms of service, though the apostles must prioritize the latter.\n\n**\"Message of God\" (v. 2, 4, 7)**: The Greek *logos* is often translated as \"Word,\" but in the context of Acts, it specifically refers to the proclamation or the \"message\" concerning Jesus and the Kingdom of God.\n\n**\"Responsibility\" (v. 3)**: The Greek *chreias* literally means \"need\" or \"necessity,\" but in this administrative context, it refers to the \"task,\" \"duty,\" or \"office\" created to meet that need.\n\n**\"Convert to Judaism\" (v. 5)**: The Greek *prosēlyton* refers to a Gentile who had undergone full conversion to Judaism, including circumcision and the keeping of the Law.\n\n**\"Synagogue of the Freedmen\" (v. 9)**: *Libertinōn* refers to \"Freedmen\"—former slaves (or their descendants) who had been granted Roman liberty. Many Jews had been taken to Rome as captives in previous decades and later returned to Jerusalem.\n\n**\"Scholars of the Law\" (v. 12)**: The *grammateis* (traditionally \"scribes\") were the professional class of experts in the interpretation and teaching of the Torah.\n\n**\"High Council\" (v. 12, 15)**: The *synedrion* (Sanhedrin) was the supreme judicial and religious legal body in Jerusalem.\n\n**\"Face of an angel\" (v. 15)**: This description evokes the \"shining face\" of Moses after encountering God on Sinai (Exodus 34). The author intends to show that while Stephen is accused of speaking against Moses, he actually reflects the same divine glory that Moses did."
    },
    {
      "chapter": 7,
      "verses": [
        {
          "verse": 1,
          "text": "Then the high priest asked, “Is this the case?”",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Stephen replied: “Brothers and fathers, listen to me. The God of glory appeared to our father Abraham while he was still in Mesopotamia, before he settled in Haran,",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "and said to him, ‘Leave your land and your relatives, and come to the land that I will show you.’",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "So he left the land of the Chaldeans and settled in Haran. From there, after his father died, God moved him into this land where you are now living.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Yet he gave him no inheritance in it, not even a foot’s breadth of ground. Instead, he promised to give it to him as a possession, and to his offspring after him, even though Abraham had no child at the time.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "God spoke in this way: ‘His descendants will be strangers in a foreign land, and they will be enslaved and mistreated for four hundred years.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "But I will judge the nation they serve as slaves,’ said God, ‘and after these things they will come out and they will worship me in this place.’",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Then God gave him the covenant of circumcision; and so Abraham became the father of Isaac and circumcised him on the eighth day, and Isaac became the father of Jacob, and Jacob the father of the twelve patriarchs.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "“The patriarchs, becoming jealous of Joseph, sold him into Egypt. But God was with him",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "and rescued him out of all his afflictions. He granted him favor and wisdom in the presence of Pharaoh, king of Egypt, who appointed him governor over Egypt and over his entire household.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then a famine came over all Egypt and Canaan, causing great suffering, and our ancestors could find no food.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "But when Jacob heard there was grain in Egypt, he sent our ancestors there on their first visit.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "On the second visit, Joseph made himself known to his brothers, and Joseph’s family background became clear to Pharaoh.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Then Joseph sent for his father Jacob and all his relatives, seventy-five people in all.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "So Jacob went down to Egypt. There he died, as did our ancestors.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Their bodies were brought back to Shechem and laid in the tomb that Abraham had bought for a sum of silver from the sons of Hamor in Shechem.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "“As the time drew near for the promise God had sworn to Abraham, the people grew and multiplied in Egypt,",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "until another king arose over Egypt who knew nothing of Joseph.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "He exploited our people with cunning and mistreated our ancestors, forcing them to abandon their infants so they would not survive.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "It was at this time that Moses was born, and he was remarkably beautiful in the sight of God. For three months he was nurtured in his father’s house;",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "and when he was abandoned, the daughter of Pharaoh took him up and raised him as her own son.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "So Moses was educated in all the wisdom of the Egyptians and was powerful in his words and his deeds.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "“When he was forty years old, it entered his heart to visit his brothers, the sons of Israel.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Seeing one of them being mistreated, he defended him and avenged the man who was being oppressed by striking down the Egyptian.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "He assumed his brothers would understand that God was granting them deliverance through his hand, but they did not understand.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "The next day he appeared to them as they were fighting and tried to reconcile them in peace, saying, ‘Men, you are brothers; why are you mistreating one another?’",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "But the man who was mistreating his neighbor pushed Moses away, saying, ‘Who appointed you a ruler and a judge over us?",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Do you want to kill me the way you killed the Egyptian yesterday?’",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "At this remark, Moses fled and became a stranger in the land of Midian, where he became the father of two sons.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "“When forty years had passed, an angel appeared to him in the wilderness of Mount Sinai in the flame of a burning bush.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "When Moses saw it, he was amazed at the sight. As he approached to look more closely, the voice of the Lord came:",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "‘I am the God of your fathers—the God of Abraham, Isaac, and Jacob.’ Moses began to tremble with fear and did not dare to look.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "The Lord said to him, ‘Take the sandals off your feet, for the place where you are standing is holy ground.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "I have surely seen the mistreatment of my people in Egypt and have heard their groaning, and I have come down to rescue them. Now come, I will send you to Egypt.’",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "“This Moses, whom they rejected by saying, ‘Who appointed you a ruler and a judge?’—this very man God sent as both ruler and liberator by the hand of the angel who appeared to him in the bush.",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "This man led them out, performing wonders and signs in the land of Egypt, at the Red Sea, and in the wilderness for forty years.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "This is the Moses who said to the sons of Israel, ‘God will raise up for you a prophet like me from among your brothers.’",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "This is the one who was in the assembly in the wilderness with the angel who spoke to him on Mount Sinai and with our ancestors; he received living utterances to give to us.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "“Our ancestors were unwilling to be obedient to him; instead, they pushed him aside and in their hearts they turned back to Egypt,",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "saying to Aaron, ‘Make gods for us who will go before us. As for this Moses who led us out of the land of Egypt, we do not know what has happened to him.’",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "They made a calf in those days and offered a sacrifice to the idol, and they began to celebrate the works of their own hands.",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "But God turned away and gave them over to worship the host of heaven, just as it is written in the book of the prophets: ‘Did you bring me slain beasts and sacrifices for forty years in the wilderness, O house of Israel?",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "No, you took up the tent of Moloch and the star of your god Rephan, the images you made to worship. Therefore, I will deport you beyond Babylon.’",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "“Our ancestors had the tent of the testimony in the wilderness, just as the one speaking to Moses directed him to make it according to the pattern he had seen.",
          "paragraphStart": true
        },
        {
          "verse": 45,
          "text": "Our ancestors in turn received it and brought it in with Joshua when they took possession of the nations that God drove out before our ancestors. It remained until the days of David,",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "who found favor in the sight of God and asked to find a dwelling place for the God of Jacob.",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "But it was Solomon who built a house for him.",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "However, the Most High does not dwell in handmade structures, as the prophet says:",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "‘Heaven is my throne, and the earth is a footstool for my feet. What kind of house will you build for me, says the Lord, or what is the place of my rest?",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "Did not my hand make all these things?’",
          "paragraphStart": false
        },
        {
          "verse": 51,
          "text": "“You stiff-necked people, uncircumcised in hearts and ears! You are always resisting the Holy Spirit. As your ancestors did, so do you.",
          "paragraphStart": true
        },
        {
          "verse": 52,
          "text": "Which of the prophets did your ancestors not persecute? They even killed those who announced in advance the coming of the Righteous One, whose betrayers and murderers you have now become—",
          "paragraphStart": false
        },
        {
          "verse": 53,
          "text": "you who received the law as ordained by angels, yet did not keep it.”",
          "paragraphStart": false
        },
        {
          "verse": 54,
          "text": "When they heard these things, they were cut to the quick and began gnashing their teeth at him.",
          "paragraphStart": true
        },
        {
          "verse": 55,
          "text": "But Stephen, full of the Holy Spirit, gazed into heaven and saw the glory of God, and Jesus standing at the right hand of God.",
          "paragraphStart": false
        },
        {
          "verse": 56,
          "text": "He said, “Look! I see the heavens opened and the Son of Man standing at the right hand of God.”",
          "paragraphStart": false
        },
        {
          "verse": 57,
          "text": "But they let out a loud cry, covered their ears, and rushed at him with one purpose.",
          "paragraphStart": false
        },
        {
          "verse": 58,
          "text": "They dragged him out of the city and began to stone him. The witnesses laid their coats at the feet of a young man named Saul.",
          "paragraphStart": false
        },
        {
          "verse": 59,
          "text": "As they were stoning him, Stephen called out, “Lord Jesus, receive my spirit.”",
          "paragraphStart": false
        },
        {
          "verse": 60,
          "text": "Then falling to his knees, he cried out with a loud voice, “Lord, do not hold this sin against them.” And after saying this, he fell asleep.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"God of glory\" (v. 2)**: This title (Ps 29:3) emphasizes God's majesty and presence outside the Temple, a key theme in Stephen's defense.\n\n**\"Remarkably beautiful in the sight of God\" (v. 20)**: The Greek *asteios tō theō* is often translated \"beautiful before God\" or \"fair to God.\" In Koine Greek, this dative construction serves as a superlative, suggesting Moses possessed a divine or extraordinary beauty/favor from birth.\n\n**\"Liberator\" (v. 35)**: The Greek *lytrōtēn* is often rendered \"redeemer,\" but in this context—contrasted with \"ruler and judge\"—it emphasizes Moses's role as the one who effected the physical and political liberation of Israel from Egypt.\n\n**\"Living utterances\" (v. 38)**: *logia zōnta* refers to the commands of God. \"Utterances\" captures the sense of spoken oracles that carry the vital, active power of God, rather than static \"words.\"\n\n**\"Handmade structures\" (v. 48)**: *cheiropoiētois* is a loaded term. In the Septuagint, it almost exclusively refers to idols (\"things made with hands\"). By applying it to the Temple, Stephen makes a provocative connection between the Judean fixation on the Temple building and the idolatry of their ancestors.\n\n**\"Cut to the quick\" (v. 54)**: The verb *dieprionto* literally means \"to be sawn through.\" It describes a visceral, agonizing emotional reaction—somewhere between extreme conviction and murderous rage.\n\n**\"Fell asleep\" (v. 60)**: *ekoimēthē* is the standard New Testament euphemism for the death of a believer, emphasizing the hope of resurrection. It stands in stark contrast to the violence of the preceding scene."
    },
    {
      "chapter": 8,
      "verses": [
        {
          "verse": 1,
          "text": "Saul was in full agreement with his execution. On that day, a severe persecution broke out against the church in Jerusalem, and everyone was scattered throughout the regions of Judea and Samaria, except for the apostles.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Devout men buried Stephen and raised a great lamentation over him.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Saul, however, began ravaging the church; entering house after house, he dragged off both men and women and handed them over to prison.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Now those who had been scattered went from place to place proclaiming the good news of the Word.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "Philip went down to a city in Samaria and began proclaiming the Messiah to them.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "The crowds with one mind paid close attention to what Philip said when they heard him and saw the signs he was performing.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For many who had unclean spirits were being delivered as the spirits came out shrieking with a loud voice; many who were paralyzed or lame were also healed.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "So there was great joy in that city.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Now a man named Simon had previously been practicing sorcery in the city and astounded the people of Samaria, claiming to be someone great.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Everyone, from the least to the greatest, paid close attention to him, saying, \"This man is the Power of God that is called 'The Great One'.\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "They paid attention to him because he had astounded them for a long time with his magical arts.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "But when they believed Philip as he proclaimed the good news about the kingdom of God and the name of Jesus Christ, they were baptized, both men and women.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Even Simon himself believed, and after being baptized, he stayed close to Philip. He was astounded as he watched the great signs and works of power taking place.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "When the apostles in Jerusalem heard that Samaria had welcomed the word of God, they sent Peter and John to them.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "When they arrived, they prayed for them so that they might receive the Holy Spirit,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "for the Spirit had not yet fallen upon any of them; they had only been baptized into the name of the Lord Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Then Peter and John laid their hands on them, and they received the Holy Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "When Simon saw that the Spirit was given through the laying on of the apostles' hands, he offered them money,",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "saying, \"Give me this authority as well, so that anyone on whom I lay my hands may receive the Holy Spirit.\"",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "But Peter said to him, \"May your silver perish with you, because you thought you could acquire the gift of God with money!",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "You have no part or portion in this matter, for your heart is not straight before God.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Repent, therefore, of this wickedness of yours, and pray to the Lord that, if possible, the intent of your heart may be forgiven you.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "For I see that you are in the gall of bitterness and the chains of wickedness.\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Simon answered, \"Pray to the Lord for me yourselves, so that nothing of what you have said may happen to me.\"",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "So, after they had offered their testimony and spoken the word of the Lord, they started back toward Jerusalem, proclaiming the good news to many Samaritan villages along the way.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "Now an angel of the Lord spoke to Philip, saying, \"Get up and go toward the south on the road that goes down from Jerusalem to Gaza.\" (This is a desert road.)",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "So he got up and went. And look! There was an Ethiopian man, a eunuch and high official of Kandake, queen of the Ethiopians, who was in charge of her entire treasury. He had come to Jerusalem to worship",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "and was returning home. Sitting in his chariot, he was reading the prophet Isaiah.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "The Spirit said to Philip, \"Go over and join that chariot.\"",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Philip ran up and heard him reading Isaiah the prophet and asked, \"Do you actually understand what you are reading?\"",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "He said, \"How could I, unless someone guides me?\" And he invited Philip to come up and sit with him.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "Now the passage of Scripture he was reading was this: \"He was led like a sheep to the slaughter, and as a lamb before its shearer is silent, so he does not open his mouth.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "In his humiliation, justice was denied him. Who can describe his generation? For his life is taken away from the earth.\"",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "The eunuch said to Philip, \"Please tell me, who is the prophet talking about? Himself, or someone else?\"",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "Then Philip opened his mouth, and starting from this Scripture, he proclaimed the good news of Jesus to him.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "As they were traveling along the road, they came to some water, and the eunuch said, \"Look, here is water! What prevents me from being baptized?\"",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "He ordered the chariot to stop, and both of them, Philip and the eunuch, went down into the water, and Philip baptized him.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "When they came up out of the water, the Spirit of the Lord snatched Philip away, and the eunuch saw him no longer, but went on his way rejoicing.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "Philip found himself at Azotus, and as he passed through, he proclaimed the good news to all the towns until he reached Caesarea.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Execution\" (v. 1)**: The Greek *anairesei* suggests a \"removal\" or a \"putting away,\" used here in the context of the judicial or extrajudicial killing of Stephen.\n\n**\"Ravaging\" (v. 3)**: *Elymaineto* is a strong verb often used in Greek literature to describe a wild animal mangling its prey or an army devastating a city. It conveys the brutal, systematic nature of Saul’s campaign.\n\n**\"The Power of God... 'The Great One'\" (v. 10)**: This reflects a specific title. In the religious atmosphere of the first century, particularly in Samaria, \"The Great Power\" (*He Dynamis he Megale*) was understood as a name for a divine emanation or the supreme deity itself. \n\n**\"Astounded\" (vv. 9, 11, 13)**: The Greek *existēmi* is used as a deliberate literary thread. Simon \"astounded\" the Samaritans with magic, but then Simon himself is \"astounded\" by the actual power of God through Philip.\n\n**\"Gift of God\" (v. 20)**: *Dōrean* emphasizes that the Spirit is a free, unmerited favor, making Simon’s attempt to \"purchase\" it a fundamental category error.\n\n**\"Gall of bitterness\" (v. 23)**: *Cholen pikrias* refers to the bile of a venomous animal. To the original audience, this would signify a state of being \"poisoned\" by envy or resentment.\n\n**\"Kandake\" (v. 27)**: This is not a personal name but a dynastic title (like \"Pharaoh\" or \"Caesar\") for the Queen Mother of the Kingdom of Kush (ancient Ethiopia/Nubia).\n\n**\"Do you actually understand...\" (v. 30)**: There is a famous wordplay in the Greek (*ginōskeis ha anaginōskeis*) that is difficult to replicate in English. Literally: \"Do you know what you are re-knowing?\"\n\n**\"In his humiliation, justice was denied him\" (v. 33)**: This follows the Septuagint (LXX) rendering of Isaiah 53, which differs from the Masoretic Text. The focus here is on the legal injustice and the stripping away of the sufferer's rights during his trial.\n\n**\"What prevents me...\" (v. 36)**: This phrasing likely reflects an early baptismal formula or liturgical practice where the candidate’s fitness was questioned before the rite. Note that verse 37 is omitted, as it is absent from the earliest and most reliable manuscripts (P45, P74, Sinaiticus, Vaticanus).\n\n**\"Snatched away\" (v. 39)**: *Hērpasen* implies a sudden, forceful removal. It is the same verb used for being \"caught up\" in 1 Thessalonians 4:17."
    },
    {
      "chapter": 9,
      "verses": [
        {
          "verse": 1,
          "text": "Meanwhile Saul, still inhaling the breath of threats and murder against the disciples of the Lord, went to the high priest",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "and requested letters from him to the synagogues in Damascus. His purpose was that if he found any who belonged to the Way—whether men or women—he might bring them bound to Jerusalem.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "As he was traveling, it happened that he was drawing near to Damascus when suddenly a light from heaven flashed around him.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "He fell to the ground and heard a voice saying to him, “Saoul, Saoul, why are you persecuting me?”",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "He asked, “Who are you, Lord?” And the voice replied, “I am Jesus, whom you are persecuting.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But get up and enter the city, and you will be told what you must do.”",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "The men traveling with him stood speechless; they heard the sound of the voice but saw no one.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Saul got up from the ground, but though his eyes were wide open, he could see nothing. So they led him by the hand and brought him into Damascus.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For three days he was without sight, and he neither ate nor drank.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Now there was a certain disciple in Damascus named Ananias. The Lord said to him in a vision, “Ananias.” He replied, “Here I am, Lord.”",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "The Lord said to him, “Get up and go to the street called ‘Straight,’ and at the house of Judas look for a man from Tarsus named Saul. For behold, he is praying,",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "and in a vision he has seen a man named Ananias come in and lay hands on him so that he might regain his sight.”",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "But Ananias answered, “Lord, I have heard from many about this man, and how much harm he has done to your holy ones in Jerusalem.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "And here he has authority from the chief priests to bind everyone who calls upon your name.”",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "But the Lord said to him, “Go, for this man is an instrument of my choosing, to carry my name before the nations and their kings, and before the sons of Israel.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For I myself will show him how much he must suffer for the sake of my name.”",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "So Ananias departed and entered the house. He laid his hands on him and said, “Saoul, my brother, the Lord—Jesus, who appeared to you on the road as you were coming—has sent me so that you may regain your sight and be filled with the Holy Spirit.”",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Immediately, something like husks fell from his eyes and his sight was restored. He got up and was baptized,",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "and after taking food, his strength returned. He remained for some days with the disciples in Damascus,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "and immediately in the synagogues he began proclaiming Jesus, saying, “This man is the Son of God.”",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "All who heard him were astonished and said, “Is this not the man who ravaged those in Jerusalem who call upon this name? And hasn't he come here for this very purpose—to bring them bound before the chief priests?”",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But Saul grew even more capable, and he confounded the Jews living in Damascus by demonstrating conclusively that this man is the Messiah.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "When many days had passed, the Jews plotted together to do away with him,",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "but their plot became known to Saul. They were even guarding the city gates day and night in order to kill him.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "But his disciples took him by night and let him down through an opening in the wall, lowering him in a large wicker basket.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "When he arrived in Jerusalem, he attempted to join the disciples, but they were all afraid of him, not believing that he was truly a disciple.",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "But Barnabas took hold of him and brought him to the apostles. He described to them how Saul had seen the Lord on the road and that the Lord had spoken to him, and how in Damascus he had spoken boldly in the name of Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "So Saul moved freely with them in Jerusalem, speaking boldly in the name of the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "He was speaking and debating with the Hellenists, but they were attempting to do away with him.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "When the brothers learned of this, they brought him down to Caesarea and sent him off to Tarsus.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "So the church throughout all Judea and Galilee and Samaria enjoyed a season of peace and was being built up. Walking in the fear of the Lord and in the encouragement of the Holy Spirit, it continued to multiply.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "Now as Peter was traveling through all those regions, he also went down to the holy ones living in Lydda.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "There he found a man named Aeneas who had been bedridden for eight years; he was paralyzed.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Peter said to him, “Aeneas, Jesus the Messiah heals you. Get up and make your own bed.” And immediately he stood up.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "All those living in Lydda and the Plain of Sharon saw him, and they turned to the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "In Joppa there was a certain disciple named Tabitha (which is translated as Dorcas, or \"Gazelle\"). She was devoted to doing good works and giving to the poor.",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "During those days she became ill and died. When they had washed her body, they laid her in an upstairs room.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "Since Lydda was near Joppa, the disciples heard that Peter was there and sent two men to him, urging him, “Please come to us without delay.”",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "So Peter got up and went with them. When he arrived, they took him to the upstairs room. All the widows stood beside him weeping, showing him the tunics and cloaks that Dorcas used to make while she was still with them.",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "Peter sent everyone outside, knelt down, and prayed. Then, turning toward the body, he said, “Tabitha, get up.” She opened her eyes, and when she saw Peter, she sat up.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "Giving her his hand, he helped her stand. Then he called the holy ones and the widows and presented her to them alive.",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "This became known throughout all Joppa, and many believed in the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "And it happened that Peter stayed in Joppa for quite some time with a certain Simon, a tanner.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Inhaling the breath of...\" (v. 1)**: The Greek *empneōn* suggests that Saul was \"breathing in\" or \"breathing the air of\" threats and murder. It implies an internal state where violence has become his very atmosphere.\n\n**\"The Way\" (v. 2)**: This was the earliest self-designation of the Jesus movement, likely rooted in the \"Way of the Lord\" from Isaiah (and the LXX).\n\n**\"Saoul\" (v. 4, 17)**: The Greek text switches from the Hellenized \"Saulos\" to the Semitic \"Saoul\" in the direct address. This preserves the Aramaic name sound (*Sha’ul*) that Saul would have heard in the vision and that Ananias used when speaking to him as a fellow Jew.\n\n**\"Holy ones\" (v. 13, 32, 41)**: The Greek *hagioi* (often \"saints\") refers to those set apart for God. \"Holy ones\" captures the communal and covenantal identity of the early believers better than the modern ecclesiastical \"saints.\"\n\n**\"Instrument of my choosing\" (v. 15)**: Literally \"a vessel of choice\" (*skeuos eklogēs*). In the Hebrew/Aramaic idiom, \"vessel\" refers to a person used for a specific purpose by God.\n\n**\"The Messiah\" (v. 22, 34)**: While *Christos* is often treated as a proper name (\"Christ\"), in these contexts—debating in synagogues and healing among Jews—it functions as a title referring to the expected Davidic Deliverer.\n\n**\"Large wicker basket\" (v. 25)**: The word *spuris* refers specifically to a large, flexible hamper (different from the *kophinos* used in the feeding of the 5,000).\n\n**\"Hellenists\" (v. 29)**: These were Greek-speaking Jews, often from the Diaspora. Their conflict with Saul is significant because he was one of them.\n\n**\"Make your own bed\" (v. 34)**: The Greek *strōson seautō* literally means \"spread for yourself.\" It is an idiom for making one's bed or preparing a couch, signifying a complete and immediate recovery from paralysis.\n\n**\"Tabitha / Dorcas\" (v. 36)**: Luke provides both the Aramaic name (*Tabitha*) and the Greek translation (*Dorkas*). Both mean \"Gazelle.\" Keeping both emphasizes the bilingual, multicultural setting of the early church.\n\n**\"Tanner\" (v. 43)**: This is a socially significant detail. Tanners dealt with dead animals and were often considered ceremonially unclean or socially marginalized. Peter staying with a tanner hints at his growing openness to breaking traditional purity boundaries, which culminates in the next chapter."
    },
    {
      "chapter": 10,
      "verses": [
        {
          "verse": 1,
          "text": "In Caesarea there was a man named Cornelius, a centurion in what was known as the Italian Cohort.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He was a devout man, a \"God-fearer\" along with his entire household; he performed many acts of charity for the Jewish people and was constant in his prayer to God.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "One afternoon, about the ninth hour, he had a vision in which he clearly saw a messenger of God enter and say to him, “Cornelius.”",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "He stared at the messenger in terror and asked, “What is it, lord?” The messenger replied, “Your prayers and your acts of charity have ascended as a memorial offering before God.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "Now, send men to Joppa and summon a man named Simon, who is also called Peter.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "He is staying as a guest with another Simon, a tanner, whose house is by the sea.”",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "When the messenger who had spoken to him departed, Cornelius called two of his household servants and a devout soldier from among his personal attendants.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "After explaining everything to them, he sent them to Joppa.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "The next day, as they were traveling and approaching the city, Peter went up on the flat roof of the house to pray around the sixth hour.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "He became quite hungry and wanted to eat, but while the meal was being prepared, he fell into a trance.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "He saw the sky opened and something like a large linen sheet coming down, being lowered by its four corners to the earth.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "In it were all kinds of four-footed animals, crawling creatures of the earth, and birds of the sky.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then a voice came to him: “Get up, Peter; slaughter and eat!”",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "But Peter said, “By no means, Lord! For I have never eaten anything profane or ritually unclean.”",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "The voice spoke to him again, a second time: “What God has made clean, you must not call profane.”",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "This happened three times, and then the object was immediately taken up into heaven.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "While Peter was still deeply perplexed about what the vision he had seen might mean, the men sent by Cornelius—having asked their way to Simon’s house—stood at the gate.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "They called out to ask if Simon, known as Peter, was staying there as a guest.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "While Peter was still mulling over the vision, the Spirit said to him, “Look, men are searching for you.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Get up, go downstairs, and go with them without hesitation, because I myself have sent them.”",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "So Peter went down to the men and said, “I am the one you are looking for. For what reason have you come?”",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "They replied, “Cornelius, a centurion—a righteous and God-fearing man who is well-regarded by the entire Jewish nation—was divinely instructed by a holy messenger to summon you to his house so he could hear a message from you.”",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "So Peter invited them in and gave them lodging. The next day he got up and went with them, and some of the brothers from Joppa accompanied him.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "The following day he entered Caesarea. Cornelius was expecting them and had invited his relatives and close friends.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "When Peter entered, Cornelius met him, fell at his feet, and bowed down in reverence.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "But Peter raised him up, saying, “Stand up; I too am only a human being.”",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "As he talked with him, Peter went inside and found many people gathered.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "He said to them, “You yourselves know how taboo it is for a Jewish man to associate closely with or visit a foreigner. But God has shown me that I should call no human being profane or ritually unclean.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "This is why I came without objection when I was sent for. So I ask, for what reason did you send for me?”",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Cornelius replied, “Four days ago at this very hour, the ninth hour, I was praying in my house. Suddenly a man stood before me in radiant clothing",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "and said, ‘Cornelius, your prayer has been heard and your acts of charity have been remembered before God.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Send therefore to Joppa and summon Simon, who is called Peter; he is staying as a guest in the house of Simon, a tanner, by the sea.’",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "So I sent for you immediately, and it was good of you to come. Now we are all here in the presence of God to hear everything the Lord has commanded you to say.”",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Then Peter began to speak: “I truly understand now that God does not show favoritism based on status.",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "Instead, in every nation, the one who fears him and does what is right is acceptable to him.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "This is the message he sent to the sons of Israel, proclaiming the good news of peace through Jesus Christ—he is Lord of all.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "You know the events that took place throughout all Judea, beginning from Galilee after the immersion that John proclaimed:",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "how God anointed Jesus of Nazareth with the Holy Spirit and with power, and how he went about doing good as a benefactor and healing all who were tyrannized by the devil, because God was with him.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "“We are witnesses of all he did both in the Judean countryside and in Jerusalem. They put him to death by hanging him on a tree,",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "but God raised him on the third day and allowed him to be clearly seen—",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "not by all the people, but by witnesses previously chosen by God, by us, who ate and drank with him after he rose from the dead.",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "And he commanded us to preach to the people and to testify solemnly that he is the one designated by God as judge of the living and the dead.",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "To him all the prophets bear witness, that everyone who believes in him receives a release from sins through his name.”",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "While Peter was still speaking these words, the Holy Spirit fell upon all who were listening to the message.",
          "paragraphStart": true
        },
        {
          "verse": 45,
          "text": "The circumcised believers who had come with Peter were astonished that the gift of the Holy Spirit had been poured out even on the Gentiles,",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "for they heard them speaking in tongues and extolling the greatness of God. Then Peter responded,",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "“Can anyone withhold the water for baptizing these people who have received the Holy Spirit just as we did?”",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "So he directed that they be baptized in the name of Jesus Christ. Then they asked him to stay for several days.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"God-fearer\" (v. 2, 22)**: The Greek *phoboumenos ton theon* was a technical term in the first century for Gentiles who worshipped the God of Israel and followed Jewish ethical laws but had not undergone circumcision or full conversion to Judaism.\n\n**\"Memorial offering\" (v. 4, 31)**: The Greek *mnēmosynon* corresponds to the Hebrew *azkarah*, a specific type of sacrificial offering in the Septuagint (Leviticus 2:2). This signals to the reader that Cornelius’s piety is being treated by God as a legitimate sacrifice, despite his Gentile status.\n\n**\"Profane or ritually unclean\" (v. 14, 28)**: Peter uses two distinct terms: *koinon* (common/profane) and *akatharton* (ritually unclean). *Koinon* refers to things that are \"common\" to the world and thus not set apart for God's use, while *akatharton* refers to things explicitly forbidden by the Levitical law.\n\n**\"Without hesitation\" (v. 20)**: The verb *diakrinomenos* carries the sense of \"making a distinction\" or \"doubting.\" In this context, it refers to the inner conflict Peter would feel about violating social-religious boundaries.\n\n**\"Taboo\" (v. 28)**: The Greek *athemiton* refers to that which is \"unlawful\" not necessarily by statutory law, but by established religious custom and social norms. In the Roman world, it often referred to things that were \"abominable\" or \"taboo.\"\n\n**\"Does not show favoritism based on status\" (v. 34)**: The Greek *prosōpolēmptēs* is a literal rendering of a Hebrew idiom meaning \"to lift the face.\" It refers to a judge who shows partiality to someone based on their social standing or appearance.\n\n**\"Benefactor\" (v. 38)**: The participle *euergetōn* evokes the \"Benefactor\" (*Euergetes*) titles common among Hellenistic rulers. Luke is contrasting Jesus’s actual \"doing of good\" with the self-proclaimed titles of worldly kings.\n\n**\"Tyrannized\" (v. 38)**: The verb *katadynasteuomenous* is stronger than \"oppressed\"; it implies being under the harsh, arbitrary rule of a potentate or tyrant.\n\n**\"Hanging him on a tree\" (v. 39)**: While *xylon* can mean \"wood\" or \"cross,\" the use of \"tree\" preserves the allusion to Deuteronomy 21:22–23, which discusses the curse of one hanged on a tree—a point of great significance in early Jewish-Christian preaching.\n\n**\"Release from sins\" (v. 43)**: The Greek *aphesin* is often translated as \"forgiveness,\" but its primary sense is \"release,\" \"dismissal,\" or \"liberation\" (as from a debt or captivity). It carries a more active sense of being set free than the English \"forgiveness\" usually implies."
    },
    {
      "chapter": 11,
      "verses": [
        {
          "verse": 1,
          "text": "Now the apostles and the brothers who were throughout Judea heard that the nations had also welcomed the word of God.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "So when Peter went up to Jerusalem, the circumcision faction took issue with him,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "saying, “You entered the house of uncircumcised men and even ate with them!”",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But Peter began to explain the matter to them in sequence:",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "“I was in the city of Joppa praying, and in a visionary state I saw a vision: something like a large linen sheet was descending, being lowered from heaven by its four corners, and it came right down to me.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Looking closely at it, I observed and saw the four-footed animals of the earth, the wild beasts, the reptiles, and the birds of the sky.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "I also heard a voice saying to me, ‘Get up, Peter; sacrifice and eat.’",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But I said, ‘Not at all, Lord! For nothing ritually common or impure has ever entered my mouth.’",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "But a voice from heaven answered a second time, ‘What God has made clean, you must not call common.’",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "This happened three times, and then everything was pulled back up into heaven.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "“And look, at that very moment, three men stood at the house where we were, having been sent to me from Caesarea.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "The Spirit told me to go with them without making any distinction. These six brothers also went with me, and we entered the man’s house.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "He reported to us how he had seen the angel standing in his house and saying, ‘Send to Joppa and summon Simon, the one nicknamed Peter;",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "he will speak words to you by which you will be saved, you and your entire household.’",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "As I began to speak, the Holy Spirit fell upon them just as he did upon us at the beginning.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Then I remembered the word of the Lord, how he used to say, ‘John baptized with water, but you will be baptized in the Holy Spirit.’",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "If, therefore, God gave them the same gift he gave to us when we believed in the Lord Jesus Christ, who was I to be able to hinder God?”",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "When they heard these things, they were silenced; and they glorified God, saying, “So then, God has granted even to the nations the repentance that leads to life.”",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Now those who had been scattered by the oppression that arose over Stephen traveled as far as Phoenicia, Cyprus, and Antioch, speaking the word to no one except Jews.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "But there were some of them—men from Cyprus and Cyrene—who, upon coming to Antioch, began speaking to the Greeks as well, announcing the good news of the Lord Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "The hand of the Lord was with them, and a great number who believed turned to the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "The report about them reached the ears of the church in Jerusalem, and they sent Barnabas out to Antioch.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "When he arrived and saw the grace of God, he was glad and began encouraging them all to remain true to the Lord with a fixed purpose of heart,",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "for he was a good man, full of the Holy Spirit and of faith. And a significant crowd was added to the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Then Barnabas went to Tarsus to look for Saul,",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "and when he found him, he brought him to Antioch. For an entire year they met together within the church and taught a significant crowd. It was in Antioch that the disciples were first given the name “Christians.”",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "In those days, prophets came down from Jerusalem to Antioch.",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "One of them, named Agabus, stood up and indicated through the Spirit that a severe famine was about to come over the entire inhabited world—which indeed happened during the reign of Claudius.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "So the disciples, according to their individual means, determined to send a relief contribution to the brothers living in Judea.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "This they did, sending it to the elders by the hand of Barnabas and Saul.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The nations\" (v. 1, 18)**: The Greek *ethnē* is often translated as \"Gentiles,\" but in a first-century Jewish context, it refers to the non-Jewish nations. This carries the weight of the Abrahamic promise—that through his seed, all the *nations* would be blessed.\n\n**\"The circumcision faction\" (v. 2)**: *Hoi ek peritomēs* (those of the circumcision) refers specifically to Jewish believers who maintained that circumcision and adherence to the Mosaic Law were necessary for inclusion in the covenant community.\n\n**\"Ritually common\" (v. 8, 9)**: The Greek *koinon* means \"common\" or \"shared,\" but in the context of Jewish dietary laws, it refers to things that are \"profane\" or not set apart as holy/kosher. It is distinct from *akatharton* (impure/unclean), though they are often paired.\n\n**\"Without making any distinction\" (v. 12)**: The verb *diakrinō* is used here as a wordplay. In verse 2, the critics \"took issue\" (*diekrinonto*) with Peter, effectively \"creating a division\" or \"making a distinction\" based on legal purity. The Spirit commands Peter to do the opposite—to move toward the Gentiles without creating such a separation.\n\n**\"Oppression\" (v. 19)**: The Greek *thlipsis* (tribulation, affliction) refers to the intense pressure and persecution following Stephen's martyrdom.\n\n**\"Greeks\" (v. 20)**: While some manuscripts read *Hellēnistas* (Hellenists/Greek-speaking Jews), the context of the passage—contrasting them with those who spoke \"to no one except Jews\" in verse 19—strongly suggests the author intended *Hellēnas* (Greeks/Gentiles).\n\n**\"Announcing the good news\" (v. 20)**: The verb *euangelizō* is more specific than simply \"preaching.\" It refers to the proclamation of a victory or a royal announcement.\n\n**\"Given the name 'Christians'\" (v. 26)**: The Greek *chrēmatisai* often carries the sense of an official designation, a public name, or even a divine decree. The suffix *-ianos* in *Christianoi* is a Latinism (like *Caesarianos*), denoting \"those of the party of Christ.\" It likely began as a label applied by outsiders to identify this new group.\n\n**\"The entire inhabited world\" (v. 28)**: The Greek *oikoumenē* refers specifically to the Roman world—the civilized, \"inhabited\" world of the empire—rather than the entire physical globe.\n\n**\"Relief contribution\" (v. 29)**: *Diakonia* is often translated as \"ministry\" or \"service.\" In this context, it refers to the practical, material service of a financial collection for the poor."
    },
    {
      "chapter": 12,
      "verses": [
        {
          "verse": 1,
          "text": "Around that time, King Herod began a violent campaign against certain members of the assembly of believers.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He executed James, the brother of John, with the sword.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "When he saw that this was popular with the Judeans, he proceeded to arrest Peter as well. This occurred during the festival of Unleavened Bread.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "After seizing him, Herod put him in prison, handing him over to four squads of four soldiers each to guard him. His intention was to bring him out for a public trial before the people after the Passover.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "So Peter was kept under guard in the prison, while the assembly of believers prayed fervently to God on his behalf.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "On the very night before Herod was to bring him forward for trial, Peter was sleeping between two soldiers, bound with two chains, while sentries in front of the door kept watch over the prison.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Suddenly, a messenger of the Lord stood there, and a light shone in the cell. Striking Peter on the side, the messenger woke him, saying, “Get up quickly!” At that moment, the chains fell from his wrists.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Then the messenger said to him, “Put on your belt and tie your sandals.” Peter did so. The messenger said to him, “Wrap your cloak around you and follow me.”",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Peter went out and followed him, yet he did not realize that what was happening through the messenger was real; he thought he was seeing a vision.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "They passed the first guard post and then the second, and they came to the iron gate leading into the city. It opened for them automatically. After they went out and walked the length of one street, the messenger suddenly left him.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "When Peter came to his senses, he said, “Now I know for certain that the Lord sent his messenger and rescued me from the hand of Herod and from everything the Judean people were expecting.”",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "Once he realized this, he went to the house of Mary, the mother of John (also known as Mark), where many had gathered and were praying.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "When Peter knocked at the door of the outer gateway, a servant girl named Rhoda came to answer.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Recognizing Peter’s voice, she was so overcome with joy that she did not open the gate, but instead ran inside and announced that Peter was standing at the gateway.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "They said to her, “You are out of your mind!” But she kept insisting it was so. They said, “It must be his angel.”",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Meanwhile, Peter continued knocking; when they finally opened the door and saw him, they were astonished.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Motioning to them with his hand to be silent, he described to them how the Lord had led him out of the prison. He said, “Report these things to James and to the brothers.” Then he left and went to another place.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "At daybreak, there was no small commotion among the soldiers as to what had become of Peter.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "After Herod searched for him and did not find him, he interrogated the guards and ordered them to be led away to execution. Then Herod went down from Judea to Caesarea and stayed there.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Now Herod had been in a state of fury against the people of Tyre and Sidon. They came to him with a unified front, and after winning over Blastus, the king’s personal chamberlain, they sued for peace, because their region depended on the king’s country for its food supply.",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "On an appointed day, Herod put on his royal robes, sat upon the public dais, and delivered a speech to them.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "The assembled crowd began shouting, “The voice of a god, and not of a man!”",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Immediately, a messenger of the Lord struck him down because he did not give the glory to God; he was eaten by worms and breathed his last.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "But the word of God continued to grow and multiply.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "And Barnabas and Saul returned from Jerusalem after they had fulfilled their mission of service, taking with them John, who was called Mark.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Assembly of believers\" (v. 1, 5)**: The Greek *ekklēsia* refers to a gathering or assembly. Translating it as \"church\" often carries modern institutional or architectural baggage that would be foreign to the first-century reader.\n\n**\"Proceeded to\" (v. 3)**: The Greek *prosetheto* (\"he added to\") is a Semitic idiom (reflecting an Aramaic/Hebrew substratum) used to describe a sequence of actions.\n\n**\"Public trial\" (v. 4)**: The Greek *anagagein* (\"to lead up\") in a legal context often refers to bringing a prisoner up to a higher place (like a dais or *bema*) for a formal public trial or sentencing.\n\n**\"Cell\" (v. 7)**: The word *oikēmati* literally means a dwelling or room, but in Attic and Koine Greek, it was a common euphemism for a prison cell.\n\n**\"Automatically\" (v. 10)**: The Greek *automatē* is the direct root of the English word. It denotes something that moves by its own impulse or power.\n\n**\"His angel\" (v. 15)**: This reflects a common first-century Jewish belief (found in Second Temple literature) that individuals had a guardian angel who could take on their physical appearance.\n\n**\"James\" (v. 17)**: This refers to James the brother of Jesus, who by this point had emerged as the leader of the Jerusalem community. The James mentioned in verse 2 was the son of Zebedee.\n\n**\"Led away to execution\" (v. 19)**: The Greek *apachthēnai* (\"to be led away\") was a standard technical term for leading a condemned prisoner to execution.\n\n**\"Public dais\" (v. 21)**: The *bēma* was a raised platform or judgment seat from which officials addressed the public or handed down rulings.\n\n**\"Eaten by worms\" (v. 23)**: The term *skōlēkobrōtos* is a graphic medical description used in antiquity (e.g., by Herodotus and Josephus) to describe a divine judgment involving internal parasites or gangrene.\n\n**\"Mission of service\" (v. 25)**: The Greek *diakonian* refers to the specific task of bringing famine relief funds from Antioch to Jerusalem (as mentioned in Acts 11:29-30)."
    },
    {
      "chapter": 13,
      "verses": [
        {
          "verse": 1,
          "text": "Now in the church at Antioch there were prophets and teachers: Barnabas, Simeon who was called “Niger,” Lucius the Cyrenian, Manaen (who had been brought up with Herod the tetrarch), and Saul.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "While they were worshiping the Lord and fasting, the Holy Spirit said, “Set apart for me Barnabas and Saul for the work to which I have called them.”",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Then, after fasting and praying, they laid their hands on them and sent them off.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "So, being sent out by the Holy Spirit, they went down to Seleucia, and from there they sailed to Cyprus.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "When they arrived in Salamis, they began proclaiming the word of God in the Jewish synagogues; they also had John as their assistant.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "When they had gone through the whole island as far as Paphos, they found a certain man—a sorcerer and Jewish false prophet named Bar-Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "He was an associate of the proconsul, Sergius Paulus, a man of keen intelligence. The proconsul summoned Barnabas and Saul, for he was eager to hear the word of God.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But Elymas the sorcerer (for that is how his name is translated) opposed them, trying to turn the proconsul away from the faith.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "But Saul, also known as Paul, filled with the Holy Spirit, looked him straight in the eye",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "and said, “You son of the devil, full of every kind of deceit and fraud! You enemy of all that is right, will you never stop distorting the straight paths of the Lord?",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Now look: the hand of the Lord is against you, and you will be blind, unable to see the sun for a time.” Immediately a mist and darkness fell over him, and he groped about, seeking people to lead him by the hand.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "When the proconsul saw what had happened, he believed, for he was struck with awe at the teaching about the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Paul and his companions put out to sea from Paphos and came to Perga in Pamphylia; but John left them and returned to Jerusalem.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "They, however, went on from Perga and arrived at Pisidian Antioch. On the Sabbath day, they entered the synagogue and took a seat.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "After the reading of the Law and the Prophets, the synagogue leaders sent word to them, saying, “Brothers, if you have any word of encouragement for the people, speak it.”",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "So Paul stood up, motioned with his hand, and said: “Men of Israel and you God-fearing Gentiles, listen!",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "The God of this people Israel chose our fathers and made the people great during their stay in the land of Egypt; then with an uplifted arm he led them out of it.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For a period of about forty years, he endured their behavior in the wilderness.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "After destroying seven nations in the land of Canaan, he gave them their land as an inheritance.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "All this took about four hundred and fifty years. After that, he gave them judges until the time of Samuel the prophet.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Then they asked for a king, and God gave them Saul son of Kish, a man of the tribe of Benjamin, for forty years.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "After removing him, he raised up David to be their king, about whom he testified: ‘I have found David son of Jesse to be a man after my own heart, who will do all my will.’",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "From this man’s seed, according to the promise, God has brought to Israel a Savior, Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Before his coming, John had publicly proclaimed a baptism of repentance to all the people of Israel.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "And as John was finishing his course, he would say, ‘What do you suppose I am? I am not he. No, but look: one is coming after me whose sandal I am not worthy to untie.’",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Brothers, sons of the family of Abraham and those among you who fear God, it is to us that the message of this salvation has been sent.",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "For those who live in Jerusalem and their rulers did not recognize him; by condemning him, they fulfilled the voices of the prophets that are read every Sabbath.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Though they found no basis for a death sentence, they asked Pilate to have him executed.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "When they had carried out everything written about him, they took him down from the tree and laid him in a tomb.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "But God raised him from the dead!",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "For many days he appeared to those who had come up with him from Galilee to Jerusalem, who are now his witnesses to the people.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "And we are preaching the Good News to you: what God promised to our fathers,",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "he has fulfilled for us, their children, by raising Jesus—as it is also written in the second Psalm: ‘You are my Son; today I have become your Father.’",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "As for the fact that he raised him from the dead, never again to return to decay, he spoke in this way: ‘I will give you the holy and reliable promises made to David.’",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "Therefore he also says in another Psalm: ‘You will not allow your Holy One to see decay.’",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "For David, after serving the purpose of God in his own generation, fell asleep; he was buried with his fathers and saw decay.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "But the one whom God raised did not see decay.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "Therefore, let it be known to you, brothers, that through this man forgiveness of sins is proclaimed to you.",
          "paragraphStart": true
        },
        {
          "verse": 39,
          "text": "From all the things from which you could not be acquitted by the law of Moses, everyone who believes is acquitted in him.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "Take care, then, that what was said in the prophets does not happen to you:",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "‘Look, you scoffers, be amazed and perish! For I am doing a work in your days, a work you will never believe, even if someone explains it to you in detail.’”",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "As Paul and Barnabas were leaving, the people kept begging them to speak these same words to them on the following Sabbath.",
          "paragraphStart": true
        },
        {
          "verse": 43,
          "text": "When the synagogue assembly broke up, many of the Jews and devout converts to Judaism followed Paul and Barnabas, who, in their conversations with them, urged them to remain constant in the grace of God.",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "On the next Sabbath, almost the whole city gathered to hear the word of the Lord.",
          "paragraphStart": true
        },
        {
          "verse": 45,
          "text": "But when the Jews saw the crowds, they were filled with burning jealousy and began to contradict what Paul was saying, slandering him.",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "Then Paul and Barnabas spoke out boldly: “It was necessary that the word of God be spoken to you first. Since you reject it and judge yourselves unworthy of eternal life, look—we are turning to the Gentiles.",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "For this is what the Lord has commanded us: ‘I have made you a light for the nations, that you may bring salvation to the ends of the earth.’”",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "When the Gentiles heard this, they began to rejoice and glorify the word of the Lord, and all who were appointed to eternal life believed.",
          "paragraphStart": true
        },
        {
          "verse": 49,
          "text": "So the word of the Lord spread throughout the entire region.",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "But the Jews incited the prominent women of high standing and the leading men of the city; they stirred up a persecution against Paul and Barnabas and drove them out of their district.",
          "paragraphStart": false
        },
        {
          "verse": 51,
          "text": "So they shook the dust off their feet against them and went to Iconium.",
          "paragraphStart": false
        },
        {
          "verse": 52,
          "text": "And the disciples were filled with joy and with the Holy Spirit.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Brought up with\" (v. 1)**: The Greek *syntrophos* can mean a foster-brother or a close childhood companion. Given that Herod Antipas was a member of the royal household, this highlights the high social status of the early leaders in the Antiochian church.\n\n**\"Worshiping\" (v. 2)**: The Greek *leitourgountōn* refers to the performance of religious service or ritual. While often associated with the \"liturgy\" of the temple, here it describes the communal prayer and service of the Christian leaders.\n\n**\"Sorcerer\" (v. 6, 8)**: The Greek *magos* carries a range of meanings from \"wise man\" (as in Matthew 2) to \"charlatan/sorcerer.\" In the context of Acts, where Luke contrasts the power of the Spirit with magic (e.g., Simon Magus in ch. 8), it is clearly pejorative.\n\n**\"Endured their behavior\" (v. 18)**: There is a famous textual variant here between *etrophophorēsen* (\"carried them like a nurse\") and *etropophorēsen* (\"endured their manners/disposition\"). The SBLGNT follows the latter, which alludes to the Israelites' legendary rebelliousness in the wilderness.\n\n**\"Tree\" (v. 29)**: The Greek *xylou* literally means \"wood\" or \"tree.\" Luke uses this term to evoke the Deuteronomy 21:23 curse of one \"hanged on a tree,\" a crucial theme in early Jewish-Christian apologetics regarding the crucifixion.\n\n**\"Decay\" (vv. 34-37)**: The Greek *diaphthora* refers to the physical decomposition of a corpse. Paul’s argument hinges on the contrast between David, whose body underwent corruption, and Jesus, who was raised before decomposition could occur, fulfilling Psalm 16.\n\n**\"Acquitted\" (v. 39)**: The Greek *dikaioō* is the verb often translated as \"justify.\" In this legal context—contrasting what the Law of Moses could and could not do—it carries the sense of being \"set right\" or \"acquitted\" of a legal charge.\n\n**\"Appointed\" (v. 48)**: The Greek *tetagmenoi* is a military or administrative term meaning \"assigned,\" \"ordered,\" or \"designated.\" It suggests a divine ordering behind the Gentiles' response."
    },
    {
      "chapter": 14,
      "verses": [
        {
          "verse": 1,
          "text": "In Iconium, the same thing happened: they entered the Jewish synagogue together and spoke in such a way that a great number of both Jews and Greeks believed.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "But the Jews who refused to be persuaded stirred up the Gentiles and embittered their minds against the brothers.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Nevertheless, they stayed there for a long time, speaking boldly in reliance on the Lord, who bore witness to the message of his grace by granting signs and wonders to be performed through their hands.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "The population of the city was divided; some sided with the Jews and others with the apostles.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "When an attempt was made by both Gentiles and Jews, along with their leaders, to mistreat and stone them,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "the apostles became aware of it and fled to the Lycaonian cities of Lystra and Derbe and the surrounding region.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "There, they continued to announce the Good News.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "In Lystra, a man was sitting who had no strength in his feet. He had been lame from his mother’s womb and had never walked.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "He was listening to Paul speak. Paul looked at him intently and, seeing that he had the faith to be restored to wholeness,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "said with a loud voice, \"Stand up straight on your feet!\" The man leaped up and began to walk.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "When the crowds saw what Paul had done, they raised their voices in the Lycaonian language, saying, \"The gods have taken human form and come down to us!\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "They began calling Barnabas 'Zeus' and Paul 'Hermes,' since he was the lead speaker.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "The priest of the temple of Zeus-Before-the-City brought bulls and flower wreaths to the gates and, with the crowds, intended to offer a sacrifice.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "When the apostles Barnabas and Paul heard of this, they tore their clothes and rushed out into the crowd, shouting,",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "\"Men, why are you doing these things? We are only human beings, with the same nature and vulnerabilities as you! We are announcing the Good News to you so that you may turn from these worthless things to the living God, who made the heaven, the earth, the sea, and everything in them.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "In generations past, he allowed all the nations to go their own ways.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Yet he did not leave himself without witness: he showed kindness by giving you rain from heaven and fruitful seasons, filling your hearts with food and gladness.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Even with these words, they barely restrained the crowds from sacrificing to them.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Then Jews arrived from Antioch and Iconium, and after winning over the crowds, they stoned Paul and dragged him out of the city, thinking he was dead.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "But after the disciples gathered around him, he got up and went back into the city. The next day, he left with Barnabas for Derbe.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "After they had announced the Good News to that city and made many disciples, they returned to Lystra, Iconium, and Antioch.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "They were strengthening the souls of the disciples, encouraging them to remain in the faith, and saying, \"We must enter the kingdom of God through many crushing pressures.\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "When they had appointed elders for them in every church, having prayed with fasting, they committed them to the Lord in whom they had put their trust.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Then they passed through Pisidia and came to Pamphylia.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "After speaking the word in Perga, they went down to Attalia.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "From there they sailed back to Antioch, where they had been commended to the grace of God for the work they had now fulfilled.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "When they arrived and gathered the church together, they reported all that God had done with them and how he had opened a door of faith to the Gentiles.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "And they stayed there with the disciples for a considerable time.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Refused to be persuaded\" (v. 2)**: The Greek *apeithēsantes* suggests more than a passive lack of belief; it implies a willful rejection or disobedience to the message being presented.\n\n**\"Embittered their minds\" (v. 2)**: Literally \"made their souls evil.\" In the psychological context of the first century, the *psychē* (soul/mind) was the seat of volition and disposition. The Jews were poisoning the Gentiles' disposition toward the believers.\n\n**\"Restored to wholeness\" (v. 9)**: The Greek *sōthēnai* is often translated as \"saved\" or \"healed.\" In this context, it carries the holistic sense of being made \"whole\" or \"sound\"—both physically and spiritually.\n\n**\"Zeus-Before-the-City\" (v. 13)**: This refers to the temple of *Zeus Propylaios* (Zeus before the gates). It was common in Hellenistic cities for a protective deity to have a temple or shrine located just outside the city gates.\n\n**\"Same nature and vulnerabilities\" (v. 15)**: The Greek *homoiopatheis* means \"of like passions\" or \"subject to the same feelings.\" It is a direct rebuttal to the crowd’s claim that they are \"gods in human form.\" Paul is emphasizing their shared human frailty.\n\n**\"Worthless things\" (v. 15)**: The Greek *mataiōn* (vanities/empty things) was a standard Jewish rhetorical term for idols (reflecting the Hebrew *hebel*). To the original audience, this was a sharp critique of the local cultic practices as being devoid of reality or power.\n\n**\"Crushing pressures\" (v. 22)**: The Greek *thlipseōn* is often translated as \"tribulations\" or \"afflictions,\" but its root meaning refers to pressure, like that used in a wine press. It conveys the intense social and physical weight of persecution described in the preceding verses.\n\n**\"Appointed\" (v. 23)**: The verb *cheirotonēsantes* originally meant to vote by a show of hands, but by the first century, it had come to mean \"to appoint\" or \"to designate,\" often by those in authority. \n\n**\"Commended\" (v. 26)**: The Greek *paradedomenoi* (from *paradidōmi*) is a formal term meaning \"handed over\" or \"entrusted.\" The church at Antioch had \"entrusted\" the apostles to God's care for this specific mission."
    },
    {
      "chapter": 15,
      "verses": [
        {
          "verse": 1,
          "text": "Now some men came down from Judea and began teaching the brothers, “Unless you are circumcised according to the custom prescribed by Moses, you cannot be saved.”",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "This led to substantial discord and intense debate between them and Paul and Barnabas. Consequently, it was arranged for Paul, Barnabas, and some others from their group to go up to Jerusalem to see the apostles and elders regarding this dispute.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "So, after being sent on their way by the church, they passed through both Phoenicia and Samaria, recounting in detail the conversion of the Gentiles, which brought great joy to all the brothers.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "When they arrived in Jerusalem, they were welcomed by the church, the apostles, and the elders, and they reported everything God had accomplished through them.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But some believers who belonged to the sect of the Pharisees stood up and said, “It is necessary to circumcise them and to command them to keep the Law of Moses.”",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "The apostles and the elders gathered to look into this matter.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "After much debate, Peter stood up and said to them, “Brothers, you know that in the early days, God made a choice among you that through my mouth the Gentiles should hear the message of the good news and believe.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And God, who knows the secrets of the heart, testified to them by giving them the Holy Spirit just as he did to us.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "He made no distinction between us and them, having cleansed their hearts by faith.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Now then, why are you putting God to the test by placing a yoke upon the neck of the disciples—a burden that neither our fathers nor we have been strong enough to bear?",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "On the contrary, we believe that we are saved through the grace of the Lord Jesus, in the very same way they are.”",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "The entire assembly fell silent as they listened to Barnabas and Paul describe all the signs and wonders God had performed among the Gentiles through them.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "After they finished speaking, James responded, “Brothers, listen to me.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Simeon has described how God first intervened to take from among the nations a people for his name.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "The words of the prophets agree with this, as it is written:",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "‘After these things I will return and rebuild the fallen tent of David; I will rebuild its ruins and restore it,",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "so that the rest of humanity may seek the Lord—even all the nations over whom my name has been invoked, says the Lord, who does these things",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "known from ages past.’",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Therefore, it is my judgment that we should not place obstacles in the way of those from among the nations who are turning to God.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Instead, we should write to them to abstain from things polluted by idols, from sexual immorality, from what has been strangled, and from blood.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For from ancient generations, Moses has had those who preach him in every city, being read aloud in the synagogues every Sabbath.”",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Then it seemed best to the apostles and the elders, together with the whole church, to choose men from among them and send them to Antioch with Paul and Barnabas. They chose Judas (called Barsabbas) and Silas, men who were leaders among the brothers.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "They sent the following letter with them: “The apostles and the elders, your brothers, to the brothers among the nations in Antioch, Syria, and Cilicia: Greetings!",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Since we have heard that some of our number have gone out and disturbed you with their talk, unsettling your minds—though we gave them no such instructions—",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "it seemed best to us, having reached a unanimous decision, to choose men and send them to you along with our beloved Barnabas and Paul,",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "men who have risked their lives for the name of our Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "We have therefore sent Judas and Silas, who will themselves report these same things by word of mouth.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "For it seemed best to the Holy Spirit and to us to lay no greater burden upon you than these necessary things:",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "to abstain from meat sacrificed to idols, from blood, from what has been strangled, and from sexual immorality. If you keep yourselves free from these things, you will do well. Farewell.”",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "So, when the messengers were sent off, they went down to Antioch. They gathered the assembly together and delivered the letter.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "When the people read it, they rejoiced at the encouragement.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Judas and Silas, who were themselves prophets, encouraged and strengthened the brothers with a long message.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "After spending some time there, they were sent off in peace by the brothers to return to those who had sent them.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "But Paul and Barnabas stayed in Antioch, teaching and proclaiming the word of the Lord, along with many others.",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "After some days, Paul said to Barnabas, “Let’s return and visit the brothers in every city where we proclaimed the word of the Lord, to see how they are doing.”",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "Barnabas wanted to take John (called Mark) along with them.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "But Paul insisted that they should not take along the man who had abandoned them in Pamphylia and had not accompanied them in the work.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "A sharp clash of temper resulted, so that they parted ways. Barnabas took Mark and sailed away to Cyprus,",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "while Paul chose Silas and departed, having been commended by the brothers to the grace of the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "He traveled through Syria and Cilicia, strengthening the churches.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Custom\" (v. 1)**: The Greek *ethos* refers to the prescribed religious practice or the Mosaic \"way of life.\" To a first-century Jew, this wasn't just a \"tradition\" but the authoritative legal framework of the covenant.\n\n**\"Sect\" (v. 5)**: The Greek *hairesis* (from which we get \"heresy\") did not yet carry a purely negative connotation of false teaching. It referred to a \"school of thought\" or a recognized faction within a larger religion, such as the Pharisees or Sadducees.\n\n**\"God, who knows the secrets of the heart\" (v. 8)**: The Greek *kardiognostes* is a compound word meaning \"heart-knower.\" This emphasizes God's unique ability to perceive the internal reality of faith in Gentiles, bypassing the external marker of circumcision.\n\n**\"Yoke\" (v. 10)**: In Jewish thought, the \"yoke of the Torah\" was a common idiom for taking on the obligation of the Law. Peter uses the term here to argue that the ritual law is an unbearable weight when divorced from the Spirit's power.\n\n**\"Intervened\" (v. 14)**: The Greek *epeskepsato* (often \"visited\") carries the nuance of a divine visitation or a providential oversight where God acts on behalf of a people.\n\n**\"Tent of David\" (v. 16)**: Translating *skene* as \"tent\" preserves the allusion to the humble, mobile dwelling of David's line (Amos 9:11 LXX) as opposed to a permanent \"palace,\" emphasizing the restoration of the Davidic kingdom through the Messiah.\n\n**\"Polluted by idols\" (v. 20)**: This refers specifically to meat that had been sacrificed in pagan temples (*eidōlothytōn* in v. 29), which would have been a major source of social and religious defilement for a Jewish-Gentile community.\n\n**\"Unsettling your minds\" (v. 24)**: The Greek *anaskeuazontes* is a strong term meaning to \"dismantle,\" \"pack up,\" or \"subvert.\" It suggests that the unauthorized teachers were tearing down the spiritual foundation the converts had built.\n\n**\"A sharp clash of temper\" (v. 39)**: The Greek *paroxysmos* (the root of the English \"paroxysm\") denotes a sudden, sharp irritation or a provocation. It indicates that the disagreement between Paul and Barnabas was not a mild difference of opinion but an intense emotional conflict."
    },
    {
      "chapter": 16,
      "verses": [
        {
          "verse": 1,
          "text": "Paul arrived at Derbe and then Lystra, where he found a disciple named Timothy. He was the son of a Jewish woman who was a believer, but his father was a Greek.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "The brothers in Lystra and Iconium spoke well of Timothy, giving a strong witness to his character.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Paul wanted this man to travel with him, so he took him and performed the rite of circumcision because of the Jews who lived in those parts; for everyone knew that his father was a Greek.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "As they traveled through the cities, they delivered the resolved decisions that had been reached by the apostles and elders in Jerusalem for the people to observe.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "So the churches were being solidified in the faith and were growing in number every day.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "They traveled through the region of Phrygia and Galatia, having been prevented by the Holy Spirit from speaking the word in the province of Asia.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "When they came opposite Mysia, they tried to enter Bithynia, but the Spirit of Jesus did not permit them.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "So, bypassing Mysia, they went down to Troas.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "During the night, a vision appeared to Paul: a man from Macedonia was standing there, appealing to him and saying, \"Cross over to Macedonia and help us.\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "As soon as he saw the vision, we immediately sought to depart for Macedonia, concluding that God had called us to announce the good news to them.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Setting sail from Troas, we ran a straight course to Samothrace, and on the following day to Neapolis.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "From there we went to Philippi, which is a leading city of the district of Macedonia and a Roman colony. We stayed in this city for several days.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "On the Sabbath day, we went outside the city gate to the riverbank, where we expected there to be a place of prayer. We sat down and began speaking to the women who had gathered there.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "One of them was a woman named Lydia, a dealer in expensive purple cloth from the city of Thyatira and a worshiper of God. She was listening, and the Lord opened her heart to pay close attention to what Paul was saying.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "When she and her household were baptized, she urged us, saying, \"If you have judged me to be faithful to the Lord, come and stay at my house.\" And she prevailed upon us.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "It happened that as we were going to the place of prayer, we were met by a slave girl who had a spirit of the Python—a spirit of divination. She brought her masters a large profit by fortune-telling.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "She followed Paul and the rest of us, shouting out, \"These men are slaves of the Most High God, who are proclaiming to you a way of salvation!\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "She kept doing this for many days. Paul became deeply annoyed, and turning to the spirit, he said, \"I command you in the name of Jesus Christ to come out of her!\" And it came out that very hour.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "When her masters saw that their hope for profit had left them, they seized Paul and Silas and dragged them into the marketplace before the authorities.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Bringing them before the chief magistrates, they said, \"These men are Jewish, and they are throwing our city into an uproar.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "They are advocating customs that are not lawful for us to accept or practice, since we are Romans.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "The crowd joined in the attack against them, and the chief magistrates had them stripped of their clothes and ordered them to be beaten with rods.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "After they had inflicted many blows on them, they threw them into prison, commanding the jailer to guard them securely.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Having received such a command, he threw them into the inner prison and fastened their feet in the stocks.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "About midnight, Paul and Silas were praying and singing hymns to God, and the other prisoners were listening to them.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "Suddenly there was a great earthquake, so that the foundations of the prison were shaken. Immediately all the doors flew open and everyone’s chains were unfastened.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "When the jailer woke up and saw the prison doors open, he drew his sword and was about to kill himself, assuming the prisoners had escaped.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "But Paul cried out in a loud voice, \"Do not harm yourself! We are all here!\"",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "The jailer called for lights, rushed in, and fell trembling before Paul and Silas.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "He brought them out and asked, \"Sirs, what must I do to be saved?\"",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "They said, \"Believe in the Lord Jesus, and you will be saved—you and your household.\"",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Then they spoke the word of the Lord to him and to everyone in his house.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "At that same hour of the night, he took them and washed their wounds, and he and all his family were baptized at once.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "He brought them up into his house and set a meal before them, and he rejoiced greatly with his whole household that he had come to believe in God.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "When day broke, the chief magistrates sent their lictors with the order: \"Release those men.\"",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "The jailer reported these words to Paul, saying, \"The magistrates have sent word to release you. So come out now and go in peace.\"",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "But Paul said to the lictors, \"They beat us publicly without a trial—men who are Roman citizens—and threw us into prison. And now they are going to throw us out secretly? Absolutely not! Let them come themselves and escort us out.\"",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "The lictors reported these words to the chief magistrates, who became terrified when they heard they were Roman citizens.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "So they came and apologized to them; after escorting them out, they kept requesting that they leave the city.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "After leaving the prison, they went to Lydia’s house, and when they saw the brothers, they encouraged them and then departed.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Resolved decisions\" (v. 4)**: The Greek *dogmata* refers to the formal decrees or binding resolutions of the Jerusalem Council (Acts 15). \"Decrees\" is the traditional rendering, but \"resolved decisions\" captures the authoritative yet collaborative nature of the early church's discernment.\n\n**\"Spirit of the Python\" (v. 16)**: The Greek *pneuma pythona* refers to the Python, the serpent or dragon that guarded the Delphic Oracle. In the first century, this was a specific cultural reference to a spirit of divination or \"channeling\" associated with Apollo. \"Divination\" alone loses the pagan supernatural color the original audience would have recognized.\n\n**\"Chief magistrates\" (v. 20)**: The Greek *stratēgoi* corresponds to the Latin *duoviri*, the highest-ranking officials in a Roman colony like Philippi.\n\n**\"Customs that are not lawful... since we are Romans\" (v. 21)**: This reflects the Roman legal distinction between *religio licita* (authorized religion) and *religio illicita*. The owners are framing the gospel as an illegal foreign cult that threatens Roman social order.\n\n**\"Beaten with rods\" (v. 22)**: The Greek *rabdizein* refers to the specific Roman punishment of being beaten by the *fasces* (bundles of rods) carried by lictors.\n\n**\"Lictors\" (v. 35)**: The Greek *rabdouchos* (literally \"rod-bearer\") refers to the Roman lictors, the attendants who carried out the punishments ordered by the magistrates.\n\n**\"Publicly without a trial\" (v. 37)**: The Greek *akatakritous* means \"uncondemned\" or \"without due process.\" Under the *Lex Valeria* and *Lex Porcia*, it was a serious crime to beat a Roman citizen or punish them without a formal trial. Paul is invoking his legal rights to protect the nascent church from being viewed as a group of criminals."
    },
    {
      "chapter": 17,
      "verses": [
        {
          "verse": 1,
          "text": "After traveling through Amphipolis and Apollonia, they came to Thessalonica, where there was a synagogue of the Jews.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Following his usual custom, Paul went in to see them, and for three Sabbaths he reasoned with them from the Scriptures.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "He opened them up and demonstrated that it was necessary for the Messiah to suffer and to rise from the dead, saying, “This Jesus, whom I am proclaiming to you, is the Messiah.”",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Some of them were persuaded and were joined to Paul and Silas, as was a great multitude of the God-fearing Greeks and not a few of the leading women.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But the Jews became jealous. Recruiting some wicked men from the loiterers in the marketplace and forming a mob, they threw the city into an uproar. They descended on Jason’s house, seeking to bring Paul and Silas out to the assembly of the people.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "When they did not find them, they dragged Jason and some of the brothers before the politarchs, shouting, “These men who have caused turmoil throughout the whole empire have now come here,",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "and Jason has welcomed them as guests! They are all acting in defiance of Caesar’s decrees, claiming there is another king—Jesus.”",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "They agitated the crowd and the politarchs who heard these things.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "After they had taken a legal bond from Jason and the others, they released them.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "The brothers immediately sent Paul and Silas away to Berea by night. Upon arriving, they went into the synagogue of the Jews.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "These people were of more noble character than those in Thessalonica; they received the word with great eagerness, examining the Scriptures every day to see if these things were so.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Consequently, many of them believed, including a significant number of prominent Greek women and men.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "But when the Jews from Thessalonica learned that the word of God had been proclaimed by Paul in Berea as well, they came there too, agitating and stirring up the crowds.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "The brothers then immediately sent Paul away to the coast, but Silas and Timothy remained there.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Those escorting Paul brought him as far as Athens; and after receiving instructions for Silas and Timothy to join him as soon as possible, they departed.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "While Paul was waiting for them in Athens, his spirit was deeply distressed within him as he observed that the city was full of idols.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "So he began reasoning in the synagogue with the Jews and the God-fearing Greeks, and in the marketplace every day with those who happened to be there.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Some of the Epicurean and Stoic philosophers also engaged with him. Some said, “What is this intellectual scavenger trying to say?” Others said, “He seems to be a proclaimer of foreign deities,” because he was preaching the good news of Jesus and the Resurrection.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "They took hold of him and brought him to the Areopagus, saying, “May we know what this new teaching is that you are presenting?",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For you are bringing some startling things to our ears, and we want to know what these things mean.”",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "(Now all the Athenians and the foreigners residing there spent their time in nothing else but telling or hearing something new.)",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Standing in the middle of the Areopagus, Paul said: “Men of Athens, I see that in every way you are very religious.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "For as I was passing through and observing the objects of your worship, I even found an altar on which had been inscribed: ‘To an Unknown God.’ Therefore, what you worship in ignorance, this I proclaim to you.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "The God who made the world and everything in it, being Lord of heaven and earth, does not dwell in temples made by human hands.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Nor is he served by human hands as though he needed anything, since he himself gives to everyone life and breath and all things.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "From one man he made every nation of humanity to inhabit the whole face of the earth, having determined their appointed eras and the boundaries of their dwelling place,",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "so that they might seek God, if perhaps they might grope for him and find him—though he is actually not far from each one of us.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "For ‘in him we live and move and exist,’ as even some of your own poets have said, ‘For we are also his offspring.’",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Since we are the offspring of God, we ought not to suppose that the Divine Being is like gold or silver or stone, an image formed by human art and imagination.",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "Although God overlooked the times of ignorance, he now commands all people everywhere to repent,",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "because he has set a day on which he is going to judge the inhabited world in righteousness by a man whom he has appointed; and he has provided proof to everyone by raising him from the dead.”",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "When they heard of the resurrection of the dead, some began to scoff, but others said, “We will hear you again about this.”",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "So Paul left their assembly.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "But some men joined him and believed, among whom were Dionysius the Areopagite, a woman named Damaris, and others with them.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"God-fearing Greeks\" (v. 4, 17)**: The term *sebomenōn* refers to a specific class of Gentiles in the first century who were attracted to Jewish monotheism and ethics and attended synagogue, but had not fully converted (i.e., undergone circumcision).\n\n**\"Politarchs\" (v. 6, 8)**: The Greek *politarchas* is a precise Macedonian title for city officials. For centuries, critics thought Luke was in error because the term didn't appear in classical literature, but archaeology has since found numerous inscriptions using this exact title in Thessalonica.\n\n**\"Empire\" / \"Inhabited world\" (v. 6, 31)**: The Greek *oikoumenē* literally means the \"inhabited [world],\" but in a first-century context, it specifically referred to the Roman Empire and its civilization.\n\n**\"Legal bond\" (v. 9)**: The phrase *labontes to hikanon* is a Greek translation of the Latin legal term *satisdatio*. It refers to a sum of money deposited as security to guarantee future good behavior or compliance with a judicial order.\n\n**\"Noble character\" (v. 11)**: *Eugenesteroi* literally means \"better born\" or \"more noble,\" but here it refers to the character and openness of the Bereans’ minds rather than their social status.\n\n**\"Intellectual scavenger\" (v. 18)**: The Greek *spermologos* refers to a bird (like a crow) that picks up seeds. In Athenian slang, it was a biting insult for someone who picked up scraps of ideas from various philosophies and parroted them without understanding—an \"intellectual magpie.\"\n\n**\"The Resurrection\" (v. 18)**: Paul was preaching *Anastasis* (Resurrection). Some scholars suggest the Athenians, accustomed to personified deities, mistakenly thought Paul was introducing a male god (Jesus) and a female goddess (Anastasis).\n\n**\"Areopagus\" (v. 19, 22)**: This refers both to the location (Mars Hill) and the venerable council of Athens that met there, which had jurisdiction over religious and educational matters.\n\n**\"Very religious\" (v. 22)**: The word *deisidaimonesterous* is intentionally ambiguous. It can mean \"superstitious\" (negative) or \"devout\" (positive). Paul uses a diplomatic term that acknowledges their piety while preparing to critique its direction.\n\n**\"The Divine Being\" (v. 29)**: The Greek *to theion* is a philosophical term for the nature of God, used here to engage the Stoic and Epicurean listeners on their own linguistic ground.\n\n**\"Provided proof\" (v. 31)**: The word *pistin* usually means \"faith,\" but in this rhetorical context, it refers to the \"ground for belief\" or \"objective proof\" offered by the historical event of the resurrection."
    },
    {
      "chapter": 18,
      "verses": [
        {
          "verse": 1,
          "text": "After these events, Paul left Athens and went to Corinth.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "There he found a Jew named Aquila, a native of Pontus, who had recently arrived from Italy with his wife Priscilla because Claudius had ordered all the Jews to depart from Rome. Paul approached them,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "and because they shared the same trade, he stayed with them and they worked together; by trade, they were artisans of leather and canvas.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Every Sabbath he would hold discussions in the synagogue, attempting to persuade both Jews and Greeks.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "When Silas and Timothy arrived from Macedonia, Paul began to devote himself entirely to the message, solemnly testifying to the Jews that the Christ is Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "But when they resisted and spoke abusively, he shook out his garments and said to them, “Your blood be on your own heads! I am clean of responsibility. From now on, I will go to the nations.”",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "So he left that place and moved into the house of a man named Titius Justus, a worshiper of God whose house was right next door to the synagogue.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Crispus, the leader of the synagogue, came to believe in the Lord along with his entire household; and many of the Corinthians, as they listened, believed and were baptized.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "One night the Lord spoke to Paul through a vision: “Do not be afraid, but keep on speaking and do not be silent,",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "because I am with you. No one will lay a hand on you to harm you, for I have many people in this city.”",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "So he settled there for a year and six months, teaching the word of God among them.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "But while Gallio was proconsul of Achaia, the Jews rose up as one against Paul and brought him before the judgment seat,",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "saying, “This man is persuading people to worship God in ways that are contrary to the law.”",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "As Paul was about to open his mouth, Gallio said to the Jews, “If this were a matter of some injustice or a wicked crime, O Jews, it would be reasonable for me to put up with you.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "But if these are questions about a message and names and your own law, see to it yourselves; I do not wish to be a judge of these things.”",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And he drove them away from the judgment seat.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Then the whole crowd seized Sosthenes, the leader of the synagogue, and began beating him in front of the judgment seat. But Gallio paid no attention to any of it.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "After staying on for a considerable number of days, Paul said goodbye to the brothers and sisters and sailed for Syria, accompanied by Priscilla and Aquila. At Cenchreae he had his hair cut, for he was under a vow.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "When they reached Ephesus, he left Priscilla and Aquila there, but he himself entered the synagogue and held discussions with the Jews.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "When they asked him to stay for a longer time, he did not consent,",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "but as he said goodbye he told them, “I will return to you again, God willing.” Then he set sail from Ephesus.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "When he landed at Caesarea, he went up and greeted the church, and then went down to Antioch.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "After spending some time there, he departed and went from place to place through the region of Galatia and Phrygia, strengthening all the disciples.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Now a Jew named Apollos, a native of Alexandria, arrived in Ephesus. He was an eloquent man, well-versed in the Scriptures.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "He had been instructed in the Way of the Lord, and being fervent in spirit, he spoke and taught accurately the facts about Jesus, though he knew only the baptism of John.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "He began to speak boldly in the synagogue; but when Priscilla and Aquila heard him, they took him aside and explained the Way of God to him more accurately.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "When he wanted to cross over into Achaia, the brothers and sisters encouraged him and wrote to the disciples there to welcome him. Upon his arrival, he greatly assisted those who had believed through grace,",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "for he vigorously refuted the Jews in public, demonstrating through the Scriptures that the Christ is Jesus.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Artisans of leather and canvas\" (v. 3)**: The Greek *skēnopoioi* is traditionally rendered \"tentmakers.\" However, in the first-century economy, this trade involved working with leather and heavy woven cloth to create not only tents but also awnings and various travel gear. The broader phrase captures the technical skill involved.\n\n**\"Devote himself entirely to the message\" (v. 5)**: The Greek *syneicheto tō logō* suggests Paul was \"constrained\" or \"absorbed\" by the word. Once his coworkers arrived (likely bringing financial support from Macedonia), he was no longer split between trade-work and preaching, but could focus exclusively on the proclamation.\n\n**\"The nations\" (v. 6)**: The Greek *ethnē* is often translated \"Gentiles,\" but in a Jewish context (like Paul’s address here), it specifically refers to the non-Jewish nations of the world.\n\n**\"Judgment seat\" (v. 12, 16, 17)**: The *bēma* was a raised stone platform in the agora (marketplace) where official Roman business was conducted and judicial decisions were rendered.\n\n**\"A message and names\" (v. 15)**: Gallio uses the term *logos* dismissively. To a Roman magistrate, the fine points of Jewish messianic claims were merely \"words\" or \"talk\" (*logos*) and semantic disputes over titles (\"names\"), rather than matters of civil law.\n\n**\"The Way\" (v. 25, 26)**: \"The Way\" (*hē hodos*) was the earliest self-designation for the movement of Jesus’s followers, likely drawing on the \"Way of the LORD\" in Isaiah and the Psalms.\n\n**\"Fervent in spirit\" (v. 25)**: The Greek *zeōn* literally means \"boiling.\" It describes an intense, bubbling enthusiasm or spiritual heat.\n\n**\"Vigorously\" (v. 28)**: The Greek *eutonōs* (from *eu* \"well\" and *tonos* \"tension/tone\") suggests a high-energy, muscular style of argumentation—he was \"putting his strength\" into the debate."
    },
    {
      "chapter": 19,
      "verses": [
        {
          "verse": 1,
          "text": "It happened that while Apollos was in Corinth, Paul traveled through the inland regions and came down to Ephesus. There he found certain disciples",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "and asked them, “Did you receive the Holy Spirit when you became believers?” They replied, “No, we have not even heard that there is a Holy Spirit.”",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "“Into what, then, were you baptized?” Paul asked. “Into John’s baptism,” they said.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Paul explained, “John baptized with a baptism of repentance, telling the people that they must believe in the one coming after him—that is, in Jesus.”",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "On hearing this, they were baptized into the name of the Lord Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "When Paul laid his hands on them, the Holy Spirit came upon them, and they began speaking in tongues and prophesying.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "There were about twelve men in all.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Paul then entered the synagogue and spoke out boldly for three months, debating and persuading them about the Kingdom of God.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "But when some grew stubborn and refused to believe—slandering “The Way” before the whole assembly—he withdrew from them. He took the disciples with him and conducted daily discussions in the lecture hall of Tyrannus.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "This continued for two years, so that everyone living in the province of Asia, both Jews and Greeks, heard the message of the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "God was performing extraordinary miracles through Paul’s hands,",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "so that even sweat-cloths or work-aprons that had touched his skin were carried to the sick; their diseases left them and the evil spirits went out of them.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then some itinerant Jewish exorcists also attempted to invoke the name of the Lord Jesus over those who had evil spirits, saying, “I adjure you by the Jesus whom Paul proclaims!”",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Seven sons of a Jewish chief priest named Sceva were doing this.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "But the evil spirit answered them, “Jesus I recognize, and Paul I know about, but you—who are you?”",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Then the man with the evil spirit leaped on them, mastered them all, and overpowered them, so that they fled out of that house naked and battered.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "This became known to everyone living in Ephesus, both Jews and Greeks. Fear fell upon them all, and the name of the Lord Jesus was held in high honor.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Many of those who had become believers came forward, openly confessing and disclosing their magical practices.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "A large number of those who had practiced the sorcerous arts collected their scrolls and burned them in the sight of everyone. When the value of these was calculated, it totaled fifty thousand silver drachmas.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "In this powerful way, the message of the Lord continued to grow and prevail.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "After these events, Paul resolved in his spirit to pass through Macedonia and Achaia and then go to Jerusalem. He said, “After I have been there, I must also see Rome.”",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "So he sent two of his assistants, Timothy and Erastus, into Macedonia, while he himself stayed in the province of Asia for a while longer.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "About that time, a major disturbance erupted concerning “The Way.”",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "A man named Demetrius, a silversmith who made silver models of the shrines of Artemis, provided no small amount of business for the craftsmen.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "He gathered these craftsmen together, along with workers in related trades, and said, “Men, you know that our prosperity comes from this business.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "And you see and hear that not only in Ephesus but in almost the whole province of Asia, this Paul has persuaded and led away a substantial crowd, saying that gods made by human hands are not gods at all.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "There is a danger not only that our trade will fall into disrepute, but also that the temple of the great goddess Artemis will be counted as nothing, and she whom all Asia and the whole world worships will be stripped of her majesty.”",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "When they heard this, they were filled with rage and began shouting, “Great is Artemis of the Ephesians!”",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "The city was filled with confusion. They rushed together into the theater, dragging along Gaius and Aristarchus, Macedonians who were Paul’s travel companions.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Paul wanted to go before the assembly of the people, but the disciples would not let him.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Even some of the Asiarchs—high-ranking provincial officials who were his friends—sent word to him, pleading with him not to venture into the theater.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Now some were shouting one thing and some another, for the assembly was in total chaos, and the majority did not even know why they had come together.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "Some of the crowd prompted Alexander, whom the Jews had pushed forward. Alexander motioned with his hand, wanting to make a defense to the people.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "But when they recognized that he was a Jew, a single cry rose from them all as they shouted for about two hours, “Great is Artemis of the Ephesians!”",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "Finally, the town clerk quieted the crowd and said, “Men of Ephesus, is there anyone who does not know that the city of the Ephesians is the temple guardian of the great Artemis and of the image that fell from heaven?",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "Since these facts are undeniable, you ought to keep calm and do nothing reckless.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "For you have brought these men here, though they are neither temple-robbers nor blasphemers of our goddess.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "If, therefore, Demetrius and his fellow craftsmen have a grievance against anyone, the courts are open and there are proconsuls; let them bring charges against one another.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "But if you are seeking anything beyond that, it must be settled in the legal assembly.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "For we are actually in danger of being charged with rioting regarding today’s events, since there is no justification we can give for this disorderly commotion.”",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "And after saying this, he dismissed the assembly.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The inland regions\" (v. 1)**: The Greek *anōterika merē* (literally \"upper parts\") refers to the higher-altitude inland route to Ephesus, as opposed to the coastal road.\n\n**\"The Way\" (v. 9, 23)**: This was the earliest self-designation for the movement of Jesus-followers, likely emphasizing their lifestyle and the \"way of salvation.\" It is capitalized here as a proper title.\n\n**\"Lecture hall\" (v. 9)**: The Greek *scholē* is the origin of the English word \"school,\" but in the first century, it specifically referred to a place of professional or philosophical lectures.\n\n**\"Sweat-cloths or work-aprons\" (v. 12)**: *Soudaria* (Latin *sudarium*) were cloths for wiping perspiration (often tied around the head), and *simikinthia* (Latin *semicinctium*) were the linen aprons used by workers or artisans. Using these specific terms highlights Paul's status as a manual laborer (tentmaker).\n\n**\"Jesus I recognize, and Paul I know about\" (v. 15)**: The Greek uses two different verbs: *ginōskō* (personal, relational knowledge) for Jesus, and *epistamai* (factual acquaintance or being \"up on\" someone) for Paul. The spirit acknowledges Jesus's authority and Paul's reputation but denies the exorcists any standing.\n\n**\"Magical practices / sorcerous arts\" (v. 18-19)**: *Praxeis* (v. 18) often refers to \"spells\" or \"magical formulas\" in this context. *Ta perierga* (v. 19) literally means \"the meddlesome things,\" a standard technical term for magic in the Greco-Roman world, implying interference in matters that belong to the gods.\n\n**\"Asiarchs\" (v. 31)**: These were the \"leading men of Asia,\" a specific group of wealthy, influential citizens who held annual religious and civic offices in the province. \n\n**\"Temple guardian\" (v. 35)**: The Greek *neōkoron* (literally \"temple-sweeper\") was a highly coveted title for a city that served as the official custodian of a major deity's temple.\n\n**\"The image that fell from heaven\" (v. 35)**: *Diopetous* literally means \"fallen from Zeus.\" This likely referred to a meteorite that the Ephesians believed was a divinely crafted statue of Artemis.\n\n**\"Legal assembly\" (v. 39)**: The *ennomos ekklēsia* was the official, constitutionally sanctioned meeting of the city’s citizens, as opposed to the spontaneous and \"illegal\" riot (*stasis*) described in v. 40. I have translated *ekklēsia* as \"assembly\" throughout this section to maintain its civic meaning in a Greek city-state."
    },
    {
      "chapter": 20,
      "verses": [
        {
          "verse": 1,
          "text": "After the uproar had subsided, Paul sent for the disciples and, after encouraging them, said his farewells and departed to travel into Macedonia.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He passed through those regions, giving the people there much encouragement through his teaching, and eventually arrived in Greece.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "He stayed there for three months, but when a plot was formed against him by the Judeans just as he was about to set sail for Syria, he decided to return by way of Macedonia.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "He was accompanied by Sopater son of Pyrrhus from Beroea, Aristarchus and Secundus from Thessalonica, Gaius from Derbe, Timothy, and Tychicus and Trophimus from the province of Asia.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "These men went on ahead and were waiting for us at Troas.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But we sailed away from Philippi after the Days of Unleavened Bread, and in five days we reached them at Troas, where we stayed for seven days.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "On the first day of the week, when we were gathered together to break bread, Paul began a dialogue with them. Since he intended to leave the next day, he extended his discourse until midnight.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Now there were many lamps in the upstairs room where we were gathered.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "A certain young man named Eutychus was sitting in the window, and as Paul’s discourse went on and on, he was overcome by a deep sleep. While fast asleep, he fell from the third story down to the ground and was picked up dead.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "But Paul went down, threw himself upon him, and took him in his arms, saying, “Do not be alarmed, for his life is in him.”",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then Paul went back upstairs, broke the bread and ate, and after conversing with them for a long time until daybreak, he finally departed.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "They took the lad away alive and were comforted beyond measure.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "We went on ahead to the ship and set sail for Assos, intending to take Paul aboard there; for he had arranged it this way, intending to travel there himself on foot.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "When he met us at Assos, we took him aboard and went to Mitylene.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Sailing from there, we arrived opposite Chios the following day. The day after that, we crossed over to Samos, and on the next day, we came to Miletus.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For Paul had decided to sail past Ephesus so that he would not have to spend time in the province of Asia; he was hurrying so that, if it were possible for him, he could be in Jerusalem by the day of Pentecost.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "From Miletus, he sent word to Ephesus and summoned the elders of the church.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "When they arrived, he said to them: “You yourselves know how I lived among you the entire time from the first day I set foot in Asia,",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "serving as a slave to the Lord with all humility and with tears and trials that came upon me through the plots of the Judeans.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "You know that I did not shrink back from declaring to you anything that was profitable, teaching you both publicly and from house to house,",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "solemnly testifying to both Jews and Greeks regarding repentance toward God and faith in our Lord Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "“And now, look—compelled by the Spirit, I am on my way to Jerusalem, not knowing what will happen to me there,",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "except that the Holy Spirit solemnly warns me in city after city that imprisonment and afflictions await me.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "But I do not consider my life of any account as precious to myself, if only I may finish my course and the ministry that I received from the Lord Jesus: to solemnly testify to the Good News of the grace of God.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "“And now, look—I know that none of you among whom I went about proclaiming the Kingdom will ever see my face again.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "Therefore, I testify to you this very day that I am clean of the blood of all men.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "For I did not shrink back from declaring to you the whole purpose of God.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Keep watch over yourselves and over all the flock, among whom the Holy Spirit has appointed you as overseers to shepherd the church of God, which he acquired through the blood of his own.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "“I know that after my departure savage wolves will come in among you, not sparing the flock.",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "Even from your own number, men will arise speaking distorted things to draw away the disciples after them.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Therefore, be alert! Remember that for three years, night and day, I never stopped warning each one of you with tears.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "“And now I entrust you to God and to the Logos of his grace, which is able to build you up and give you the inheritance among all those who are sanctified.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "I coveted no one’s silver or gold or clothing.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "You yourselves know that these hands of mine served my own needs and those who were with me.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "In everything I have shown you that by laboring in this way, it is necessary to help the weak, remembering the words of the Lord Jesus, for he himself said, ‘It is more blessed to give than to receive.’”",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "When he had said these things, he knelt down with them all and prayed.",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "There was much weeping by everyone as they threw their arms around Paul’s neck and kissed him repeatedly,",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "grieving most of all over the word he had spoken—that they would never see his face again. Then they escorted him to the ship.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Break bread\" (v. 7)**: The Greek *klasai arton* refers to more than a common meal; in the context of the \"first day of the week\" (the Christian day of assembly), it carries Eucharistic and communal weight for the early church.\n\n**\"Dialogue\" / \"Discourse\" (v. 7, 9)**: The Greek *dielegeto* (from which we get \"dialogue\") suggests an interactive discussion or reasoning session rather than a modern one-way sermon.\n\n**\"Life\" (v. 10)**: The Greek *psychē* can mean \"soul\" or \"life.\" In this context, echoing the miracles of Elijah and Elisha, it refers to the vital life-force returning to or remaining in the young man.\n\n**\"Serving as a slave\" (v. 19)**: The verb *douleuōn* denotes the service of a *doulos* (slave). Paul is not merely \"serving\" in a general sense; he is emphasizing his total subjection to the Lord's will.\n\n**\"Shrink back\" (v. 20, 27)**: The verb *hypostellō* was used of drawing back in fear or furling sails. Paul uses it to emphasize his courage and transparency in his mission.\n\n**\"Compelled by the Spirit\" (v. 22)**: *Dedemenos tō pneumati* literally means \"bound by the spirit.\" It suggests a divine internal pressure or necessity that Paul feels, overriding his own safety.\n\n**\"Clean of the blood of all\" (v. 26)**: This is a strong allusion to the \"watchman\" imagery in Ezekiel 3:18-21 and 33:1-9. If the watchman warns the people, their blood is not on his hands. Paul is asserting he has fulfilled his prophetic duty.\n\n**\"Overseers\" (v. 28)**: The term *episkopous* refers to those with the responsibility of watching over a community. It is used here interchangeably with the functions of \"elders\" (*presbyterous*, v. 17) and \"shepherding.\"\n\n**\"The blood of his own\" (v. 28)**: The Greek *dia tou haimatos tou idiou* is grammatically ambiguous. It could mean \"through his own blood\" (referring to God's blood, a very rare and startling image) or \"through the blood of His own [Son].\" Given the context of early Christian liturgical language, \"His own\" was often used as a term of endearment for a son. The translation preserves the ambiguity while pointing toward the costliness of the acquisition.\n\n**\"Logos\" (v. 32)**: As noted in the guidelines, *Logos* represents the divine, creative, and sustaining \"Word\" or \"Reason\" of God. Entrusting them to the \"Logos of His grace\" implies both the message of the Gospel and the personified power of God's wisdom.\n\n**\"More blessed to give than to receive\" (v. 35)**: This is an *agraphon*—a saying of Jesus not recorded in the four Gospels but preserved in the oral tradition of the early church. It reflects the \"Aramaic substratum\" of Jesus's wisdom teachings."
    },
    {
      "chapter": 21,
      "verses": [
        {
          "verse": 1,
          "text": "When we had finally torn ourselves away from them and set sail, we ran a straight course and came to Cos, then on the following day to Rhodes, and from there to Patara.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Finding a ship that was crossing over to Phoenicia, we went aboard and set out to sea.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "After sighting Cyprus and leaving it behind on our left, we sailed on toward Syria and put in at Tyre, for the ship was to unload its cargo there.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "We sought out the disciples and stayed there for seven days. Through the Spirit, they kept telling Paul not to set foot in Jerusalem.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But when our time there was finished, we left and continued our journey. All of them, including wives and children, escorted us until we were outside the city. We knelt down on the beach and prayed,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "said our farewells to one another, and went up into the ship; they, however, returned to their own homes.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Completing the voyage from Tyre, we arrived at Ptolemais, where we greeted the brothers and sisters and stayed with them for one day.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "On the next day we left and came to Caesarea, and entering the house of Philip the evangelist, who was one of the Seven, we stayed with him.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Now this man had four unmarried daughters who possessed the gift of prophecy.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "While we were staying there for several days, a prophet named Agabus came down from Judea.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "He came to us, took Paul’s belt, and bound his own feet and hands, saying, “The Holy Spirit says this: ‘The man who owns this belt will be bound this way in Jerusalem by the Jews and handed over into the hands of the Gentiles.’”",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "When we heard this, both we and the local people pleaded with him not to go up to Jerusalem.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then Paul answered, “What are you doing, weeping and crushing my heart? For I am ready not only to be bound, but even to die in Jerusalem for the sake of the name of the Lord Jesus.”",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Since he would not be persuaded, we fell silent, saying only, “The Lord’s will be done.”",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "After these days, we packed our gear and began the ascent to Jerusalem.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "Some of the disciples from Caesarea also went with us, bringing us to the house of Mnason of Cyprus, an early disciple, with whom we were to stay.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "When we arrived in Jerusalem, the brothers and sisters welcomed us gladly.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "On the following day, Paul went in with us to see James, and all the elders were present.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "After greeting them, he related one by one the things God had done among the nations through his ministry.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "When they heard it, they glorified God and said to him, “You see, brother, how many tens of thousands there are among the Jews who have believed, and they are all zealots for the Law.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "They have been informed about you—that you are teaching all the Jews living among the nations to commit apostasy against Moses, telling them not to circumcise their children or to walk according to our ancestral customs.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "What, then, is to be done? They will certainly hear that you have come.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Therefore, do what we tell you: We have four men here who have taken a vow.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Take them, purify yourself along with them, and pay their expenses so that they can have their heads shaved. Then everyone will know that there is no truth in the reports they heard about you, but that you yourself live in conformity with the Law.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "But concerning the Gentiles who have believed, we have sent a letter with our judgment: that they should guard themselves against what has been sacrificed to idols, from blood, from what has been strangled, and from sexual immorality.”",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Then Paul took the men, and the next day, after purifying himself along with them, he entered the temple to announce when the days of purification would be completed and the offering presented for each one of them.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "When the seven days were almost over, the Jews from the province of Asia saw him in the temple. They stirred up the whole crowd and seized him,",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "shouting, “Men of Israel, help! This is the man who teaches everyone everywhere against our people, our Law, and this place! What is more, he has even brought Greeks into the temple and has defiled this holy place!”",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "(For they had previously seen Trophimus the Ephesian in the city with him and assumed that Paul had brought him into the temple.)",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "The whole city was provoked, and the people came running together. They seized Paul and dragged him out of the temple, and immediately the doors were shut.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "While they were trying to kill him, a report went up to the commander of the Roman cohort that all Jerusalem was in a state of chaos.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "He immediately took soldiers and centurions and ran down to the crowd. When they saw the commander and the soldiers, they stopped beating Paul.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "Then the commander came up, arrested him, and ordered him to be bound with two chains. He began inquiring who he was and what he had done.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Some in the crowd were shouting one thing and some another; since the commander could not get the facts straight because of the uproar, he ordered him to be brought into the barracks.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "When Paul reached the steps, he actually had to be carried by the soldiers because of the violence of the mob,",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "for the mass of people kept following and screaming, “Away with him!”",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "Just as he was about to be led into the barracks, Paul said to the commander, “Is it permitted for me to say something to you?” He replied, “Do you know Greek?",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "Then you aren't the Egyptian who some time ago started a rebellion and led four thousand men of the Dagger-Men out into the wilderness?”",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "Paul answered, “I am a Jew, a Tarsian from Cilicia, a citizen of no obscure city. I beg you, allow me to speak to the people.”",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "When he had given permission, Paul stood on the steps and motioned with his hand to the people. When a great silence had fallen, he addressed them in the Aramaic dialect:",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Torn ourselves away\" (v. 1)**: The Greek *apospasthentas* is a strong term (from *apospao*) suggesting a forceful or painful separation, rather than a casual departure. It conveys the emotional weight of Paul’s final goodbye to the Ephesian elders in the previous chapter.\n\n**\"Unmarried daughters\" (v. 9)**: While traditionally rendered \"virgins,\" the focus in this context—given the mention of their father’s house and their prophetic role—is likely their status as unmarried women dedicated to the community’s ministry.\n\n**\"Crushing my heart\" (v. 13)**: The Greek *synthryptontes* means to break into pieces or crush. \"Breaking my heart\" is the common English idiom, but \"crushing\" captures the intensity of the verb more accurately.\n\n**\"Tens of thousands\" (v. 20)**: The Greek *myriades* refers specifically to groups of ten thousand. Using \"thousands\" (as many translations do) significantly understates the scale of the Jewish Christian movement in Jerusalem described by James.\n\n**\"Apostasy\" (v. 21)**: The Greek *apostasian* is a technical religious term for a total desertion or rebellion. The rumors weren't just that Paul was being flexible, but that he was actively teaching Jews to \"revolt\" against the Mosaic covenant.\n\n**\"Commander\" (v. 31)**: The Greek *chiliarchos* literally means \"leader of a thousand.\" In the Roman military context, this was a Military Tribune.\n\n**\"Dagger-Men\" (v. 38)**: The Greek *sikariōn* refers to the *Sicarii*, a radical faction of Jewish zealots known for carrying concealed daggers (*sicae*) to assassinate Roman collaborators in crowds. Using \"assassins\" (traditional) loses the specific historical and political identity of this group.\n\n**\"Aramaic dialect\" (v. 40)**: The Greek *Hebraïdi dialektō* literally means \"Hebrew dialect,\" but in the first century, this almost certainly referred to Aramaic, the common tongue of Palestinian Jews, rather than biblical Hebrew. Addressing the mob in their native tongue was a strategic move to gain their attention and respect."
    },
    {
      "chapter": 22,
      "verses": [
        {
          "verse": 1,
          "text": "\"Brothers and fathers, listen now to the defense I present to you.\"",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "When they heard him addressing them in the Hebrew language, they became even more quiet. Then he said:",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "\"I am a Jewish man, born in Tarsus of Cilicia, but brought up in this very city. At the feet of Gamaliel, I was educated with strict precision in our ancestral law, being a zealot for God just as all of you are today.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "I persecuted this Way to the point of death, binding both men and women and handing them over to prisons,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "as the high priest and the whole council of elders can testify for me. I even received letters from them to the brothers in Damascus, and I was traveling there to bring those who were there back to Jerusalem in chains so they could be punished.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "\"As I was on my journey and approaching Damascus about noon, suddenly a blinding radiance of light from heaven flashed all around me.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "I fell to the ground and heard a voice saying to me, 'Saul, Saul, why are you persecuting me?'",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "I answered, 'Who are you, Lord?' and he said to me, 'I am Jesus the Nazarene, whom you are persecuting.'",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Now those who were with me saw the light, but they did not understand the voice of the one speaking to me.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "I said, 'What should I do, Lord?' The Lord said to me, 'Get up and go into Damascus, and there you will be told about everything you have been assigned to do.'",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Because I could not see due to the intensity of that light’s glory, I was led by the hand by my companions and entered Damascus.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "\"A certain Ananias, a man who was devout according to the law and well-regarded by all the Jews living there,",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "came to me, stood by me, and said, 'Brother Saul, recover your sight!' And at that very moment, I looked up and saw him.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Then he said, 'The God of our fathers has appointed you to know his will, to see the Righteous One, and to hear a voice from his own mouth,",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "because you will be a witness for him to all people of what you have seen and heard.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And now, why do you delay? Get up, be baptized, and wash away your sins, calling upon his name.'",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "\"After I had returned to Jerusalem and was praying in the temple, I fell into a trance",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "and saw him saying to me, 'Hurry! Get out of Jerusalem quickly, because they will not accept your testimony about me.'",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And I said, 'Lord, they themselves know that in synagogue after synagogue I was the one imprisoning and beating those who believe in you.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "And when the blood of Stephen, your witness, was being shed, I myself was standing there approving and guarding the cloaks of those who were killing him.'",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "But he said to me, 'Go, for I will send you far away to the Gentiles.'\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "They listened to him up to this point, but then they raised their voices, shouting, \"Rid the earth of such a man! He is not fit to live!\"",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "As they were screaming, tossing off their cloaks, and throwing dust into the air,",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "the tribune ordered him to be brought into the barracks. He directed that Paul be examined under the lash so he could find out the reason they were shouting against him like this.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "But as they stretched him out with leather straps, Paul said to the centurion standing there, \"Is it legal for you to scourge a man who is a Roman citizen and uncondemned?\"",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "When the centurion heard this, he went to the tribune and reported it, saying, \"What are you about to do? This man is a Roman citizen.\"",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "So the tribune went and asked him, \"Tell me, are you a Roman citizen?\" He said, \"Yes.\"",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "The tribune responded, \"I purchased this citizenship for a very large sum of money.\" Paul said, \"But I was actually born a citizen.\"",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Immediately, those who were about to examine him backed away. Even the tribune was alarmed, realizing that he had bound a Roman citizen.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "The next day, wanting to know the exact reason why Paul was being accused by the Jews, the tribune released him and ordered the chief priests and the entire Sanhedrin to assemble. He then brought Paul down and had him stand before them.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"The Hebrew language\" (v. 2)**: The Greek *tē Hebraïdi dialektō* likely refers to Aramaic, the Semitic vernacular of first-century Judean Jews, rather than biblical Hebrew. However, the author emphasizes \"Hebrew\" to highlight Paul’s cultural and ethnic identification with his audience, a key theme in his defense.\n\n**\"Zealot\" (v. 3)**: The Greek *zēlōtēs* carries more weight than the modern \"zealous.\" In this context, it evokes the tradition of Phinehas and Elijah—a fierce, even violent, devotion to the purity of the Law and the honor of God.\n\n**\"This Way\" (v. 4)**: \"The Way\" (*hē hodos*) was the earliest self-designation of the Jesus movement, likely drawing on Isaiah’s \"Way of the LORD.\" Capitalizing it identifies it as a specific movement.\n\n**\"The intensity of that light’s glory\" (v. 11)**: The Greek *doxa* (glory) here refers to the physical weight and blinding brilliance of the divine radiance.\n\n**\"The Righteous One\" (v. 14)**: *Ton dikaion* is used here as a specific Messianic title, emphasizing Jesus's innocence and his status as the promised servant of God (cf. Isaiah 53:11).\n\n**\"Witness\" (v. 20)**: The Greek *martys* primarily means \"witness\" in a legal or testimonial sense. While it is the root of the English \"martyr,\" the transition to that specific meaning (one who dies for their faith) was only just beginning. Stephen is a \"witness\" whose testimony cost him his life.\n\n**\"Tribune\" (v. 24)**: A *chiliarchos* was a Roman military commander in charge of a cohort (roughly 1,000 men).\n\n**\"Uncondemned\" (v. 25)**: The Greek *akatakriton* is a technical legal term. Under the *Lex Valeria* and *Lex Porcia*, it was strictly illegal to scourge a Roman citizen, especially without a formal trial and conviction.\n\n**\"Citizenship\" (v. 28)**: The Greek *politeia* refers to the rights and status of a citizen. The tribune’s comment about the \"large sum\" reflects the historical practice under the Emperor Claudius, where Roman citizenship was frequently sold by corrupt officials. Paul’s claim to be \"born a citizen\" indicates his family had held this status for at least a generation, placing him in a higher social strata than the tribune."
    },
    {
      "chapter": 23,
      "verses": [
        {
          "verse": 1,
          "text": "Paul fixed his gaze on the Council and said, “Brothers, I have conducted my life as a citizen before God in all good conscience to this very day.”",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "At this, the high priest Ananias ordered those standing near Paul to strike him on the mouth.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Then Paul said to him, “God is about to strike you, you whitewashed wall! Do you sit there judging me according to the Law, yet in violation of the Law you order me to be struck?”",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Those standing by said, “Do you dare to insult God’s high priest?”",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Paul replied, “I did not know, brothers, that he was the high priest; for it is written: *You shall not speak evil of a ruler of your people.*”",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Realizing that one part of the Council were Sadducees and the other Pharisees, Paul shouted out in the Council chamber, “Brothers, I am a Pharisee, a son of Pharisees! It is concerning the hope of the resurrection of the dead that I am on trial!”",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "When he said this, a dissension broke out between the Pharisees and the Sadducees, and the assembly was split.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For the Sadducees say there is no resurrection, nor angel, nor spirit, but the Pharisees acknowledge them all.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "A great clamor arose, and some of the scribes from the party of the Pharisees stood up and argued heatedly, “We find nothing wrong with this man! What if a spirit or an angel has spoken to him?”",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "As the dissension became violent, the commander, fearing that Paul would be torn to pieces by them, ordered the troops to go down, take him by force from their midst, and bring him into the barracks.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "That following night, the Lord stood by Paul and said, “Take courage! For just as you have solemnly testified about me in Jerusalem, so you must also bear witness in Rome.”",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "When day broke, a group of Jews formed a conspiracy and bound themselves under a curse, swearing that they would neither eat nor drink until they had killed Paul.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "There were more than forty who had joined this conspiracy.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "They went to the chief priests and the elders and said, “We have bound ourselves under a solemn curse to taste nothing until we have killed Paul.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Now then, you and the Council should notify the commander to bring him down to you, as though you intend to determine his case more accurately. We are ready to do away with him before he even gets close.”",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But the son of Paul’s sister heard about the ambush. He went to the barracks, entered, and reported it to Paul.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "Paul called one of the centurions and said, “Take this young man to the commander, for he has something to report to him.”",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "So the centurion took him and brought him to the commander, saying, “The prisoner Paul called me and asked me to bring this young man to you, as he has something to tell you.”",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "The commander took him by the hand, withdrew with him privately, and asked, “What is it that you have to report to me?”",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "He said, “The Jews have agreed to ask you to bring Paul down to the Council tomorrow, as though they were going to inquire more accurately about him.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Do not let them persuade you, for more than forty of them are lying in wait for him. They have bound themselves under a curse neither to eat nor drink until they have done away with him. They are ready even now, just waiting for your consent.”",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "The commander dismissed the young man, instructing him, “Do not tell anyone that you have disclosed this to me.”",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Then he called two of the centurions and said, “Get two hundred soldiers ready to march to Caesarea by nine tonight, along with seventy horsemen and two hundred spearmen.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Provide mounts for Paul to ride so that he may be brought safely to Felix the Governor.”",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "He wrote a letter to this effect:",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "“Claudius Lysias, to His Excellency, Governor Felix: Greetings.",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "This man was seized by the Jews and was about to be killed by them when I arrived with the troops and rescued him, having learned that he is a Roman citizen.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Wanting to know the exact charge they were bringing against him, I brought him down to their Council.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "I found that he was being accused concerning questions of their own law, but there was no charge against him deserving death or imprisonment.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "When it was reported to me that there would be a plot against the man, I sent him to you at once, also ordering his accusers to state their case against him before you.”",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "So the soldiers, according to their orders, took Paul and brought him by night to Antipatris.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "The next day, they let the horsemen ride on with him while they returned to the barracks.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "When the horsemen arrived in Caesarea and delivered the letter to the governor, they also presented Paul to him.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "After reading the letter, the governor asked what province he was from. Learning that he was from Cilicia,",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "he said, “I will give you a full hearing when your accusers also arrive.” He then ordered that Paul be kept under guard in Herod’s palace.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Conducted my life as a citizen\" (v. 1)**: The Greek verb *πεπολίτευμαι* (from *politeuomai*) relates to one's conduct as a citizen (*polites*) or fulfilling public/civic duties. Paul is not just saying he \"lived,\" but that he fulfilled his obligations toward God’s \"commonwealth\" or \"polity.\"\n\n**\"Whitewashed wall\" (v. 3)**: This is a metaphor for hypocrisy, likely alluding to Ezekiel 13:10–15. A wall that is structurally unsound but covered in white plaster looks stable and pure but is ready to collapse. It carries a heavy irony in a trial concerning the \"Law.\"\n\n**\"Acknowledge them all\" (v. 8)**: The Greek *τὰ ἀμφότερα* literally means \"both,\" yet three things are listed: resurrection, angels, and spirits. In Koine Greek, \"both\" can group items into two categories. Here, the two categories are likely (1) the resurrection of the body and (2) the existence of spiritual beings (whether angels or spirits).\n\n**\"Commander\" (v. 10, 15, etc.)**: The Greek *χιλίαρχος* (chiliarch) refers to a Roman military tribune, the commander of a cohort (roughly 1,000 men). \"Commander\" captures his authority over the \"barracks\" (the Fortress of Antonia) better than the more obscure \"tribune.\"\n\n**\"Bound themselves under a curse\" (v. 12, 14, 21)**: The Greek *ἀνεθεμάτισαν* refers to the *anathema*—placing oneself under a divine ban of destruction. They were literally asking God to destroy them if they did not kill Paul.\n\n**\"Spearmen\" (v. 23)**: The Greek *δεξιολάβους* is a rare term whose precise meaning is debated. It literally means \"right-hand takers.\" While it may refer to light infantry or bodyguards, \"spearmen\" is the consensus understanding for this type of auxiliary support unit.\n\n**\"Nine tonight\" (v. 23)**: The Greek is \"the third hour of the night.\" Since the Jewish/Roman night began at 6:00 PM, the third hour is 9:00 PM.\n\n**\"Having learned that he is a Roman citizen\" (v. 27)**: In the Greek text, Lysias positions the rescue *after* his discovery of Paul's citizenship to make himself look better to the Governor. In reality (as recorded in chapter 22), he discovered the citizenship only after he had already arrested and nearly flogged Paul. The translation preserves this subtle \"official spin.\"\n\n**\"Herod's palace\" (v. 35)**: The Greek *πραιτωρίῳ* (Praetorium) refers to the governor’s official residence. Since Felix used the palace originally built by Herod the Great in Caesarea as his headquarters, \"Herod's palace\" is the most contextually descriptive rendering."
    },
    {
      "chapter": 24,
      "verses": [
        {
          "verse": 1,
          "text": "Five days later, the high priest Ananias arrived with several elders and a professional legal advocate named Tertullus. They presented their formal case against Paul to the governor.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "When Paul was summoned, Tertullus began the prosecution, saying: “Because of you, we enjoy a deep peace, and reforms are being brought to this nation through your foresight.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "At all times and in all places, most excellent Felix, we receive this with profound gratitude.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But so as not to impose on your time further, I beg you in your characteristic fairness to hear us briefly.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "“For we have found this man to be a plague—a source of insurrection among all the Jews throughout the civilized world and a ringleader of the Nazarene sect.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "He even attempted to desecrate the Temple, so we seized him.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "By examining him yourself, you will be able to confirm all these charges we are bringing against him.”",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "The Jews also joined in the attack, asserting that these things were so.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "When the governor signaled for him to speak, Paul replied: “Since I know you have been a judge over this nation for many years, I confidently offer my defense.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "You can easily verify that it has not been more than twelve days since I went up to Jerusalem to worship.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "They did not find me debating with anyone in the Temple or inciting a mob—neither in the synagogues nor throughout the city.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Nor can they provide evidence to you for the charges they are now bringing against me.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "“However, I do confess this to you: according to The Way (which they call a sect), I worship the God of our ancestors. I believe everything written in the Law and the Prophets,",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "and I have the same hope in God that these men themselves entertain—that there is going to be a resurrection of both the righteous and the unrighteous.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For this reason, I myself strive always to maintain a clear conscience before God and all people.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "“After several years, I arrived to bring charitable gifts to my nation and to present offerings.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "While I was doing this, they found me ritually purified in the Temple, without a crowd and without an uproar.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "But there were some Jews from the province of Asia—they ought to be here before you to bring charges if they have anything against me.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Or let these men here say what crime they found when I stood before the Council,",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "other than this one cry I shouted while standing among them: ‘It is concerning the resurrection of the dead that I am on trial before you today!’”",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Felix, however, adjourned the proceedings. Having a more accurate knowledge of The Way, he said, “When Lysias the commander comes down, I will decide your case.”",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "He ordered the centurion to keep Paul in custody but to allow him some liberty and not to prevent any of his own people from attending to his needs.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "After some days, Felix arrived with his wife Drusilla, who was Jewish. He sent for Paul and listened to him speak about faith in Christ Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "But as Paul discussed righteousness, self-mastery, and the coming judgment, Felix became terrified and replied, “For now, you may go. When I find a convenient time, I will summon you again.”",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "At the same time, he was hoping that Paul would give him a bribe; for this reason, he used to send for him quite often to converse with him.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "When two years had passed, Felix was succeeded by Porcius Festus. Since Felix wanted to grant the Jews a favor, he left Paul in prison.",
          "paragraphStart": false
        }
      ],
      "notes": "**“Legal advocate” (v. 1)**: The Greek *rhētōr* refers to a professional orator or lawyer. In this Roman provincial context, Tertullus is acting as a prosecutor trained in Roman forensic rhetoric.\n\n**“Foresight” (v. 2)**: The Greek *pronoia* (providence/foresight) was a term of high praise in the Greco-Roman world, often attributed to deities or exceptionally wise rulers. Tertullus is using standard high-flattery (*captatio benevolentiae*) to win the governor’s favor.\n\n**“Plague” (v. 5)**: The Greek *loimos* literally means \"pestilence.\" Tertullus is not just calling Paul a \"troublemaker\"; he is describing him as a contagious disease that threatens the health of the Roman social order.\n\n**“Civilized world” (v. 5)**: *Oikoumenē* refers to the inhabited or Greco-Roman world. To a Roman official, this specifically meant the Empire.\n\n**“Sect” (v. 5, 14)**: The Greek *haeresis* (from which we get \"heresy\") simply meant a school of thought or a faction (like the Pharisees or Sadducees). In a legal context, it implies a group that has broken away from the mainstream. Paul’s response in v. 14 indicates he views \"The Way\" not as a breakaway faction, but as the true fulfillment of ancestral Judaism.\n\n**“Textual Note” (vv. 6–8)**: Most modern critical texts (SBLGNT/NA28) omit the end of verse 6, all of verse 7, and the beginning of verse 8 (which involve Lysias taking Paul away with \"great violence\"). These are absent from the earliest and best manuscripts.\n\n**“Self-mastery” (v. 25)**: *Enkrateia* (often \"self-control\") was a cardinal virtue in Greek ethics, referring to the power one has over one's own desires and impulses. This would have been a pointed topic to discuss with Felix, who was known for his illicit marriage to Drusilla and his general reputation for cruelty and lust.\n\n**“Bribe” (v. 26)**: The Greek *chrēmata* (money/wealth) in this context refers to a payoff. Roman law (the *Lex Julia de Repetundis*) strictly forbade governors from taking bribes, making Felix's hope particularly corrupt.\n\n**“Grant the Jews a favor” (v. 27)**: The Greek phrase *charita katathesthai* is an idiom for \"storing up a favor\" or \"placing someone in one's debt.\" Felix leaves Paul imprisoned as a political deposit to mitigate Jewish resentment toward his administration."
    },
    {
      "chapter": 25,
      "verses": [
        {
          "verse": 1,
          "text": "Three days after Festus had arrived in the province to assume his command, he went up from Caesarea to Jerusalem.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "There, the chief priests and the leading men of the Jews officially laid their case against Paul before him. They began appealing to him,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "asking as a favor—at Paul’s expense—that Festus would have him transferred to Jerusalem. All the while, they were preparing an ambush to murder him along the road.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Festus replied that Paul was being kept under guard in Caesarea, and that he himself intended to return there shortly.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "“Therefore,” he said, “let the authorities among you go down with me, and if there is anything out of order with the man, let them bring their formal charges against him.”",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "After staying among them no more than eight or ten days, he went down to Caesarea. The next day, he took his seat on the tribunal and ordered Paul to be brought in.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "When Paul arrived, the Jews who had come down from Jerusalem stood around him, bringing many serious charges that they were unable to prove.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Paul said in his own defense, “I have committed no offense against the law of the Jews, or against the temple, or against Caesar.”",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "But Festus, wishing to curry favor with the Jews, answered Paul: “Are you willing to go up to Jerusalem to be tried there before me on these charges?”",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Paul replied, “I am standing before Caesar’s tribunal; this is where I must be tried. I have done no wrong to the Jews, as you yourself know very well.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "If, then, I am a lawbreaker and have done anything deserving of death, I do not fix my mind on escaping it. But if there is nothing to the things they accuse me of, no one can hand me over to them as a political favor. I appeal to Caesar!”",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Then Festus, after conferring with his council, replied, “You have appealed to Caesar; to Caesar you shall go.”",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "After several days had passed, King Agrippa and Bernice arrived in Caesarea to pay their respects to Festus.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Since they were staying there for a number of days, Festus laid Paul’s case before the king, saying, “There is a man here whom Felix left behind as a prisoner.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "When I was in Jerusalem, the chief priests and the elders of the Jews officially informed me about him, demanding a sentence of condemnation against him.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "I answered them that it is not the Roman custom to hand over any person as a favor before the accused meets the accusers face to face and receives an opportunity to defend himself against the charge.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "So when they gathered here, I did not delay; the next day I took my seat on the tribunal and ordered the man to be brought in.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "When the accusers stood up, they did not bring any of the charges of wrongdoing that I was expecting.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Instead, they had certain points of dispute with him regarding their own religion and regarding a certain Jesus, who is dead, but whom Paul claimed was alive.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Since I was at a loss as to how to investigate such matters, I asked if he was willing to go to Jerusalem to be tried there concerning these things.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "But when Paul appealed to be kept in custody for the decision of His Imperial Majesty, I ordered him to be held until I could send him to Caesar.”",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Agrippa said to Festus, “I have been wanting to hear the man myself.” “Tomorrow,” Festus said, “you shall hear him.”",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "So the next day, Agrippa and Bernice came with great pageantry and entered the audience hall together with the military commanders and the prominent men of the city. At the command of Festus, Paul was brought in.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Then Festus said, “King Agrippa and all you men present with us, you see this man about whom the entire Jewish community petitioned me, both in Jerusalem and here, shouting that he ought not to live any longer.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "But I found that he had done nothing deserving of death; and since he himself appealed to His Imperial Majesty, I decided to send him.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "However, I have nothing definite to write to my lord the Emperor about him. Therefore, I have brought him before all of you, and especially before you, King Agrippa, so that after this preliminary hearing has taken place, I might have something to write.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "For it seems absurd to me to send a prisoner without also specifying the charges against him.”",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Assume his command\" (v. 1)**: The Greek *eparcheia* refers to the province or the jurisdiction of a governor. In this context, it marks the formal beginning of Festus’s administration.\n\n**\"Officially laid their case\" (v. 2, 15)**: The verb *enephanisan* is a technical legal term in Koine Greek, used for making a formal report or presenting a complaint before a magistrate.\n\n**\"As a favor—at Paul's expense\" (v. 3)**: The Greek *aitoumenoi charin kat’ autou* literally means \"asking for a favor against him.\" The translation reflects the corrupt nature of the request: they are asking the judge for a \"gift\" (the prisoner’s transfer/death) which violates legal impartiality.\n\n**\"Authorities\" (v. 5)**: *Dynatoi* refers not just to \"powerful people\" but specifically to those with the official standing or capacity to act as prosecutors in a legal setting.\n\n**\"Tribunal\" (v. 6, 10, 17)**: The *bēma* was the raised platform or judicial bench where a Roman magistrate sat to render official decisions.\n\n**\"Curry favor\" (v. 9)**: The phrase *charin katathesthai* (literally \"to lay down a favor\") is an idiom for doing someone a service in order to place them in one's debt, often for political leverage.\n\n**\"Hand me over... as a political favor\" (v. 11, 16)**: The verb *charisasthai* is the verbal form of *charis* (favor/grace). Paul is pointedly calling out Festus for attempting to use a human life as a \"gift\" to appease a local constituency.\n\n**\"Religion\" (v. 19)**: *Deisidaimonias* can mean \"superstition\" (pejorative) or \"religion\" (neutral). Given that Festus is speaking to King Agrippa, who was Jewish, he likely chose a term that could be interpreted with diplomatic ambiguity, though his own Roman perspective probably leaned toward \"superstition.\"\n\n**\"His Imperial Majesty\" (v. 21, 25)**: The Greek *Sebastos* is the equivalent of the Latin *Augustus*. At this time, it was a title for Nero.\n\n**\"Pageantry\" (v. 23)**: *Phantasia* refers to an extravagant outward show or pompous display. This contrasts the worldly splendor of the Roman and Herodian officials with the captive Paul.\n\n**\"My lord the Emperor\" (v. 26)**: The Greek *kyrios* (\"lord\") was increasingly used as a divine and imperial title. Festus uses it here in its formal capacity for the Emperor (Nero).\n\n**\"Preliminary hearing\" (v. 26)**: *Anakrisis* refers specifically to a pre-trial examination used to gather evidence or clarify charges before a case was sent to a higher court."
    },
    {
      "chapter": 26,
      "verses": [
        {
          "verse": 1,
          "text": "Agrippa said to Paul, “You have permission to speak on your own behalf.” Then Paul, extending his hand in a formal gesture, began his legal defense:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "“Regarding all the accusations brought against me by the Judeans, King Agrippa, I consider myself fortunate that it is before you I am to make my defense today,",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "especially since you are an expert in all the customs and controversies of the Jewish people. Therefore, I beg you to listen to me with patience.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "All the Judeans know my way of life from my youth, which was spent from the beginning among my own nation and in Jerusalem.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "They have known me for a long time, and if they were willing to testify, they could say that I lived as a Pharisee according to the strictest sect of our religion.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And now I stand on trial because of the hope in the promise made by God to our fathers,",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "a promise which our twelve-tribe nation hopes to attain as they earnestly worship night and day. It is concerning this hope, O King, that I am being accused by Judeans.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Why is it judged unbelievable among you if God raises the dead?",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "I myself once thought it was necessary to do many things in opposition to the name of Jesus the Nazarene.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "This is exactly what I did in Jerusalem; not only did I lock up many of the holy ones in prisons by the authority I received from the chief priests, but when they were being executed, I cast my vote against them.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Throughout all the synagogues, I often punished them to try to force them to revile the Name, and in my raging fury against them, I even pursued them to foreign cities.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "While traveling to Damascus on such a mission with the authority and commission of the chief priests,",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "at midday along the road, O King, I saw a light from heaven, brighter than the sun, shining around me and those traveling with me.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "When we had all fallen to the ground, I heard a voice saying to me in the Hebrew dialect: ‘Saul, Saul, why are you persecuting me? It is hard for you to kick against the sharp goads.’",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "I said, ‘Who are you, Lord?’ and the Lord said, ‘I am Jesus, whom you are persecuting.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But get up and stand on your feet; for I have appeared to you for this purpose: to appoint you as an assistant and a witness both of the things in which you have seen me and of the things in which I will appear to you.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "I am rescuing you from your own people and from the nations—to whom I am sending you",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "to open their eyes, so that they may turn from darkness to light and from the power of Satan to God, that they may receive forgiveness of sins and a share of the inheritance among those who have been sanctified by faith in me.’",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "From that point on, King Agrippa, I was not disobedient to the heavenly vision,",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "but I began proclaiming, first to those in Damascus and in Jerusalem, then throughout the whole region of Judea and to the nations, that they must repent and turn to God, performing deeds consistent with repentance.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For these reasons, the Judeans seized me in the temple and tried to kill me with their own hands.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Having obtained the help that comes from God to this very day, I stand and witness to both small and great, saying nothing beyond what the Prophets and Moses said would happen:",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "that the Messiah must suffer, and that as the first to rise from the dead, he would proclaim light both to our people and to the nations.”",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "As he was saying these things in his defense, Festus shouted out, “You are out of your mind, Paul! Your great learning is driving you into a mania!”",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "But Paul said, “I am not out of my mind, most excellent Festus, but I am speaking words of truth and of a sound mind.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "For the king knows about these things, and I speak freely to him. I am persuaded that none of these things has escaped his notice, for this has not been done in a corner.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "King Agrippa, do you believe the Prophets? I know that you believe.”",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Agrippa said to Paul, “In such a short time, are you persuading me to act the Christian?”",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "Paul replied, “Whether in a short time or a long one, I would pray to God that not only you but also all who are listening to me today might become exactly what I am—except for these chains.”",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Then the king stood up, along with the governor and Bernice and those sitting with them.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "When they had withdrawn, they talked to one another, saying, “This man is doing nothing deserving of death or imprisonment.”",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Agrippa said to Festus, “This man could have been set free if he had not appealed to Caesar.”",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Expert\" (v. 3)**: The Greek *gnōstēn* implies someone who is an \"authorized knower\" or an initiate into the specifics of a subject. Agrippa, being a Herod, was culturally Jewish and familiar with the sectarian nuances in a way Roman governors like Festus were not.\n\n**\"Sect\" (v. 5)**: The term *hairesis* in the first century referred to a school of thought or a specific party (like the schools of philosophy). It does not yet carry the late-antique or medieval weight of \"heresy\" as a departure from an established orthodoxy.\n\n**\"Twelve-tribe nation\" (v. 7)**: The Greek *dōdekaphylon* is a rare collective noun. It emphasizes the theological unity of Israel, despite the historical \"lost\" tribes, as a single entity waiting for the fulfillment of the promise.\n\n**\"Cast my vote\" (v. 10)**: The Greek *psēphon* refers to the pebble used in voting. This suggests that Paul may have had a formal judicial role, perhaps as a member of the Sanhedrin or a similar body, rather than just being a vigilante.\n\n**\"Hebrew dialect\" (v. 14)**: *tē Hebraïdi dialektō* likely refers to Aramaic, the common tongue of Palestinian Jews, though it could refer to the Hebrew language itself. The distinction marks the intimacy and specific cultural targeting of the divine call.\n\n**\"Kick against the goads\" (v. 14)**: This is a Greek proverb (found in Aeschylus and Euripides). A \"goad\" was a sharpened stick used to drive oxen. If the ox kicked back against the goad, it only hurt itself more. It describes the futility of resisting a divine or inevitable will.\n\n**\"Assistant\" (v. 16)**: *hypēretēn* literally means an \"under-rower\" on a ship, signifying someone who works under the direction of another.\n\n**\"Share of the inheritance\" (v. 18)**: *klēron* refers to a lot or a portion assigned by divine will, evoking the division of the Promised Land among the tribes of Israel.\n\n**\"Kill me with their own hands\" (v. 21)**: The verb *diacheirisastai* is a more violent and visceral term than \"to kill.\" It implies a hands-on, manual slaying, fitting for the mob violence Paul faced in the temple.\n\n**\"Sound mind\" (v. 25)**: *sōphrosynēs* is the direct opposite of *mania*. It refers to self-control, rationality, and clarity of thought—hallmarks of Greek philosophical virtue.\n\n**\"In a short time\" (v. 28)**: The phrase *en oligō* is notoriously difficult. It can mean \"with few words,\" \"in a short time,\" or \"by a small margin.\" Given Paul's response contrasting it with *en megalō* (\"in a great/long [time/margin]\"), it likely refers to the speed or ease of the conversion process. Agrippa’s tone is likely ironic or deflective.\n\n**\"To act the Christian\" (v. 28)**: The Greek *Christianon poiēsai* (literally \"to make/do a Christian\") suggests Agrippa is commenting on Paul’s attempt to push him into a role or a identity, rather than a deep internal change. \"Christian\" was still likely a derogatory or external label at this time."
    },
    {
      "chapter": 27,
      "verses": [
        {
          "verse": 1,
          "text": "When it was decided that we should sail for Italy, they handed Paul and some other prisoners over to a centurion named Julius, of the Augustan Cohort.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "We boarded a ship from Adramyttium that was about to sail to the ports along the coast of Asia and put out to sea. Aristarchus, a Macedonian from Thessalonica, was with us.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "The next day we put in at Sidon. Julius treated Paul with great consideration, allowing him to go to his friends to receive their care.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Putting out to sea from there, we sailed under the lee of Cyprus because the winds were against us.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "After we had sailed across the open sea off Cilicia and Pamphylia, we reached Myra in Lycia.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "There the centurion found an Alexandrian ship sailing for Italy and put us on board.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For many days we sailed slowly and arrived with difficulty off Cnidus. Since the wind did not allow us to go further, we sailed under the lee of Crete off Salmone.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Coasting along it with difficulty, we came to a place called Fair Havens, near the city of Lasea.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Much time had been lost, and sailing was now dangerous because even the Fast had already passed. So Paul began to warn them,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "saying, “Men, I can see that this voyage is going to involve disaster and great loss, not only of the cargo and the ship, but also of our lives.”",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "But the centurion was more persuaded by the pilot and the ship-owner than by what Paul said.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Since the harbor was unsuitable for wintering, the majority reached a decision to put out to sea from there, hoping somehow to reach Phoenix, a harbor in Crete facing both southwest and northwest, and to winter there.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "When a moderate south wind began to blow, they thought they had achieved their purpose; they weighed anchor and began to sail close along the shore of Crete.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "But before long, a hurricane-force wind, the one called a “Northeaster,” rushed down from the island.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "The ship was caught by it and could not head into the wind, so we gave way to it and were driven along.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Running under the lee of a small island called Cauda, we were barely able to secure the ship’s boat.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "After hoisting it up, they used support cables to undergird the ship. Fearing they might run aground on the Syrtis sands, they lowered the sea-anchor and so were driven along.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Because we were being violently tossed by the storm, the next day they began to throw the cargo overboard.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "On the third day, they threw the ship’s gear overboard with their own hands.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "When neither sun nor stars appeared for many days, and the great storm continued to batter us, all hope of our being saved was finally abandoned.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Since they had gone without food for a long time, Paul stood up among them and said, “Men, you should have followed my advice not to put out to sea from Crete and so have avoided this disaster and loss.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "But now I urge you to take heart, for there will be no loss of life among you, only of the ship.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "For this very night an angel of the God to whom I belong and whom I serve stood beside me",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "and said, ‘Do not be afraid, Paul; you must stand before Caesar. And look! God has graciously granted you the lives of all who are sailing with you.’",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "So take heart, men! For I trust God that it will happen exactly as I have been told.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "But we must run aground on some island.”",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "When the fourteenth night came, as we were being driven across the Adriatic Sea, about midnight the sailors suspected they were nearing some land.",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "They took soundings and found twenty fathoms; after a short distance they took soundings again and found fifteen fathoms.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Fearing that we might run aground on the rocks, they dropped four anchors from the stern and prayed for daylight to come.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "But when the sailors tried to escape from the ship and lowered the boat into the sea under the pretext of laying out anchors from the bow,",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Paul said to the centurion and the soldiers, “Unless these men stay with the ship, you cannot be saved.”",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Then the soldiers cut the ropes of the boat and let it fall away.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "Just before daybreak, Paul urged them all to take some food, saying, “Today is the fourteenth day you have been in constant suspense, going without food and eating nothing.",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "Therefore I urge you to take some food, for this is necessary for your survival. For not a hair from the head of any of you will perish.”",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "After he said this, he took bread, gave thanks to God in the presence of them all, broke it, and began to eat.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "Then they all took heart and took food for themselves.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "(There were two hundred seventy-six of us in all on the ship.)",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "When they had eaten as much as they wanted, they lightened the ship by throwing the wheat into the sea.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "When day came, they did not recognize the land, but they noticed a bay with a beach, on which they planned to run the ship aground if they could.",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "So they cast off the anchors and left them in the sea, while at the same time loosening the ropes that held the steering oars. Then, hoisting the foresail to the wind, they headed for the beach.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "But striking a place where two seas met, they ran the vessel aground. The bow stuck fast and remained immovable, but the stern began to break up under the violence of the waves.",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "The soldiers’ plan was to kill the prisoners so that none could swim away and escape.",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "But the centurion, wanting to save Paul, kept them from their purpose. He ordered those who could swim to jump overboard first and get to land,",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "and the rest to follow, some on planks and others on pieces of the ship. And in this way, everyone was brought safely to land.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Consideration\" (v. 3)**: The Greek *philanthrōpōs* refers to more than just \"kindness\"; it denotes a civilized, humane treatment that respects the dignity of the person, often used in a social or political sense.\n\n**\"The Fast\" (v. 9)**: This refers specifically to *Yom Kippur* (the Day of Atonement). For a first-century audience, this was a chronological marker indicating that it was late September or October, a time when the Mediterranean became treacherous and eventually \"closed\" to navigation for the winter.\n\n**\"Disaster and loss\" (v. 10, 21)**: The word *hybris* usually means \"insolence\" or \"pride,\" but in nautical contexts, it refers to the \"violence\" or \"fury\" of the sea. It is paired with *zēmia* (economic or physical loss).\n\n**\"Pilot and the ship-owner\" (v. 11)**: Greek *kybernētēs* (the helmsman/navigator) and *nauklēros* (the owner or captain of the vessel). These were the technical experts whose advice carried more weight with the Roman centurion than Paul’s prophetic warning.\n\n**\"Northeaster\" (v. 14)**: The Greek *Eurakylōn* is a hybrid term combining the Greek *Eurus* (east wind) and the Latin *Aquilo* (north wind). It describes a sudden, violent Mediterranean hurricane-force wind.\n\n**\"Ship’s boat\" (v. 16, 30)**: The *skaphē* was a small dinghy usually towed behind the ship. During a storm, it had to be hoisted on board to prevent it from being smashed or filling with water and dragging the ship down.\n\n**\"Undergirding\" (v. 17)**: The term *hypozōnnuntes* refers to \"frapping\"—passing heavy cables or ropes under the hull and tightening them on deck to hold the ship's timbers together under the stress of the waves.\n\n**\"Adriatic Sea\" (v. 27)**: In the first century, the \"Adria\" referred to a much larger area of the central Mediterranean between Greece, Italy, and Africa, not just the modern Adriatic Gulf.\n\n**\"Fathoms\" (v. 28)**: An *orgyia* was the distance between a man's outstretched arms, roughly six feet. This technical maritime term is best rendered by the traditional nautical \"fathom.\"\n\n**\"Steering oars\" (v. 40)**: Ancient ships did not have a single rudder on a hinge, but two large oars (*pēdalia*) at the stern used for steering. These were lashed up when the ship was at anchor and lowered again for maneuvering.\n\n**\"Place where two seas met\" (v. 41)**: The term *topon dithalasson* likely describes a sandbar or a channel formed by currents meeting from two different directions, which caused the ship to run aground unexpectedly."
    },
    {
      "chapter": 28,
      "verses": [
        {
          "verse": 1,
          "text": "Once we had been brought safely through to shore, we then learned that the island was called Malta.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "The local people, though they did not speak Greek, showed us extraordinary kindness; they lit a fire and welcomed all of us because of the rain that had set in and the cold.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Paul had gathered a large bundle of dry brushwood and was laying it on the fire when a viper, driven out by the heat, fastened itself onto his hand.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "When the locals saw the creature hanging from his hand, they began saying to one another, “Surely this man is a murderer; though he was rescued from the sea, Justice has not allowed him to live.”",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "He, however, simply shook the creature off into the fire and suffered no ill effects.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "They were waiting for him to either swell up with inflammation or suddenly drop dead, but after waiting a long time and seeing nothing out of the ordinary happen to him, they changed their minds and began saying he was a god.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Now in the area around that place, there were lands belonging to the Chief Official of the island, a man named Publius. He welcomed us and hospitably entertained us for three days.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "It so happened that Publius’s father was lying in bed, gripped by recurring fevers and dysentery. Paul went in to see him, and after praying and laying his hands on him, he healed him.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "After this happened, the rest of the people on the island who had illnesses also came and were cured.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "They honored us with many marks of respect, and when we were setting sail, they provided us with everything we needed for our needs.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "After three months, we put out to sea in an Alexandrian ship that had wintered at the island; it featured the Twin Brothers as its figurehead.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "We put in at Syracuse and stayed there three days,",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "and from there we tacked around and arrived at Rhegium. A day later, a south wind sprang up, and on the second day we reached Puteoli.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "There we found brothers and were invited to stay with them for seven days. And so we came to Rome.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "The brothers there, having heard the news about us, came from as far as the Forum of Appius and Three Taverns to meet us. When Paul saw them, he thanked God and took courage.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "When we entered Rome, Paul was permitted to stay by himself with the soldier who was guarding him.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Three days later, he called together the leaders of the local Jews. When they had assembled, he said to them, “Brothers, though I have done nothing against our people or the customs of our ancestors, I was delivered as a prisoner from Jerusalem into the hands of the Romans.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "After they examined me, they wanted to release me because there was no ground for a death sentence in my case.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "But when the Jews objected, I was forced to appeal to Caesar—not that I had any accusation to bring against my own nation.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For this reason, then, I have requested to see you and speak with you, since it is because of the hope of Israel that I am bound with this chain.”",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "They replied to him, “We have received no letters from Judea concerning you, nor has any of the brothers arrived with an official report or any bad word to say about you.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "But we think it right to hear from you what your views are; for regarding this sect, we know that it is spoken against everywhere.”",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Having set a day with him, they came to him at his lodging in even greater numbers. From morning until evening, he explained the matter to them, testifying to the kingdom of God and trying to persuade them about Jesus from both the Law of Moses and the Prophets.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Some were persuaded by what was said, but others refused to believe.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Disagreeing among themselves, they began to leave after Paul made one final statement: “The Holy Spirit spoke rightly through Isaiah the prophet to your ancestors",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "when he said: ‘Go to this people and say: You will listen and listen but never understand, and you will look and look but never perceive.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "For the heart of this people has grown calloused; they have become hard of hearing with their ears, and they have shut their eyes—otherwise, they might see with their eyes and hear with their ears and understand with their heart and turn, and I would heal them.’",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Let it be known to you then, that this saving work of God has been sent to the nations; they are the ones who will listen.”",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Paul remained for two whole years in his own rented dwelling, and he continued to welcome all who came to him,",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "proclaiming the kingdom of God and teaching the things concerning the Lord Jesus Christ with all openness, unhindered.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Local people\" / \"Locals\" (v. 2, 4)**: The Greek *barbaroi* did not carry the modern connotation of \"barbaric\" or \"uncivilized.\" To a Greek speaker, it simply referred to those who did not speak Greek (onomatopoetically mimicking the \"bar-bar\" sound of foreign tongues). In this context, it refers to the native Punic-descended inhabitants of Malta who were notably hospitable.\n\n**\"Extraordinary kindness\" (v. 2)**: The Greek *ou tēn tychousan philanthropian* literally means \"not the common/ordinary love-for-humanity.\" It highlights that the reception was far beyond what shipwrecked strangers might expect.\n\n**\"Justice\" (v. 4)**: The Greek *hē dikē* likely refers to the personified deity of Justice (Dike). The locals, seeing the viper, interpret it through their theological lens: if the sea didn't kill him, the goddess of Justice is finishing the job.\n\n**\"Chief Official\" (v. 7)**: The term *tō prōtō tēs nēsou* (\"the first [man] of the island\") has been confirmed by inscriptions found on Malta as the official Roman title (*primus*) for the governor of the island.\n\n**\"Twin Brothers\" (v. 11)**: The *Dioskouroi* refers to Castor and Pollux, the sons of Zeus in Greek mythology, who were considered the patrons and protectors of sailors.\n\n**\"Sect\" (v. 22)**: The Greek *hairesis* (from which we get \"heresy\") was at this time a neutral term referring to a school of thought, a faction, or a party (used elsewhere in Acts for the Pharisees and Sadducees).\n\n**\"Calloused\" (v. 27)**: The Greek *epachynthē* (from *pachys*, \"thick\" or \"fat\") suggests a heart that has become dull, insensitive, or encased in fat, rendering it unresponsive to spiritual reality. This is a direct quotation from the Septuagint (LXX) of Isaiah 6:9–10.\n\n**\"Openness, unhindered\" (v. 31)**: The final word of the book in Greek is *akōlytōs* (\"unhinderedly\"). It is a legal term, but its placement at the very end of Acts is a deliberate literary device by the author to show that despite Paul's physical chains, the message of the Kingdom has reached the heart of the Empire and remains free and unstoppable."
    }
  ]
}