{
  "book": "Ephesians",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul, an apostle of Christ Jesus through the will of God, to those set apart for God who are also faithful in Christ Jesus:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Grace to you and peace from God our Father and the Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Blessed be the God and Father of our Lord Jesus Christ, who has blessed us with every spiritual blessing in the heavenly spheres in Christ.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "For he chose us in him before the world’s foundation, so that we would be holy and blameless before him. In love,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "he marked us out in advance for adoption as his own heirs through Jesus Christ, according to the kind intention of his will,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "resulting in the praise of his glorious grace, which he freely lavished upon us in the Beloved.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "In him we have release through a ransom paid by his blood—the forgiveness of our wrongdoings—measured by the richness of his grace,",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "which he caused to overflow toward us. In all wisdom and insight,",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "he made known to us the sacred secret of his will, according to his kind intention which he purposed in Christ",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "for a plan to be managed when the times reached their full maturity: to bring all things together under one head in Christ—things in the heavens and things on the earth.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "In him we were also claimed as God’s portion, having been marked out in advance according to the purpose of the one who works out all things according to the counsel of his will,",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "so that we, who were the first to set our hope on Christ, might exist for the praise of his glory.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "In him you also, when you heard the word of truth—the good news of your salvation—and believed in him, were sealed with the promised Holy Spirit,",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "who is the down payment of our inheritance, looking toward the full redemption of God’s own possession, to the praise of his glory.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For this reason, since I heard of the faith you have in the Lord Jesus and the love you show toward all those set apart for God,",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "I do not cease giving thanks for you as I make mention of you in my prayers.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "I pray that the God of our Lord Jesus Christ, the Father of glory, may give you a spirit of wisdom and revelation in the deep knowledge of him.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "I pray that the eyes of your heart may be enlightened so that you may know what is the hope of his calling, what is the richness of his glorious inheritance among those set apart for him,",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "and what is the surpassing greatness of his power toward us who believe. This power is in accordance with the working of his mighty strength,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "which he exerted in Christ when he raised him from the dead and seated him at his right hand in the heavenly spheres.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "He is now far above every ruler, authority, power, and dominion, and every name that is named, not only in this age but also in the one to come.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "And God \"subjected all things under his feet\" and gave him to the church as head over all things.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "The church is his body, the full expression of him who fills all things in every way.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Those set apart for God\" (v. 1, 15, 18)**: The Greek *hagiois* is traditionally rendered \"saints.\" However, in a first-century context, this refers to the community’s status as \"holy ones\"—a people set apart for God's purposes, echoing the language of Israel in the Septuagint.\n\n**\"In Ephesus\" (v. 1)**: This phrase is omitted in accordance with the earliest and most significant manuscripts (such as $P^{46}$, Sinaiticus, and Vaticanus), suggesting the letter may have originally been a circular encyclical.\n\n**\"Heavenly spheres\" (v. 3, 20)**: The Greek *en tois epouraniois* (literally \"in the heavenlies\") is a unique expression in Ephesians. It refers not just to a distant \"heaven,\" but to the unseen spiritual realm that interpenetrates the physical world.\n\n**\"Adoption as his own heirs\" (v. 5)**: The Greek *huiothesia* refers to the legal process in the Greco-Roman world where an individual was placed as a son into a family, gaining all legal rights of inheritance.\n\n**\"Release through a ransom\" (v. 7)**: The Greek *apolutrosin* refers to the buying back of a slave or the ransoming of a captive. \"Redemption\" is the traditional term, but \"release through a ransom\" captures the economic and social reality the original audience would have envisioned.\n\n**\"Sacred secret\" (v. 9)**: The Greek *mysterion* does not mean a \"mystery\" in the modern sense of a puzzle to be solved, but rather a divine secret that was once hidden but has now been revealed by God to his people.\n\n**\"A plan to be managed\" (v. 10)**: The Greek *oikonomia* refers to the management or administration of a household. Paul is describing God’s \"house rules\" or \"stewardship\" for history.\n\n**\"Bring all things together under one head\" (v. 10)**: The Greek *anakephalaiosasthai* literally means \"to sum up\" or \"to head up.\" In an age of fractured authorities, Paul envisions Christ as the unifying \"head\" under which the entire cosmos is integrated.\n\n**\"Claimed as God's portion\" (v. 11)**: The verb *eklerothemen* carries the idea of being chosen by lot or assigned an inheritance. Given the Old Testament context, it likely refers to the people becoming God's \"allotted portion\" (Deut 32:9).\n\n**\"Down payment\" (v. 14)**: The Greek *arrabon* is a Semitic loanword referring to \"earnest money\"—a legal deposit that ratifies a contract and guarantees that the full amount will eventually be paid.\n\n**\"Full expression\" (v. 23)**: The Greek *pleroma* (\"fullness\") was a significant term in first-century philosophy and burgeoning Gnosticism. Here, it suggests that the church is the vehicle through which the presence and authority of Christ are fully realized or completed in the world."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "And you were once dead because of your failures and your sins,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "in which you used to live according to the spirit of this present age, following the ruler who holds power over the air—the spirit that is now actively working in those who live in defiance.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "We all once conducted our lives among them, driven by the cravings of our self-centered nature, carrying out the impulses of that nature and of our own thoughts. By our very nature, we were under the shadow of God’s righteous anger, just like the rest of humanity.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But God, being rich in compassion, because of the great love with which he loved us,",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "even when we were dead because of our failures, made us alive together with the Christ—it is by grace you have been saved!",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And he raised us up with him and seated us with him in the heavenly spheres in Christ Jesus,",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "so that in the ages to come he might demonstrate the overflowing wealth of his grace through his kindness toward us in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For by grace you have been saved through trust; and this is not your own doing, it is God’s gift.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "It is not the result of works, so that no one may boast.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For we are his handiwork, created in Christ Jesus for good works, which God prepared in advance so that we would walk in them.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Therefore, remember that once you—the nations by birth, called “the uncircumcised” by those who call themselves “the circumcision” (a ritual performed in the flesh by human hands)—",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "remember that you were at that time apart from Christ, excluded from the citizenship of Israel and strangers to the covenants of the promise, having no hope and without God in the world.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "But now, in Christ Jesus, you who were once far off have been brought near by the blood of the Christ.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For he himself is our peace. He made the two groups one and tore down the barrier of the dividing wall—the hostility—by means of his flesh.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "He rendered ineffective the law of commandments with its decrees, so that he might create the two into one new humanity in himself, thereby making peace,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "and might reconcile both to God in one body through the cross, having killed the hostility by it.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "And when he came, he proclaimed the good news of peace to you who were far off and peace to those who were near;",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "for through him we both have our introduction to the Father in one Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "So then, you are no longer strangers and resident aliens, but you are fellow citizens with the holy people and members of God’s own household.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "You have been built upon the foundation of the apostles and prophets, with Christ Jesus himself being the cornerstone.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "In him the whole building, being properly fitted together, grows into a holy sanctuary in the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "In him you also are being built together into a dwelling place for God by the Spirit.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The spirit of this present age\" (v. 2)**: The Greek *kata ton aiona tou kosmou toutou* uses two distinct words for \"world\" or \"age.\" *Aion* refers to the spirit of the times or the current era, while *kosmos* refers to the ordered system of the world. The translation \"spirit of this present age\" captures the atmospheric, temporal power the author is describing.\n\n**\"Self-centered nature\" (v. 3)**: The Greek *sarx* (traditionally \"flesh\") in Pauline thought is rarely just physical meat or skin. It refers to the human condition oriented away from God toward self-gratification and autonomy.\n\n**\"Under the shadow of God’s righteous anger\" (v. 3)**: The Greek *tekna physei orges* (literally \"children of wrath by nature\") is a Semitic idiom meaning \"people characterized by/destined for wrath.\" \"Under the shadow\" conveys the state of being subject to divine judgment without using the overly clinical \"children of.\"\n\n**\"Heavenly spheres\" (v. 6)**: *En tois epouraniois* (the \"heavenlies\") is a locative plural unique to Ephesians. It refers to the unseen spiritual dimension that overlaps the physical world, where spiritual authority resides.\n\n**\"Trust\" (v. 8)**: The Greek *pistis* is often translated as \"faith,\" but in the first century, it carried strong connotations of \"loyalty,\" \"fidelity,\" and \"active trust.\"\n\n**\"Handiwork\" (v. 10)**: *Poiema* refers to something crafted, a work of art, or a masterpiece. It implies intentional design and craftsmanship.\n\n**\"Citizenship of Israel\" (v. 12)**: *Politeia* refers to the status of being a citizen in a commonwealth or state. The Gentiles were not just socially excluded; they lacked the legal/covenantal \"standing\" that Israel possessed.\n\n**\"The barrier of the dividing wall\" (v. 14)**: *To mesotoichon tou phragmou* likely alludes to the physical stone barrier in the Jerusalem Temple (the *soreg*) that separated the Court of the Gentiles from the inner courts, with signs threatening death to any foreigner who passed.\n\n**\"One new humanity\" (v. 15)**: *Hena kainon anthropon* is often translated \"one new man,\" but the Greek *anthropos* is generic. The author is describing the creation of a new species of humanity that transcends the Jew/Gentile binary.\n\n**\"Introduction\" (v. 18)**: *Prosagoge* is a technical term used for the formal introduction of a person into the presence of a king or high official. It is more than just \"access\"; it is a formal presentation.\n\n**\"Cornerstone\" (v. 20)**: *Akrogoniaios* refers to the primary stone set at the corner of a foundation to ensure the entire building is square and stable. While some argue for \"capstone,\" the context of \"foundation\" in verse 20 strongly supports \"cornerstone.\""
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "For this reason, I, Paul, the prisoner of Christ Jesus for the sake of you who are from the nations—",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "assuming you have heard of the stewardship of God’s grace that was entrusted to me for your benefit,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "namely, that the mystery was made known to me by revelation, as I have briefly written before.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "By reading this, you are able to perceive my insight into the mystery of the Christ,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "which in other generations was not made known to the sons of men as it has now been revealed to his holy apostles and prophets by the Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "This mystery is that the nations are co-heirs, co-members of the same body, and co-partners in the promise in Christ Jesus through the good news.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "I became a servant of this gospel according to the gift of God’s grace given to me by the inner-working of his power.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "To me, the very least of all the holy ones, this grace was given: to announce to the nations the unfathomable wealth of the Christ,",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "and to bring to light for everyone the stewardship of the mystery which has been hidden for ages in God, who created all things.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "His intent was that now, through the community of the called, the many-faceted wisdom of God might be made known to the cosmic rulers and authorities in the heavenly realms.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "This was according to his eternal purpose which he carried out in Christ Jesus our Lord,",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "in whom we have boldness and access with confidence through his faithfulness.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Therefore, I ask you not to lose heart over my sufferings on your behalf, for they are your glory.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For this reason, I bend my knees before the Father,",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "from whom every family in heaven and on earth derives its name.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "I pray that, according to the wealth of his glory, he may grant you to be strengthened with power through his Spirit in your inner being,",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "so that the Christ may take up permanent residence in your hearts through faith. And as you are rooted and founded in love,",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "I pray that you may have the strength to grasp, together with all the holy ones, what is the breadth and length and height and depth,",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "and to know the love of Christ which surpasses knowledge, so that you may be filled up to all the fullness of God.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Now to him who is able to do far beyond all measure, more than all we could ever ask or even imagine, according to the power that is at work within us—",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "to him be the glory in the community of the called and in Christ Jesus to all generations, forever and ever. Amen.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The nations\" (v. 1, 6, 8)**: The Greek *ethnē* is often translated as \"Gentiles.\" However, in a first-century context, this term specifically evokes the Hebrew *goyim*—the non-Jewish nations of the world. Using \"the nations\" preserves the covenantal distinction between Israel and the rest of the world that Paul is addressing.\n\n**\"Stewardship\" (v. 2, 9)**: The Greek *oikonomia* refers to the management or administration of a household. Paul views his apostolic commission not just as a job, but as a divinely appointed administrative responsibility over the \"house\" of God’s grace.\n\n**\"Co-heirs, co-members... co-partners\" (v. 6)**: The Greek text uses three rare compound words starting with the prefix *sun-* (together/with): *sunklēronoma*, *sussōma*, and *summetocha*. This stylistic repetition emphasizes the absolute equality of the nations with Israel in the new community.\n\n**\"The very least\" (v. 8)**: Paul uses a grammatical curiosity here, *elachistoterō*, which is a comparative form of a superlative adjective (\"leaster than the least\"). He is inventing a word to express his profound humility. \n\n**\"Unfathomable\" (v. 8)**: *Anexichniaston* literally means \"that which cannot be tracked by footprints.\" It describes riches so vast that one cannot find their end or even map their boundaries.\n\n**\"Community of the called\" (v. 10, 21)**: The Greek *ekklesia* is traditionally \"church,\" but in the first century, it referred to a public assembly or a summoned gathering. \"Community of the called\" captures the sense of a people gathered by God’s summons.\n\n**\"Many-faceted\" (v. 10)**: *Polypoikilos* was used to describe intricate embroidery, the varied colors of flowers, or a complex tapestry. It suggests that God’s wisdom is not a monolith but a rich, variegated masterpiece.\n\n**\"His faithfulness\" (v. 12)**: The Greek *pisteōs autou* can be translated as \"faith in him\" (objective genitive) or \"his faithfulness\" (subjective genitive). Given the context of Christ’s \"eternal purpose\" and \"work\" in verse 11, the translation favors the faithfulness of Christ as the ground of our access.\n\n**\"Every family\" (v. 15)**: There is a wordplay in Greek between \"Father\" (*patera*) and \"family\" (*patria*). A *patria* is a group derived from a single *patēr*. The translation \"every family\" maintains the logic that all earthly lineages derive their identity from the ultimate Father.\n\n**\"Take up permanent residence\" (v. 17)**: The verb *katoikēsai* refers to settling down in a place as a permanent home, as opposed to *paroikeō*, which means to visit as a stranger. \n\n**\"Far beyond all measure\" (v. 20)**: *Hyperekperissou* is one of Paul’s \"super-superlatives.\" It is an adverbial pile-up meaning \"beyond-out-of-excessively.\" \"Far beyond all measure\" attempts to capture this intensive linguistic energy."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, I—the prisoner for the sake of the Lord—implore you to live a life worthy of the calling to which you were called.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Live with all humility and gentle strength, with a patient heart, bearing with one another in love.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Make every effort to preserve the unity of the Spirit through the binding bond of peace.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "There is one body and one Spirit, just as you were called to the one hope of your calling;",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "one Lord, one faith, one baptism;",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "one God and Father of all, who is over all, through all, and in all.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "But to each one of us, grace was granted according to the measure of Christ’s gift.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Therefore it says: *When he ascended to the heights, he led a parade of captives, and he gave gifts to humanity.*",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Now, what does “he ascended” mean, except that he also descended into the lower regions of the earth?",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "The one who descended is the very same one who ascended far above all the heavens, so that he might fill the entire universe.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And he personally gave some to be emissaries, some to be prophets, some to be heralds of the good news, and some to be shepherds and teachers,",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "for the purpose of equipping the holy ones for the work of service, leading to the building up of the body of Christ.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "This continues until we all attain the unity of the faith and of the full knowledge of the Son of God—reaching the state of a mature humanity, to the measure of the stature that belongs to the fullness of Christ.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "The goal is that we should no longer be infants, tossed by waves and carried about by every wind of teaching, victims of human trickery and the craftiness that serves the schemes of error.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Instead, living out the truth in love, let us grow up in every way into him who is the head—Christ.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "From him the whole body—joined and held together by every supporting ligament as each individual part carries out its proportional function—produces the body’s growth so that it builds itself up in love.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "So I say this and testify to it in the Lord: you must no longer live as the outsiders live, in the futility of their minds.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Their understanding is darkened; they are alienated from the life of God because of the ignorance that is in them, which stems from the hardness of their hearts.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Having become callous, they have abandoned themselves to unrestrained behavior, practicing every kind of impurity with an insatiable greed.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "But that is not how you learned Christ—",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "assuming you have heard him and were taught in him, just as the truth is in Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "You were taught to strip off the old humanity that characterized your former way of life—the one being corrupted by its deceptive desires—",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "and to be renewed in the spirit of your mind,",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "and to clothe yourselves with the new humanity, which was created according to God’s likeness in the righteousness and holiness of the truth.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Therefore, having stripped off the lie, let each of you speak truth with his neighbor, because we are members of one another.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "Be angry, yet do not sin; do not let the sun set on your provocation,",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "and do not give the slanderer a foothold.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "The one who steals must steal no longer, but instead should toil, working at something good with his own hands, so that he may have something to share with the person in need.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Let no rotten word come out of your mouth, but only what is good for building up the specific need, so that it may give grace to those who hear.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "And do not grieve the Holy Spirit of God, by whom you were sealed for the day of redemption.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Let all bitterness, rage, anger, shouting, and slander be removed from you, along with every kind of malice.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Instead, become kind to one another, tender-hearted, graciously forgiving each other just as God in Christ also graciously forgave you.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Gentle strength\" (v. 2)**: The Greek *praýtētos* is often rendered \"meekness,\" but in the first century, it described strength under control—like a powerful horse that has been tamed. It is the opposite of being driven by raw impulse or pride.\n\n**\"The heights... a parade of captives\" (v. 8)**: This alludes to Psalm 68:18. The Greek *ēchmalōteusen aichmalōsian* (literally \"he captured captivity\") refers to the Greco-Roman \"Triumph,\" a victory parade where a conquering general displayed his captives and distributed spoils to his people. \n\n**\"Emissaries\" (v. 11)**: *Apostolous* is often transliterated as \"apostles,\" but its functional meaning is \"sent ones\" or \"authorized messengers.\" \"Emissaries\" captures the sense of being officially commissioned.\n\n**\"Mature humanity\" (v. 13)**: *Andra teleion* is literally \"perfect man\" or \"complete male.\" However, in the context of the \"body of Christ,\" this is a corporate singular. It refers to the church reaching full adulthood as a new kind of humanity, contrasting with the \"infants\" in verse 14.\n\n**\"Human trickery\" (v. 14)**: The Greek *kybeia* refers to dice-playing. It suggests that false teachers are like crooked gamblers using loaded dice to deceive the unwary.\n\n**\"Living out the truth\" (v. 15)**: The verb *alētheuontes* is usually translated \"speaking the truth,\" but it is a broader verb meaning \"to be true\" or \"to truth.\" It encompasses speech, but also includes integrity of life and action.\n\n**\"Old humanity / New humanity\" (v. 22, 24)**: *Anthrōpon* is often translated \"man\" or \"self.\" However, Paul is contrasting the corporate \"Adam\" (old humanity) with the corporate \"Christ\" (new humanity). It is a change of nature and allegiance, not just individual behavior.\n\n**\"Provocation\" (v. 26)**: *Parorgismō* refers to the state of being provoked to anger or exasperation. The instruction is to deal with the cause of anger before the day ends to prevent a \"foothold\" for the \"slanderer\" (*diabolō*, the Devil).\n\n**\"Rotten word\" (v. 29)**: *Sapros* is the word used for decaying or putrid fruit. It refers to speech that is foul, useless, or destructive to the community.\n\n**\"Graciously forgiving\" (v. 32)**: The Greek *charizomenoi* is built on the root *charis* (grace). It implies a forgiveness that is unearned and generous, mirroring the *charis* God extended in Christ."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, become imitators of God, as his dearly loved children,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "and conduct your life in love, just as Christ also loved us and gave himself up on our behalf as a sacrificial offering and a slaughtered sacrifice to God, a soothing aroma.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "But sexual immorality, any kind of ritual or moral impurity, or greed must not even be mentioned among you—this is the only way of life proper for God’s holy people.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Likewise, there must be no obscenity, foolish talk, or vulgar wit—things which are out of place—but instead, the giving of thanks.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For you can be certain of this: no one who is sexually immoral, or impure, or greedy (which is to be an idolater) has any inheritance in the kingdom of Christ and of God.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Let no one deceive you with empty arguments; it is because of these very things that the wrath of God is coming upon those characterized by disobedience.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Therefore, do not become their partners.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For you were once darkness itself, but now you are light in the Lord. Conduct yourselves as children of light",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "(for the fruit of the light consists of all goodness, righteousness, and truth),",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "discerning through experience what is pleasing to the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Take no part in the fruitless deeds of darkness, but instead, expose them for what they are.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For the things they do in secret are shameful even to mention.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "But everything exposed by the light is made visible,",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "for everything that is made visible is light. This is why it says: “Awake, O sleeper, and rise from the dead, and Christ will shine upon you.”",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "So then, be very careful how you conduct your lives—not as the unwise, but as the wise,",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "making the most of every opportune moment, because these are evil days.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For this reason, do not be senseless, but understand what the will of the Lord is.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And do not get drunk on wine, which leads to reckless dissipation, but be filled by the Spirit,",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "speaking to one another in psalms, hymns, and spiritual songs, singing and making music in your heart to the Lord,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "always giving thanks for everything to our God and Father in the name of our Lord Jesus Christ,",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "yielding to one another out of reverence for Christ.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Wives, yield to your own husbands as to the Lord,",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "because a husband is the head of the wife just as Christ is the head of the church—he himself being the Savior of the body.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "But as the church yields to Christ, so also wives should yield to their husbands in everything.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Husbands, love your wives just as Christ also loved the church and gave himself up for her,",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "in order that he might set her apart as holy, having cleansed her by the washing of the water with the word,",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "so that he might present the church to himself in all her glory, having no spot or wrinkle or any such thing, but that she might be holy and blameless.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "In the same way, husbands are obligated to love their own wives as their own bodies. The one who loves his wife loves himself.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "For no one ever hated his own flesh, but instead nourishes and tenderly cares for it, just as Christ does for the church,",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "because we are members of his body.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "“For this reason a man shall leave his father and mother and be joined to his wife, and the two shall become one flesh.”",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "This mystery is profound, and I am speaking in reference to Christ and the church.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "Nevertheless, each one of you must love his wife as himself, and the wife should see to it that she respects her husband.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Slaughtered sacrifice\" (v. 2)**: The Greek distinguishes between *prosphora* (a general offering) and *thysia* (a victim offered in sacrifice). The latter specifically evokes the shedding of blood in a cultic setting.\n\n**\"Soothing aroma\" (v. 2)**: This reflects the Septuagint phrase *osmēn euōdias*, used frequently in the Torah (e.g., Genesis 8:21; Exodus 29:18) to describe the scent of a sacrifice that God finds acceptable.\n\n**\"Vulgar wit\" (v. 4)**: *Eutrapelia* originally meant \"versatility\" or \"wit,\" but in the moral discourse of the time, it often referred to the kind of sophisticated, clever joking that was ribald or unwholesome.\n\n**\"Greedy person... an idolater\" (v. 5)**: *Pleonektēs* (a greedy person) is defined as an idolater because they have displaced God with the pursuit of material gain (the \"more\").\n\n**\"Making the most of every opportune moment\" (v. 16)**: *Exagorazomenoi ton kairon* uses a commercial metaphor (buying back/redeeming) applied to *kairos* (a specific, opportune time) rather than *chronos* (linear time). It suggests seizing the specific opportunities for good that arise in a hostile environment.\n\n**\"Reckless dissipation\" (v. 18)**: *Asōtia* refers to a lifestyle that is \"unsaved\" or \"wasteful,\" often associated with the behavior of the \"Prodigal Son\" (*huios asōtos*). It is the opposite of the self-control produced by the Spirit.\n\n**\"Yielding\" (vv. 21–22)**: The Greek *hypotassō* (to range under) carries a sense of voluntary cooperation and order. In v. 22, the verb is actually absent in the earliest manuscripts, being carried over from the participle in v. 21. This shows that the wife’s \"yielding\" is a specific application of the \"mutual yielding\" expected of all Christians.\n\n**\"Head\" (v. 23)**: *Kephalē* (head) in this context carries connotations of both \"source/origin\" (as the head of a river) and \"preeminence.\" Paul uses the metaphor to describe a relationship of care and leadership modeled on Christ’s self-sacrificial protection of his \"body.\"\n\n**\"Washing of the water with the word\" (v. 26)**: This likely alludes to the pre-nuptial bridal bath, a common custom in the ancient world, here metaphorically applied to baptism and the gospel proclamation (*rhēma*).\n\n**\"Respect\" (v. 33)**: The Greek *phobētai* (from *phobos*) literally means \"fear.\" However, in the context of a healthy relationship with a benefactor or a loving husband, it denotes profound reverence, awe, or deferential respect, rather than terror."
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "Children, obey your parents in the Lord, for this is right.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "\"Honor your father and mother\"—this is the first commandment accompanied by a promise—",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "\"so that it may go well with you and you may live a long time on the earth.\"",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And fathers, do not provoke your children to resentment; instead, nurture them in the discipline and instruction of the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Slaves, obey your earthly masters with deep respect and trembling, in the sincerity of your heart, as you would serve the Christ.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Do not do this only when being watched, as if merely trying to please people, but as slaves of Christ who are doing the will of God from the soul.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Serve with goodwill, as if to the Lord and not to humans,",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "knowing that whatever good each person does, they will receive this back from the Lord, whether they are a slave or free.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And masters, treat them the same way. Give up the use of threats, knowing that the one who is both their Master and yours is in the heavens, and there is no favoritism with him.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Finally, be empowered in the Lord and in the strength of his might.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "Put on the full armor of God so that you are able to stand firm against the strategies of the Slanderer.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For our struggle is not against blood and flesh, but against the rulers, against the authorities, against the cosmic powers of this darkness, against the spiritual forces of evil in the heavenly realms.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Because of this, take up the full armor of God, so that you are able to resist in the day of evil and, having accomplished everything, to stand firm.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Stand firm, therefore, having belted your waist with truth, having put on the breastplate of justice,",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "and having shod your feet with the readiness that comes from the good news of peace.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "In all circumstances, take up the great shield of faith, with which you will be able to extinguish all the flaming arrows of the evil one.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "And take the helmet of salvation and the sword of the Spirit, which is the spoken word of God.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Pray at all times in the Spirit through every kind of prayer and petition. To this end, stay alert with all persistence and petition for all the holy ones—",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "and for me, that a message may be given to me when I open my mouth, so that I may boldly make known the mystery of the good news,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "for which I am an ambassador in chains. Pray that I may speak it boldly, as I am required to speak.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "So that you also may know my circumstances—how I am doing—Tychicus, the beloved brother and faithful servant in the Lord, will make everything known to you.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "I have sent him to you for this very purpose, so that you may know how we are and so that he may encourage your hearts.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Peace to the brothers and sisters, and love with faith, from God the Father and the Lord Jesus Christ.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Grace be with all who love our Lord Jesus Christ with an undying love.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Provoke... to resentment\" (v. 4)**: The Greek *parorgizete* refers to a provocation that rouses deep-seated anger or a sense of injustice. \"Resentment\" captures the psychological result of overbearing parenting better than simply \"anger.\"\n\n**\"Slaves\" (v. 5)**: The Greek *douloi* refers to people in a state of chattel slavery or bondservice. While modern translations often use \"bondservants,\" \"slaves\" more accurately reflects the harsh social reality of the first-century Roman world and the radical nature of Paul’s instructions to both the enslaved and their masters.\n\n**\"Sincerity of heart\" (v. 5)**: *Haplotēti* denotes singleness of purpose or simplicity. It is the opposite of duplicity or \"double-mindedness.\"\n\n**\"Slanderer\" (v. 11)**: The Greek *diabolos* (Devil) literally means \"the slanderer\" or \"the accuser.\" Translating the title by its meaning highlights the nature of the \"strategies\" (*methodeias*) mentioned in the text—deception and false accusation.\n\n**\"Cosmic powers\" (v. 12)**: *Kosmokratōras* is a rare and powerful term suggesting entities that exert a global or universal grip. It evokes the astrological and mythological fears of the ancient world regarding spiritual forces governing the physical universe.\n\n**\"Justice\" (v. 14)**: *Dikaiosunē* can be translated as \"righteousness\" (moral character) or \"justice\" (social and legal rightness). Given the allusion to Isaiah 59:17, where Yahweh puts on the breastplate of *dikaiosunē* to bring justice to the oppressed, \"justice\" is a vital nuance here.\n\n**\"Great shield\" (v. 16)**: The Greek *thyreon* refers to the large, rectangular Roman *scutum* (shaped like a door, *thyra*), which protected the entire body, as opposed to the small round *aspis*.\n\n**\"Spoken word of God\" (v. 17)**: The Greek uses *rhēma* rather than *logos*. While *logos* often refers to the broad message or divine reason, *rhēma* usually denotes the specific, uttered word or a particular saying.\n\n**\"Undying love\" (v. 24)**: The phrase *en aphtharsia* literally means \"in incorruptibility\" or \"in immortality.\" In the context of \"love,\" it describes a love that is not subject to decay, cessation, or corruption."
    }
  ]
}