{
  "book": "Galatians",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul, an envoy—an appointment not granted by any human council nor mediated by any man, but through Jesus Christ and God the Father who raised him from the dead—",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "and all the brothers who are with me, to the assemblies of Galatia:",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Grace to you and peace from God our Father and the Lord Jesus Christ,",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "who gave himself on behalf of our sins to rescue us out of the present evil age, in accordance with the will of our God and Father,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "to whom be the glory throughout the ages of ages. Amen.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "I am astonished that you are so quickly defecting from the one who called you by the grace of Christ to a different \"good news\"—",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "not that there is actually another one. Rather, there are certain people who are throwing you into confusion and wanting to distort the Good News of the Christ.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But even if we, or an angel from heaven, should preach to you a \"good news\" contrary to what we preached to you, let that person be condemned to destruction.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "As we have said before, I now say again: if anyone preaches to you a \"good news\" contrary to what you received, let that person be condemned to destruction.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Am I now trying to win the approval of humans, or of God? Or am I striving to be a people-pleaser? If I were still trying to please people, I would not be a slave of Christ.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "For I want you to know, brothers, that the Good News preached by me is not a human invention.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "I did not receive it from a human source, nor was I taught it; it came through a revelation of Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "You have certainly heard of my former way of life within Judaism—how I used to persecute the assembly of God with fanatical intensity and tried to destroy it.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "I was advancing in Judaism beyond many of my own age among my people, being far more of a zealot for the traditions of my ancestors.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "But when it pleased God—who set me apart from my mother’s womb and called me through his grace—",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "to reveal his Son in me so that I might proclaim him as good news among the nations, I did not immediately consult with any human authority.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "I did not even go up to Jerusalem to see those who were envoys before me. Instead, I went away into Arabia, and later returned to Damascus.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Then, after three years, I went up to Jerusalem to interview Cephas, and I stayed with him for fifteen days.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "But I did not see any of the other envoys except James, the brother of the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "(In what I am writing to you, I declare before God that I am not lying!)",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Afterward, I went into the regions of Syria and Cilicia.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But I remained personally unknown to the assemblies of Judea that are in Christ.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "They only kept hearing the report: “The man who used to persecute us is now proclaiming the faith he once tried to destroy.”",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "And they were glorifying God because of what had happened in me.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Envoy\" (v. 1, 17, 19)**: The Greek *apostolos* refers to a commissioned messenger or agent with the delegated authority of the sender. The traditional \"apostle\" has become a religious title that obscures the functional nature of the role in the first century.\n\n**\"Assemblies\" (v. 2, 13, 22)**: The word *ekklēsia* refers to a public assembly of citizens. In a first-century context, it carries a communal and civic weight that the modern word \"church\" (often associated with buildings or institutions) lacks.\n\n**\"Present evil age\" (v. 4)**: This reflects the Jewish apocalyptic worldview of the \"two ages\"—the current age characterized by sin and death, and the \"age to come\" inaugurated by the Messiah. Paul is signaling that the death of Christ was a rescue operation from the current world order.\n\n**\"Defecting\" (v. 6)**: The Greek *metatithesthe* was often used of military desertion or changing one's philosophical or political allegiance. It implies a serious breach of loyalty.\n\n**\"Condemned to destruction\" (v. 8, 9)**: The Greek *anathema* refers to something \"set apart\" for God, usually for the purpose of being destroyed (an echo of the Hebrew *herem*). It is a divine curse, far more serious than mere social excommunication.\n\n**\"Slave\" (v. 10)**: While \"servant\" is a common translation for *doulos*, it fails to capture the total subjection and lack of autonomy inherent in the term. Paul uses it to contrast his allegiance to Christ against his refusal to be a \"people-pleaser.\"\n\n**\"Zealot\" (v. 14)**: The term *zēlōtēs* suggests more than just enthusiasm; it evokes the tradition of Phinehas and Elijah—a militant, even violent, devotion to the purity of Israel's traditions.\n\n**\"Consult with any human authority\" (v. 16)**: Literally \"consult with flesh and blood.\" This is a Semitic idiom (Aramaic *basar we-dam*) referring to mortals or human nature in contrast to God.\n\n**\"Interview\" (v. 18)**: The Greek *historēsai* (from which we get \"history\") suggests more than a casual visit. It implies a purposeful inquiry to obtain information or to get to know someone personally.\n\n**\"Cephas\" (v. 18)**: The Aramaic name for Peter (meaning \"Rock\") is retained here as it appears in the Greek text. Paul's use of the Aramaic name likely reflects the way Peter was known in the early Jerusalem community."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "Then after fourteen years, I went up to Jerusalem again with Barnabas, taking Titus along with me.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I went up because of a revelation and presented to them the gospel I proclaim among the nations. I did this privately before those recognized as leaders, to ensure I was not running, or had not already run, my race in vain.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "But not even Titus, who was with me, was compelled to be circumcised, even though he was a Greek.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "This issue arose because of false brothers who had been smuggled in—men who slipped in to spy on the freedom we have in Christ Jesus, intending to reduce us to slavery.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "We did not yield to them in submission for even a moment, so that the truth of the gospel might remain secure for you.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "As for those recognized as being important—whatever they once were makes no difference to me; God does not judge by outward status—those of reputation added nothing to my message.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "On the contrary, when they saw that I had been entrusted with the gospel for the uncircumcised just as Peter had been for the circumcised",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "(for the one who was at work in Peter for his apostleship to the Jews was also at work in me for the nations),",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "and when they recognized the grace given to me, James, Cephas, and John—the ones recognized as pillars—gave Barnabas and me the right hand of partnership. We agreed that we should go to the nations and they to the circumcised.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Their only request was that we should continue to remember the poor, the very thing I was eager to do.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "But when Cephas came to Antioch, I opposed him to his face, because he stood self-condemned.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "Before certain people came from James, he used to eat with the Gentiles; but when they arrived, he began to draw back and separate himself, because he was afraid of the circumcision faction.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "The rest of the Jews joined him in this acting, so that even Barnabas was carried away by their pretense.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "But when I saw that they were not walking a straight path toward the truth of the gospel, I said to Cephas in front of everyone: “If you, though a Jew by birth, live like a Gentile and not like a Jew, how can you compel the Gentiles to adopt Jewish customs?”",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "We are Jews by nature and not “Gentile sinners.”",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "Yet we know that a person is not made right with God by works of the law but through the faithfulness of Jesus Christ. Even we have placed our trust in Christ Jesus, so that we might be made right by the faithfulness of Christ and not by works of the law, because by works of the law no human being will be made right.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "But if, while seeking to be made right in Christ, we ourselves were found to be sinners, does that make Christ an agent of sin? Absolutely not!",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For if I rebuild the very things I tore down, I prove myself to be a lawbreaker.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "For through the law I died to the law so that I might live for God. I have been crucified with Christ.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "It is no longer I who live, but Christ lives in me. The life I now live in the body, I live by the faithfulness of the Son of God, who loved me and gave himself up for me.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "I do not nullify the grace of God; for if righteousness comes through the law, then Christ died for nothing.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Those recognized as leaders / Those of reputation\" (v. 2, 6, 9)**: The Greek *hoi dokountes* literally means \"those who seem\" or \"those who appear to be.\" In this context, Paul is referring to the established leaders in Jerusalem (James, Peter, John). The term carries a slight rhetorical edge—Paul acknowledges their status but insists that their status does not grant them a different gospel or authority over the revelation he received directly.\n\n**\"God does not judge by outward status\" (v. 6)**: The Greek *prosōpon theos anthrōpou ou lambanei* literally means \"God does not receive the face of a man.\" This is a Hebraism (based on the Hebrew *nasa panim*) meaning to show partiality or be influenced by a person’s social standing or appearance.\n\n**\"Acting / Pretense\" (v. 13)**: The Greek *hypokrisei* refers to the behavior of a *hypokritēs* (an actor). Peter and Barnabas were not \"hypocrites\" in the sense of being secret unbelievers; rather, they were \"playing a part\" or putting on a public performance that contradicted their true convictions because of social pressure.\n\n**\"Walking a straight path\" (v. 14)**: The Greek *orthopodousin* (from *orthos*, \"straight,\" and *pous*, \"foot\") suggests walking uprightly or acting consistently. Paul uses it to describe behavior that aligns (or fails to align) with the \"track\" laid down by the gospel.\n\n**\"Adopt Jewish customs\" (v. 14)**: The Greek verb *ioudaizein* (\"to Judaize\") means to live according to Jewish law and traditions. In this context, it specifically refers to Gentiles being pressured to take on the \"works of the law\" (like dietary restrictions and circumcision) to be part of the covenant community.\n\n**\"Made right\" (v. 16)**: The Greek *dikaioutai* (often translated as \"justified\") is a legal and relational term. It refers to being declared righteous or being set in a right relationship with God. \"Made right\" captures both the status and the transformation of the relationship.\n\n**\"Faithfulness of Jesus Christ\" (v. 16, 20)**: The Greek *pisteōs Iēsou Christou* uses a genitive construction that can be translated as \"faith in Jesus Christ\" (objective) or \"the faithfulness of Jesus Christ\" (subjective). Given Paul’s emphasis on the agency of Christ and the contrast with human \"works,\" this translation views the \"faithfulness\" of Christ—his own obedient act—as the primary ground of justification, which we then trust.\n\n**\"No human being\" (v. 16)**: The Greek *pasa sarx* literally means \"all flesh,\" a common biblical idiom for all of humanity in its frailty.\n\n**\"Died for nothing\" (v. 21)**: The Greek *dōrean* means \"gratuitously,\" \"without cause,\" or \"for no purpose.\" If the law could achieve righteousness, Christ's death was a redundant, pointless waste."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "O senseless Galatians! Who has cast a spell over you? Before your very eyes, Jesus Christ was publicly placarded as the crucified one.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I want to learn only this from you: Did you receive the Spirit by observing the law, or by hearing the message of faith?",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Are you so senseless? Having begun by the Spirit, are you now trying to reach the goal through human effort?",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Did you experience so much for nothing—if it really was for nothing?",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Does the one who supplies the Spirit to you and works miracles among you do so because you observe the law, or because you heard the message of faith?",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "It is just as it was with Abraham: *He believed God, and it was credited to him as righteousness.*",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Understand then that those who live by faith are the true sons of Abraham.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And the Scripture, foreseeing that God would justify the nations by faith, announced the good news to Abraham in advance: *In you all the nations will be blessed.*",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "So then, those who live by faith are blessed along with Abraham, the man of faith.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For as many as rely on the works of the law are under a curse; for it is written: *Cursed is everyone who does not remain faithful to everything written in the book of the law, to perform them.*",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "Now it is evident that no one is justified before God by the law, because *the righteous one will live by faith.*",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "But the law is not based on faith; rather, *the one who does these things will live by them.*",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Christ ransomed us from the curse of the law by becoming a curse on our behalf—for it is written: *Cursed is everyone who hangs on a tree*—",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "so that the blessing of Abraham might come to the nations in Christ Jesus, and so that we might receive the promise of the Spirit through faith.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Brothers and sisters, let me use an everyday example: when a person’s last will and testament has been ratified, no one sets it aside or adds new conditions to it.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "Now the promises were spoken to Abraham and to his \"seed.\" It does not say, \"and to seeds,\" as referring to many, but as referring to one: *And to your seed,* who is Christ.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "What I am saying is this: the law, which came four hundred and thirty years later, does not invalidate a covenant previously ratified by God, so as to abolish the promise.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For if the inheritance comes from the law, it no longer comes from a promise; but God graciously granted it to Abraham through a promise.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Why the law, then? It was added for the sake of defining transgressions, until the \"seed\" should come to whom the promise had been made. It was enacted through angels by the hand of a mediator.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Now a mediator does not represent only one party, but God is one.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Is the law then contrary to the promises of God? Certainly not! For if a law had been given that was able to impart life, then righteousness would indeed have come through the law.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But the Scripture imprisoned all things under the power of sin, so that what was promised might be given through the faithfulness of Jesus Christ to those who believe.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Before this faith came, we were held in custody under the law, imprisoned until the coming faith was revealed.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "So the law became our strict custodian until Christ, so that we might be justified by faith.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "But now that faith has come, we are no longer under a custodian.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "For you are all sons of God through faith in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "For as many of you as were baptized into Christ have clothed yourselves with Christ.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "There is no longer Jew or Greek, there is no longer slave or free, there is no \"male and female\"; for you are all one in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "And if you belong to Christ, then you are Abraham’s seed, heirs according to the promise.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Publicly placarded\" (v. 1)**: The Greek *proegraphē* refers to a public notice, poster, or billboard. Paul is emphasizing that the message of the crucifixion was presented to the Galatians with such clarity and public visibility that their \"bewitchment\" by other teachings is incomprehensible.\n\n**\"Human effort\" (v. 3)**: The Greek *sarxi* (flesh) here contrasts with the Spirit. In this context, it refers to human nature relying on its own resources, specifically through the ritual observance of the Mosaic law, rather than the \"flesh\" as mere physical skin.\n\n**\"The message of faith\" (vv. 2, 5)**: The phrase *akoēs pisteōs* is often translated \"hearing with faith.\" However, *akoē* frequently refers to the thing heard—the report or the message. The contrast is between the external \"works\" of the law and the reception of the gospel \"message.\"\n\n**\"Nations\" (vv. 8, 14)**: The Greek *ethnē* can be translated as \"Gentiles\" or \"nations.\" Given the allusion to the Genesis 12/22 promise regarding \"all the nations,\" the broader term \"nations\" is used to maintain the link to Abrahamic covenantal language.\n\n**\"Ransomed\" (v. 13)**: The Greek *exēgorasen* is a commercial and legal term meaning to \"buy back\" or \"purchase out of the marketplace,\" often used in the context of redeeming a slave.\n\n**\"Last will and testament\" (v. 15)**: While *diathēkē* is usually \"covenant,\" in the Greco-Roman world and in this specific legal analogy about ratification and codicils, the nuances of a \"will\" are most prominent.\n\n**\"Defining transgressions\" (v. 19)**: The Greek *charin* (for the sake of/because of) suggests that the law was added to make sin recognizable as \"transgression\" (a violation of a specific command), illuminating the need for the promise.\n\n**\"Faithfulness of Jesus Christ\" (v. 22)**: The Greek *pisteōs Iēsou Christou* is a subjective genitive construction. While \"faith in Jesus Christ\" is a possible translation, \"the faithfulness of Jesus Christ\" (his obedience to the point of the cross) provides the grounds for the promise mentioned in the verse.\n\n**\"Strict custodian\" (vv. 24-25)**: The *paidagōgos* was not a \"schoolmaster\" or \"teacher\" in the modern sense. He was a household slave responsible for the discipline, protection, and moral supervision of children until they reached maturity.\n\n**\"Clothed yourselves\" (v. 27)**: The Greek *enedysasthe* refers to putting on a garment. In the first century, clothing was a primary indicator of social status and identity. To \"put on Christ\" means to adopt His identity as one's own.\n\n**\"Male and female\" (v. 28)**: Unlike the pairs \"Jew or Greek\" and \"slave or free\" which use the disjunctive *oude* (neither/nor), Paul switches to *kai* (and) for \"male and female.\" This is a direct allusion to the Septuagint text of Genesis 1:27. Paul is signaling that the fundamental divisions established at creation (or at least the social hierarchies derived from them) are being redefined in the new creation in Christ."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "What I am saying is this: as long as the heir is a minor, he is no different from a slave, even though he is the legal owner of the entire estate.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Instead, he is subject to guardians and trustees until the date previously set by his father.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "It was the same with us; when we were minors, we were enslaved under the elementary principles of the world.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But when the time had reached its fulfillment, God sent out his Son, born of a woman, born under the Law,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "in order to buy back those under the Law, so that we might receive the full legal standing of adoption into sonship.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And because you are sons, God sent out the Spirit of his Son into our hearts, crying out, “Abba! Father!”",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "So then, you are no longer a slave but a son; and if a son, you are also an heir through God.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But back then, when you did not know God, you were enslaved to things that by their very nature are not gods at all.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Now, however, since you have come to know God—or rather, to be known by God—how can you turn back again to those powerless and impoverished elementary principles? Do you really wish to be enslaved to them all over again?",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "You are scrupulously observing special days and months and seasons and years!",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "I am afraid for you—I fear that somehow the hard labor I spent on you has been wasted.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "I beg of you, brothers and sisters, become like me, because I became like you. You did me no wrong.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "You know that it was because of a physical ailment that I first preached the good news to you.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And even though my physical condition was a trial for you, you did not treat me with contempt or spit in disgust. Instead, you welcomed me as an angel of God, as Christ Jesus himself.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "What has happened to that sense of privilege you felt? For I can testify on your behalf that, if it had been possible, you would have torn out your own eyes and given them to me.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Have I now become your enemy by telling you the truth?",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Those people are zealously courting you, but not for any good purpose. They want to shut you out from us so that you will zealously court them instead.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Now, it is always good to be zealously courted for a good purpose, and not only when I am present with you.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "My children—for whom I am again in the pains of childbirth until Christ is formed in you—",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "I wish I could be present with you right now and change my tone, because I am at my wits' end regarding you.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Tell me, you who want to be under the Law, do you not listen to what the Law actually says?",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "For it is written that Abraham had two sons, one by the slave-woman and one by the free woman.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "The son of the slave-woman was born according to the flesh, but the son of the free woman was born through the promise.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "These things can be understood as an allegory: for these women are two covenants. One is from Mount Sinai, bearing children for slavery; she is Hagar.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "Now Hagar represents Mount Sinai in Arabia and corresponds to the present Jerusalem, for she is in slavery with her children.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "But the Jerusalem above is free, and she is our mother.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "For it is written: “Rejoice, O barren woman who does not give birth; break forth and shout, you who are not in labor; for the children of the desolate woman are more numerous than those of the woman who has a husband.”",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Now you, brothers and sisters, are children of promise just like Isaac.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "But just as back then the one born according to the flesh persecuted the one born according to the Spirit, so it is now.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "But what does the Scripture say? “Drive out the slave-woman and her son, for the son of the slave-woman shall never share the inheritance with the son of the free woman.”",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Therefore, brothers and sisters, we are not children of a slave-woman, but of the free woman.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Minor\" (v. 1, 3)**: The Greek *nēpios* literally means an infant or one who does not speak, but in this legal context, it refers to a child under the age of legal majority. \"Minor\" captures the specific legal disadvantage Paul is highlighting regarding inheritance.\n\n**\"Elementary principles of the world\" (v. 3, 9)**: The *stoicheia tou kosmou* refers to the basic components or \"ABC's\" of a system. In the 1st century, this could refer to the physical elements (earth, air, fire, water), the celestial bodies/spirits, or the fundamental religious rules of the world. Given the context of slavery and religious observance (v. 10), it suggests the rudimentary spiritual and legal principles that govern humanity apart from Christ.\n\n**\"Adoption into sonship\" (v. 5)**: *Huiothesia* is a technical Roman legal term for the adoption of an heir. Unlike modern adoption, which focuses on the parent-child bond, *huiothesia* focused on legal standing, inheritance rights, and the transition from the power of one *paterfamilias* to another.\n\n**\"Abba! Father!\" (v. 6)**: The Greek preserves the Aramaic *Abba* alongside the Greek *ho patēr*. This reflects a bilingual liturgical tradition in the early church, where the intimate Aramaic address used by Jesus was retained as a \"loanword\" of endearment and identity.\n\n**\"Powerless and impoverished\" (v. 9)**: *Asthenē kai ptōcha* are usually translated \"weak and beggarly.\" However, in a context about heirs and estates, \"powerless and impoverished\" (or \"bankrupt\") better highlights the irony of heirs returning to a system that has no resources to offer.\n\n**\"Zealously courting\" (vv. 17-18)**: The verb *zēlouō* refers to intense interest or \"wooing.\" The traditional \"zealously affect\" is archaic. Paul is describing a social competition for affection and loyalty.\n\n**\"Pains of childbirth\" (v. 19)**: *Ōdinō* is a visceral term for labor pains. Paul uses this maternal metaphor to describe his agonizing labor to see the character of Christ take shape in the Galatian community.\n\n**\"Slave-woman\" (vv. 22-31)**: *Paidiskē* refers specifically to a female slave or handmaid. The translation uses \"slave-woman\" to maintain the sharp contrast with the \"free woman\" (*eleuthera*), which is the heart of Paul’s allegorical argument.\n\n**\"Covenants\" (v. 24)**: *Diathēkai* refers to legal or divine \"dispositions\" or \"testaments.\" In the LXX context, it specifically refers to the solemn agreements between God and His people."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "It was for the sake of freedom that Christ set us free. Stand firm, then, and do not allow yourselves to be harnessed again to a yoke of slavery.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Look! I, Paul, tell you plainly: if you submit to circumcision, Christ will be of no benefit to you at all.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "I testify again to every man who receives circumcision that he is legally bound to perform the entire Law.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "You have been severed from Christ, you who are trying to be declared righteous by the Law; you have fallen away from grace.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For we, through the Spirit and by faith, are eagerly awaiting the hope of righteousness.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "For in Christ Jesus, neither circumcision nor its absence has any power; what matters is faith finding its expression through love.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "You were running a good race. Who cut in on you to keep you from being persuaded by the truth?",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "This kind of \"persuasion\" does not come from the one who calls you.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "A little leaven works its way through the whole batch of dough.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "I have confidence in you in the Lord that you will take no other view; but the one who is throwing you into confusion will bear the penalty, whoever he may be.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "As for me, brothers and sisters, if I am still preaching circumcision, why am I still being persecuted? In that case, the \"offense\" of the cross has been abolished.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "I wish those who are unsettling you would go all the way and emasculate themselves!",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For you were called to freedom, brothers and sisters; only do not use this freedom as a base of operations for your lower nature. Instead, serve one another as slaves through love.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "For the whole Law is summed up in a single command: \"You shall love your neighbor as yourself.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "But if you bite and devour one another, watch out, or you will be consumed by one another.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "So I say: walk by the Spirit, and you will certainly not satisfy the cravings of the lower nature.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "For the lower nature craves what is contrary to the Spirit, and the Spirit what is contrary to the lower nature. These are in direct opposition to each other, so that you do not do the things you want to do.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "But if you are led by the Spirit, you are not under the Law.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Now the works of the lower nature are obvious: sexual immorality, moral uncleanness, indecency,",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "idolatry, sorcery and drug-craft, hostilities, strife, jealousy, outbursts of anger, selfish rivalries, dissensions, factions,",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "envies, bouts of drunkenness, wild parties, and things like these. I am warning you, just as I warned you before, that those who practice such things will not inherit the kingdom of God.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faithfulness,",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "gentleness, and self-mastery. Against such things there is no law.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Those who belong to Christ Jesus have crucified the lower nature with its passions and cravings.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "If we live by the Spirit, let us also keep in step with the Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Let us not become conceited, provoking one another or envying one another.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Harnessed to a yoke\" (v. 1)**: The Greek *enékhesthe* suggests being held fast or entangled. Combined with *zugos* (yoke), it evokes the imagery of an ox being buckled into a heavy harness.\n\n**\"Severed from Christ\" (v. 4)**: *Katērgēthēte apo* means to be rendered ineffective or to be disconnected from the source of power. Given Paul's later use of cutting/circumcision imagery, \"severed\" captures the violent finality of the Greek.\n\n**\"Finding its expression\" (v. 6)**: The participle *energoumenē* suggests faith that is active and \"energized.\" It is not a static belief but a faith that moves and works through the medium of love.\n\n**\"Cut in on you\" (v. 7)**: *Enekopsen* is a technical term from the world of ancient racing, referring to a runner who breaks stride or cuts across another runner's path to obstruct them.\n\n**\"Persuasion\" (v. 8)**: Paul uses a wordplay between *peithesthai* (\"to be persuaded/obey\" in v. 7) and *peismonē* (\"persuasion\" in v. 8). He is suggesting that the \"influence\" exerted on them is not of the same character as the Truth they first heard.\n\n**\"Emasculate themselves\" (v. 12)**: *Apokopsontai* means \"to cut off.\" In the context of the circumcision debate, this is a biting, sarcastic pun. Paul is suggesting that if they are so obsessed with cutting flesh, they should go beyond circumcision and castrate themselves, like the priests of Cybele common in Asia Minor.\n\n**\"Base of operations\" (v. 13)**: *Aphormē* was often used in a military context to describe a starting point for an expedition or a supply base for an army. Paul warns that freedom should not be the beachhead from which the \"flesh\" launches its attacks.\n\n**\"Lower nature\" (vv. 13, 16, 17, 19, 24)**: The Greek *sarx* (flesh) in Paul’s letters rarely refers to physical skin and bone. It represents the human condition oriented toward self-gratification and independence from God. \"Lower nature\" or \"corrupt nature\" better captures this theological nuance for a modern reader.\n\n**\"Sorcery and drug-craft\" (v. 20)**: *Pharmakeia* refers to the use of drugs, potions, and spells. In the first century, this was inextricably linked to the occult and cultic practices. \n\n**\"Selfish rivalries\" (v. 20)**: *Eritheiai* specifically refers to the ambition of those seeking office—the \"party spirit\" or \"politicking\" that creates division for personal gain.\n\n**\"Keep in step\" (v. 25)**: *Stoikhōmen* refers to walking in a straight line or marching in military formation. It implies a disciplined alignment with the Spirit’s lead."
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "Brothers and sisters, if someone is caught unawares in some lapse, you who live by the Spirit should restore such a person with a spirit of gentle strength. But keep a watchful eye on yourself, so that you are not tempted as well.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Carry one another’s crushing burdens, and in this way you will fulfill the law of the Messiah.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For if anyone thinks they are something when they are actually nothing, they are merely deluding their own minds.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Each person should scrutinize their own work; then they will have a reason to boast based on themselves alone and not by comparing themselves to someone else.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For each person must carry their own personal load.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "The one who is being orally instructed in the Message should share all good things with the one who is instructing them.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Do not be deceived: God is not one to be snubbed. For whatever a person sows, this is exactly what they will reap.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "The one who sows into the soil of their own self-indulgent nature will reap a harvest of decay from that nature; but the one who sows into the Spirit will reap a harvest of eternal life from the Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Let us not grow weary in doing what is beautiful, for in the proper season we will reap our harvest if we do not give up.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "So then, as we have the opportunity, let us work for the good of all people, and especially for those who belong to the household of the faith.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "See what large letters I am using as I write to you with my own hand!",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "Those who want to maintain a socially acceptable appearance in the flesh are the ones trying to compel you to be circumcised. They do this only so they will not be persecuted for the cross of the Messiah.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For even those who are circumcised do not keep the Law themselves; they simply want you to be circumcised so they can boast about your flesh.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "But may I never boast in anything except the cross of our Lord Jesus the Messiah, through which the world has been crucified to me, and I to the world.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For neither circumcision nor the lack of it means anything; what matters is a new creation.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And as for all who keep in step with this standard—may peace and mercy be upon them, and upon the Israel of God.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "From now on, let no one cause me any more trouble, for I carry the brand-marks of Jesus on my own body.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "The grace of our Lord Jesus the Messiah be with your spirit, brothers and sisters. Amen.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Lapse\" (v. 1)**: The Greek *paraptōmati* suggests a false step or a blunder rather than a premeditated crime. It captures the sense of being \"overtaken\" or \"caught\" by a momentary failure.\n\n**\"Gentle strength\" (v. 1)**: The term *praütētos* (often \"meekness\") does not imply weakness. In the first century, it described power under control—like a tamed horse or a ruler who is kind despite having the power to be harsh. \n\n**\"Crushing burdens\" vs. \"Personal load\" (v. 2, 5)**: Paul uses two different words here. In verse 2, *barē* refers to heavy, overwhelming weights that require help to carry. In verse 5, *phortion* refers to a soldier’s standard-issue pack. The distinction is vital: we help others with the crises they cannot bear alone, but we are each responsible for our own standard duties.\n\n**\"The law of the Messiah\" (v. 2)**: This is a deliberate rhetorical subversion. Paul is writing to a community being pressured to follow the Mosaic Law (*Torah*). He redirects their \"law-keeping\" energy toward the sacrificial love modeled by Christ.\n\n**\"Snubbed\" (v. 7)**: The Greek *myktērizetai* literally means \"to turn up the nose at.\" It is a vivid, physical image of treating someone with contempt or thinking you can outsmart them.\n\n**\"Self-indulgent nature\" (v. 8)**: The term *sarx* (\"flesh\") in Paul’s letters is not just the physical body, but the human orientation toward self-gratification and independence from God.\n\n**\"What is beautiful\" (v. 9)**: *To kalon* is often translated as \"doing good,\" but *kalos* carries a sense of aesthetic and moral excellence—doing what is noble, right, and \"beautiful\" in its goodness.\n\n**\"Socially acceptable appearance\" (v. 12)**: *Euprosōpēsai* means to \"put on a good face.\" Paul is critiquing those who are more concerned with their standing in the religious community than with the reality of the cross.\n\n**\"Keep in step\" (v. 16)**: The verb *stoichēsousin* refers to walking in a straight line or staying in formation (like soldiers or dancers). It implies living in alignment with a specific principle.\n\n**\"Brand-marks\" (v. 17)**: *Stigmata* were marks burned into the skin of slaves or soldiers to identify their owner or commander. Paul is likely referring to the physical scars he received from beatings and stonings, which \"brand\" him as a slave of Jesus, contrasting these marks with the mark of circumcision."
    }
  ]
}