{
  "book": "Hebrews",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "In many portions and in many ways, God spoke long ago to our ancestors through the prophets.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "At the final point of these days, he spoke to us in the person of a Son, whom he appointed heir of all things and through whom he created the universe in all its ages.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "He is the radiance of God’s glory and the exact expression of his essential being, sustaining the universe by his powerful word. After he had achieved purification for sins, he sat down at the right hand of the Majesty in the highest realms.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Thus he became as much superior to the angels as the name he has inherited is more excellent than theirs.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For to which of the angels did God ever say: *You are my Son; today I have fathered you?* And again: *I will be a Father to him, and he will be a Son to me?*",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "And again, when he brings the firstborn into the inhabited world, he says: *And let all God’s angels worship him.*",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Now, regarding the angels he says: *He makes his angels winds, and his ministers a flame of fire.*",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "But regarding the Son: *Your throne, O God, is forever and ever, and the scepter of justice is the scepter of your kingdom.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "You have loved righteousness and hated lawlessness; for this reason God, your God, has anointed you with the oil of joy beyond your companions.*",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And: *You, Lord, laid the foundations of the earth in the beginning, and the heavens are the works of your hands.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "They will perish, but you remain; they will all grow old like a garment,",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "and like a robe you will roll them up; like a garment they will also be changed. But you are the same, and your years will never come to an end.*",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "But to which of the angels has he ever said: *Sit at my right hand until I make your enemies a footstool for your feet?*",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Are they not all servant-spirits sent out for ministry on behalf of those who are about to inherit salvation?",
          "paragraphStart": true
        }
      ],
      "notes": "**\"In many portions and in many ways\" (v. 1)**: The Greek *Polumerōs kai polutropōs* contains a sophisticated alliteration. The first term refers to the \"many parts\" or fragments of previous revelation, and the second to the \"many methods\" (visions, dreams, types). The translation preserves this sense of fragmentary and diverse history vs. the climactic unity of the Son.\n\n**\"In the person of a Son\" (v. 2)**: The Greek *en huiō* lacks the definite article. While most translations say \"by his Son,\" the Greek emphasizes the *character* or *quality* of the revelation. God is no longer speaking through an intermediary (a prophet), but in the mode of \"Sonship.\"\n\n**\"The universe in all its ages\" (v. 2)**: The word *aiōnas* (literally \"ages\") refers to the totality of time and space. In first-century Jewish thought, this encompassed the \"this age\" and the \"age to come,\" implying everything that exists within the framework of time.\n\n**\"Radiance... exact expression\" (v. 3)**: *Apaugasma* refers to the out-shining or effulgence of light from a source. *Charaktēr* refers to the precise imprint left by a signet ring or a die used to stamp coins. The Son is not merely a \"representation\" but the exact \"imprint\" of God’s reality.\n\n**\"Essential being\" (v. 3)**: *Hypostasis* in the first century meant the underlying essence, substance, or objective reality of a thing (as opposed to its mere appearance). The later theological distinction between \"person\" and \"substance\" had not yet developed; here, it refers to the very \"stuff\" of God's being.\n\n**\"Inhabited world\" (v. 6)**: *Oikoumenē* refers specifically to the world as it is settled and governed by humans, often implying the Roman Empire or the known world of the time.\n\n**\"Winds\" (v. 7)**: The Greek *pneumata* can mean \"spirits\" or \"winds.\" In the context of the quote from Psalm 104:4, the author is contrasting the transient, elemental nature of angels (who change like wind and fire) with the eternal, stable nature of the Son's throne.\n\n**\"Your throne, O God\" (v. 8)**: This follows the most natural reading of the Greek vocative *ho theos*. While some argue it could be translated \"God is your throne,\" the context of the chapter—which aims to demonstrate the Son's ontological superiority to angels—strongly favors the address of the Son as *theos*.\n\n**\"Servant-spirits\" (v. 14)**: *Leitourgika pneumata* refers to spirits performing \"liturgy\" or official service. In the ancient world, a *leitourgia* was a public service performed for the state or in a temple. The angels are depicted as the \"staff\" of the heavenly court, whereas the Son is the heir."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, we must pay much more consistent attention to the things we have heard, so that we do not drift away like a ship missing its harbor.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For if the message spoken through angels was binding, and every transgression and act of neglectful hearing received its just and lawful recompense,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "how shall we escape if we disregard such a great deliverance? This message of rescue began by being spoken through the Lord, and it was confirmed to us by those who heard him.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "God also added his own witness to it through signs and wonders and various miracles, and by distributing the gifts of the Holy Spirit according to his own will.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For it was not to angels that God subjected the inhabited world of the coming age, which is the subject of our discourse.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "But someone has testified somewhere, saying: *“What is a mere human that you are mindful of him,* *or a son of humanity that you care for him?*",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "*You made him lower than the angels for a little while;* *you crowned him with glory and honor;*",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "*you subjected all things under his feet.”* By subjecting \"all things\" to him, God left nothing that is not subject to him. But at the present time, we do not yet see all things subjected to him.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "However, we do see Jesus—who was made lower than the angels for a little while because of the suffering of death—now crowned with glory and honor, so that, apart from God, he might taste death on behalf of everyone.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For it was fitting that God—for whom and through whom all things exist—in bringing many sons and daughters to glory, should make the Pioneer of their salvation complete through sufferings.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "For the one who makes people holy and those who are being made holy all come from one source. For this reason, he is not ashamed to call them his brothers and sisters,",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "saying: *“I will announce your name to my brothers;* *in the midst of the congregation I will sing your praises.”*",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And again, *“I will put my trust in him.”* And again, *“Behold, here am I and the children God has given me.”*",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Therefore, since the children share in blood and flesh, he himself likewise partook of these same things, so that through his death he might break the power of the one who holds the power of death—that is, the devil—",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "and set free those who, through the fear of death, were held in a lifelong state of slavery.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For surely he does not reach out to help angels, but he reaches out to help the seed of Abraham.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Consequently, he had to be made like his brothers and sisters in every respect, so that he might become a merciful and faithful High Priest in matters relating to God, in order to make atonement for the sins of the people.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Because he himself has suffered by being tested, he is able to bring help to those who are currently being put to the test.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Drift away\" (v. 1)**: The Greek *pararuomen* is a nautical term. It describes a ship that, through carelessness or the strength of the current, drifts past its intended mooring or harbor. It captures a passive kind of loss—one does not have to actively rebel to be lost; one only needs to stop paying attention.\n\n**\"Message spoken through angels\" (v. 2)**: This refers to the Jewish tradition (also seen in Galatians 3:19 and Acts 7:53) that the Torah was mediated by angels at Mount Sinai. The author is contrasting the Mosaic Law with the \"greater\" message of the Son.\n\n**\"Inhabited world of the coming age\" (v. 5)**: The Greek *oikoumenēn tēn mellousan* refers to the future world-order or the \"world to come\" (the Messianic age).\n\n**\"Lower than the angels for a little while\" (vv. 7, 9)**: The phrase *brachy ti* can mean either \"by a small degree\" or \"for a short time.\" In the context of Jesus's incarnation and subsequent exaltation, the temporal sense (\"for a little while\") is the primary focus.\n\n**\"Apart from God\" (v. 9)**: The SBLGNT follows a difficult textual variant (*chōris theou*) rather than the more common \"by the grace of God\" (*chariti theou*). \"Apart from God\" suggests that Jesus experienced the full, isolated weight of death—even the sense of abandonment by the Father—to fully represent humanity.\n\n**\"Pioneer\" (v. 10)**: The Greek *archēgos* is difficult to translate with one word. It refers to a trailblazer, a military champion who fights on behalf of others, or a founder of a movement. It is the person who opens the way for others to follow.\n\n**\"Make... complete\" (v. 10)**: The word *teleiōsai* (often \"perfect\") does not imply that Jesus was previously imperfect or sinful. In the context of Hebrews, it refers to bringing someone to their intended goal or \"finishing\" their preparation for a specific office (in this case, the High Priesthood).\n\n**\"Blood and flesh\" (v. 14)**: The Greek word order is *haimatos kai sarkos*. While English traditionally says \"flesh and blood,\" the author places blood first, perhaps to foreshadow the sacrificial context that dominates the later chapters of the book.\n\n**\"Break the power\" (v. 14)**: The verb *katargēse* means to render someone ineffective, to nullify their power, or to put them out of business. It doesn't mean the devil no longer exists, but that his ultimate weapon—the fear of death—has been neutralized.\n\n**\"Reaches out to help\" (v. 16)**: The verb *epilambanetai* means to take hold of or to seize. In this context, it has the sense of catching someone who is falling or reaching out to rescue. The author is emphasizing that Jesus’s mission was specifically for humanity (the seed of Abraham), not for the fallen angels."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, holy brothers and sisters, you who share in a calling from the heavens, fix your attention on Jesus—the envoy and high priest of the conviction we confess.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He is faithful to the one who appointed him, just as Moses was faithful in all God’s house.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For Jesus has been deemed worthy of greater glory than Moses, just as the builder of a house enjoys more honor than the house itself.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For every house is built by someone, but the builder of all things is God.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Now Moses was faithful in all God’s house as a trusted attendant, serving as a witness to the things that would be spoken by God in the future;",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "but Christ is faithful as a Son over God’s house. And we are that house, if we hold fast to our bold confidence and the hope in which we glory.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Therefore, as the Holy Spirit says: “Today, if you hear his voice,",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "do not harden your hearts as you did in the Rebellion, during the time of the Testing in the wilderness,",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "where your ancestors put me to the test and saw my works",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "for forty years. For this reason, I was disgusted with that generation and said, ‘Their hearts are always wandering; they have not recognized my ways.’",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "So I swore an oath in my anger: ‘They shall never enter my rest.’”",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Watch out, brothers and sisters, so that there will not be in any of you an evil, unfaithful heart that falls away from the living God.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Instead, encourage one another every day, as long as it is still called “Today,” so that none of you may be hardened by the trickery of sin.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For we have become partners with the Messiah, if indeed we hold our original conviction firm until the end.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "As it is said: “Today, if you hear his voice, do not harden your hearts as you did in the Rebellion.”",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For who heard and yet rebelled? Was it not all those who came out of Egypt led by Moses?",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "And with whom was he disgusted for forty years? Was it not with those who sinned, whose corpses fell in the wilderness?",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And to whom did he swear that they would never enter his rest, if not to those who were disobedient?",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "So we see that they were unable to enter because of their unfaithfulness.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Envoy\" (v. 1)**: The Greek *apostolos* literally means \"one who is sent.\" While usually translated \"apostle,\" in this context it is paired with \"high priest.\" Just as the high priest is the people’s representative before God, Jesus is God’s authorized envoy to the people. \n\n**\"Conviction we confess\" (v. 1)**: The Greek *homologia* refers to a formal statement of allegiance or a public profession of faith. It carries a legal and liturgical weight that \"religion\" or \"faith\" lacks.\n\n**\"Trusted attendant\" (v. 5)**: The word *therapōn* is a distinct term for a servant, often used in the Septuagint for Moses. It denotes a high-status servant or an authorized representative, different from a common slave (*doulos*).\n\n**\"In which we glory\" (v. 6)**: The Greek *kauchēma* is often \"boasting,\" but in the New Testament it frequently refers to the object of one's pride or exultation. The \"hope\" is not something they are merely wishing for, but something they view as their greatest honor.\n\n**\"The Rebellion... the Testing\" (v. 8)**: The Greek text uses *parapikrasmos* and *peirasmos*. These are translations of the Hebrew place names *Meribah* and *Massah*. To a Greek reader, the literal meaning of the words (\"bitter provocation\" and \"testing\") would be more prominent than the geography.\n\n**\"Falls away\" (v. 12)**: The Greek *apostēnai* is the root of the English \"apostasy.\" In a military or political context, it means a revolt or a mutiny. In this context, it describes a relational desertion of God.\n\n**\"Partners with the Messiah\" (v. 14)**: The Greek *metochoi* means \"partakers,\" \"sharers,\" or \"business partners.\" It implies a communal participation in the status and destiny of the Christ (*Christos*).\n\n**\"Original conviction\" (v. 14)**: The Greek *hypostasis* refers to that which stands under something—a foundation, a title deed, or the essential nature of a thing. Here it refers to the foundational confidence or \"assurance\" the believers had at the start of their journey.\n\n**\"Corpses\" (v. 17)**: The Greek *kōla* literally means \"limbs.\" It is a graphic term suggesting bodies falling apart or being left as carcasses in the desert, emphasizing the severity of the judgment."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, let us be on guard, lest while the promise of entering his rest still remains open, any one of you should be found to have fallen short of it.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For we have had the good news proclaimed to us, just as they did; but the message they heard did not benefit them, because it was not fused by faith with those who listened.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For we who have believed are entering that rest, just as God has said: *As I swore in my anger, they shall never enter my rest,* even though his works were finished from the founding of the world.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For he has spoken somewhere about the seventh day in this way: *And God rested on the seventh day from all his works,*",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "and again in this passage: *They shall never enter my rest.*",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Since, then, it remains for some to enter it, and those who formerly had the good news proclaimed to them failed to enter because of their disobedience,",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "he again ordains a certain day, \"Today,\" saying through David after so long a time, as has been said before: *Today, if you hear his voice, do not harden your hearts.*",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For if Joshua had given them rest, God would not have spoken about another day after that.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Consequently, there remains a Sabbath-celebration for the people of God;",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "for the one who enters God’s rest also rests from his own works, just as God did from his.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Let us, therefore, make every effort to enter that rest, so that no one may fall by following the same pattern of disobedience.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For the Logos of God is living and active, sharper than any double-edged sword, piercing even to the point of dividing soul and spirit, joints and marrow; it is able to discern the heart’s intentions and inner thoughts.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "No creature is hidden from his sight, but all things are naked and laid bare to the eyes of the one to whom we must give an account.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Therefore, since we have a great High Priest who has passed through the heavens, Jesus the Son of God, let us hold firmly to our public confession.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "For we do not have a high priest who is unable to sympathize with our weaknesses, but one who has been tested in every way, just as we are, yet without sin.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Let us then approach the throne of grace with confidence, so that we may receive mercy and find grace to help us in our time of need.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Be on guard\" (v. 1)**: The Greek *phobēthōmen* is traditionally \"let us fear.\" However, in this context, it suggests a vigilant, cautionary stance—being \"on one's guard\" against missing an opportunity—rather than terror.\n\n**\"Fused\" (v. 2)**: The Greek *synkekerasmenous* describes a mixing or blending, like wine with water or metals in an alloy. The SBL text suggests the message failed to \"blend\" or \"fuse\" with the hearers because faith was absent. \n\n**\"They shall never enter\" (v. 3, 5)**: The Greek *Ei eiseleusontai* (literally \"If they shall enter\") is a direct translation of a Hebrew oath formula (*im-yebo’un*). In Hebrew idiom, this \"if\" functions as a strong negative; a first-century reader familiar with the Septuagint would understand this as a definitive \"they shall certainly not enter.\"\n\n**\"Joshua\" (v. 8)**: In the Greek text, the name is *Iēsous* (Jesus). While the author is referring to the Old Testament figure Joshua, the use of the identical name for both the successor of Moses and the Son of God is an intentional typological link the author expects the audience to catch. \"Joshua\" is used here for clarity, as the Greek name *Iēsous* is simply the Hellenized form of the Hebrew *Yehoshua*.\n\n**\"Sabbath-celebration\" (v. 9)**: The Greek *sabbatismos* occurs only here in the New Testament. It is distinct from *katapausis* (rest). It refers to the specific experience of keeping a Sabbath or a \"Sabbath-rest.\" \n\n**\"Logos\" (v. 12)**: As in the Johannine prologue, *Logos* here carries deep philosophical and theological weight. It refers not merely to \"the Bible\" or \"spoken words,\" but to God's active, creative, and judicial self-expression. \n\n**\"Laid bare\" (v. 13)**: The Greek *tetrachēlismena* is a graphic term. It likely derives from the practice of pulling back the neck (*trachēlos*) of a sacrificial animal to expose its throat for the knife, or a wrestling move where an opponent is gripped by the neck and forced to face their challenger. It implies total exposure and vulnerability.\n\n**\"Account\" (v. 13)**: There is a sophisticated wordplay in the Greek here. The sentence ends with *pros hon hēmin ho logos* (literally, \"to whom for us is the *logos*\"). After describing the *Logos* of God as a dissecting sword, the author notes that we must give our own *logos* (account/word) back to Him.\n\n**\"Public confession\" (v. 14)**: *Homologia* is more than a private belief; it refers to the formal, outward acknowledgement of one's faith, often in a liturgical or trial-like setting.\n\n**\"Confidence\" (v. 16)**: *Parrhēsia* originally referred to the \"freedom of speech\" or \"outspokenness\" of a citizen in a Greek city-state. In this context, it denotes the bold, unreserved approach one can have toward God, characterized by total openness."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "For every high priest taken from among the people is appointed on their behalf to attend to matters relating to God, so that he may offer both gifts and sacrifices for the sake of sins.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He is able to deal gently and moderately with the ignorant and those who have gone astray, since he himself is also clothed in human weakness.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Because of this weakness, he is obligated to make offerings for sins on his own behalf, just as he does for the people.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Furthermore, no one takes this honored office for himself; rather, one is called by God, just as Aaron was.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "In the same way, the Christ did not give himself the glory of becoming a high priest. Instead, he was appointed by the one who said to him: *You are my Son; today I have become your Father.*",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "As he also says in another place: *You are a priest forever, according to the order of Melchizedek.*",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "During his earthly life, Jesus offered up both petitions and cries for help, with loud wailing and tears, to the one who was able to save him out of death, and he was heard because of his reverent devotion.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Although he was a Son, he learned obedience from the things he suffered.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And having been brought to the ultimate goal of his purpose, he became the source of eternal salvation for all who obey him,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "having been designated by God as a high priest according to the order of Melchizedek.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "We have much to say about this, but it is difficult to explain because you have become sluggish in your listening.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "For although you ought to be teachers by this time, you actually need someone to teach you the very ABCs of God’s oracles all over again. You have come to need milk, not solid food!",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For everyone who lives on milk is unacquainted with the message of righteousness, being only an infant.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "But solid food is for the mature—those who, through habitual practice, have their perceptive senses trained to distinguish between good and evil.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Clothed in human weakness\" (v. 2)**: The Greek *perikeitai* literally means \"to be surrounded by\" or \"to wear.\" It suggests that weakness is not just an internal state but a condition that encompasses the high priest’s entire existence, much like a garment.\n\n**\"To deal gently and moderately\" (v. 2)**: The verb *metriopathein* was a specific ethical term in Hellenistic philosophy (particularly among Peripatetics). It refers to the \"middle path\" of emotion—neither being callously indifferent (*apatheia*) nor being overwhelmed by passions. In this context, it describes the high priest's ability to sympathize with sinners without being indulgent toward the sin itself.\n\n**\"Earthly life\" (v. 7)**: The Greek *en tais hēmerais tēs sarkos autou* (\"in the days of his flesh\") refers specifically to the period of Jesus’s mortal, physical existence prior to his exaltation.\n\n**\"Reverent devotion\" (v. 7)**: The term *eulabeia* carries the sense of a \"godly fear\" or \"pious care.\" While some suggest it means Jesus was heard \"and delivered from his fear,\" the more likely meaning in this priestly context is that God responded to the quality of his character and his submission to the divine will.\n\n**\"Brought to the ultimate goal of his purpose\" (v. 9)**: The Greek *teleiōtheis* is often translated as \"made perfect.\" However, in Hebrews, this term usually refers to completion, vocational reaching of a goal, or \"consecration\" in a priestly sense, rather than moral improvement (since Jesus is presented as sinless). \n\n**\"Sluggish in your listening\" (v. 11)**: The word *nōthroi* means \"lazy,\" \"dull,\" or \"numb.\" Coupled with \"hearing\" (*akois*), it suggests a voluntary state of spiritual deafness or a loss of intellectual interest in the deeper things of the faith.\n\n**\"ABCs\" (v. 12)**: The term *stoicheia* refers to the first principles, the basic elements, or the \"alphabet\" of a subject. The author is using a pedagogical metaphor: the audience has regressed to the point of needing to learn their letters again.\n\n**\"Habitual practice\" (v. 14)**: The Greek *hexin* refers to a state of mind or body acquired through custom and repetition. It is the \"muscle memory\" of the soul.\n\n**\"Perceptive senses trained\" (v. 14)**: The word *gegymnasmena* is an athletic metaphor (from which we get \"gymnastics\"). It implies rigorous, disciplined exercise of the moral faculties (*aisthētēria*) to achieve spiritual fitness."
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, leaving behind the elementary teaching about the Messiah, let us be carried forward toward maturity. We should not be laying again a foundation of repentance from dead works and of faith toward God,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "or instruction about ritual washings, the laying on of hands, the resurrection of the dead, and eternal judgment.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And this we will do, if God permits.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For it is impossible to restore again to repentance those who have once been enlightened, who have tasted the heavenly gift, who have become participants in the Holy Spirit,",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "who have tasted the goodness of God’s word and the powers of the coming age,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "and then have fallen away. To do so, they would have to crucify the Son of God all over again for themselves and hold him up to public contempt.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For ground that drinks the rain falling frequently upon it, and produces vegetation useful to those for whom it is cultivated, receives a blessing from God.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "But if it produces thorns and thistles, it is worthless and near to being cursed; its end is to be burned.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Even though we speak this way, beloved, we are convinced of better things concerning you—things that belong to salvation.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "For God is not unjust; he will not forget your work and the love you demonstrated for his name by having served the saints and continuing to serve them.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "But we greatly desire each of you to demonstrate the same diligence until the end, so that your hope may be fully realized.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "We do not want you to become sluggish, but to be imitators of those who, through faith and patient endurance, are now inheriting the promises.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For when God made his promise to Abraham, since he had no one greater by whom to swear, he swore by himself,",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "saying, “I will surely bless you and I will surely multiply you.”",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And so, after waiting with patient endurance, Abraham obtained the promise.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For people swear by something greater than themselves, and the oath serves as a confirmation that puts an end to all dispute.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "In the same way, because God wanted to demonstrate even more clearly to the heirs of the promise the unchangeable nature of his purpose, he guaranteed it with an oath.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "God did this so that, through two unchangeable things in which it is impossible for God to lie, we who have fled for refuge might have strong encouragement to seize the hope set before us.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "We have this hope as an anchor for the soul, both certain and secure, entering into the inner sanctuary behind the curtain,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "where Jesus has entered as a forerunner on our behalf, having become a high priest forever according to the order of Melchizedek.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Maturity\" (v. 1)**: The Greek *teleiotēta* does not refer to flawless moral perfection, but to completeness, functional wholeness, or adulthood. In the context of the preceding passage (5:11-14), it refers to moving from the \"milk\" of infancy to the \"solid food\" of spiritual adulthood.\n\n**\"Dead works\" (v. 1)**: This refers to deeds that do not possess the life of God—likely ritual observances or acts performed under the Law without faith, which lead only to the grave rather than to life.\n\n**\"Ritual washings\" (v. 2)**: The Greek *baptismōn* is plural. While the singular *baptisma* usually refers to Christian baptism, the plural often refers to the various ceremonial washings or purifications (ablutions) found in Judaism. The author is likely referring to the foundational transition from Jewish ritual washings to Christian baptism.\n\n**\"Enlightened\" (v. 4)**: In the early church, *phōtisthentas* (\"having been enlightened\") became a technical term for baptism, but it more broadly refers to the initial reception of the Gospel and the \"light\" of the knowledge of God.\n\n**\"Hold him up to public contempt\" (v. 6)**: The Greek *paradeigmatizontas* implies making a public example of someone, specifically in a shameful or mocking way. In this context, it suggests that apostasy publicly validates the original shaming and crucifixion of Jesus.\n\n**\"Sluggish\" (v. 12)**: The word *nōthroi* is the same word used in 5:11 (\"dull of hearing\"). It suggests a state of spiritual laziness or a loss of momentum.\n\n**\"I will surely bless you...\" (v. 14)**: The Greek *ei mēn eulogōn eulogēsō* preserves a Hebrew idiomatic way of expressing intensity through repetition (an infinitive absolute construction). \"Surely\" is used to capture this emphatic force.\n\n**\"Forerunner\" (v. 20)**: The word *prodromos* refers to a scout, a lead ship in a fleet, or a military pioneer who goes ahead of the main body to secure a position. It emphasizes that Jesus did not just enter the heavenly sanctuary alone, but opened a path for others to follow.\n\n**\"Behind the curtain\" (v. 19-20)**: This is a direct allusion to the *katapetasma*, the heavy veil that separated the Holy Place from the Most Holy Place (the Holy of Holies) in the Tabernacle and Temple. The original audience would have understood this as entering the very presence of the Shekinah glory of God."
    },
    {
      "chapter": 7,
      "verses": [
        {
          "verse": 1,
          "text": "For this Melchizedek, King of Salem, priest of the Most High God, met Abraham returning from the defeat of the kings and blessed him.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "To him Abraham apportioned a tenth of everything. By the translation of his name, he is first \"King of Righteousness,\" and then he is also King of Salem, which means \"King of Peace.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Without father, without mother, without genealogy, having neither a beginning of days nor an end of life, but having been made to resemble the Son of God, he remains a priest perpetually.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Now consider how great this man was, to whom even Abraham the patriarch gave a tenth of the choice spoils.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "And those from the sons of Levi who receive the priestly office have a command according to the Law to collect a tenth from the people—that is, from their own brothers—even though they have all come from the body of Abraham.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But this man, who does not trace his descent from them, took a tenth from Abraham and blessed the one who held the promises.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Now beyond all dispute, the lesser is blessed by the greater.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "In the one case, mortal men receive tenths; but in the other, he is received of whom it is witnessed that he lives.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "One might even say that through Abraham, even Levi, the one who receives tenths, has paid a tenth,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "for he was still in the body of his ancestor when Melchizedek met him.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Now if the goal of the Law had been reached through the Levitical priesthood (for on the basis of it the people were given the Law), what further need was there for another priest to arise according to the order of Melchizedek, rather than being designated according to the order of Aaron?",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "For when there is a change of the priesthood, of necessity a change of the Law also occurs.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For the one about whom these things are said belongs to a different tribe, from which no one has ever served at the altar.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For it is plain that our Lord descended from Judah, a tribe regarding which Moses said nothing about priests.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And this becomes even more evident if another priest arises according to the likeness of Melchizedek,",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "who has become a priest not according to a law of physical requirement, but according to the power of an indestructible life.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For it is witnessed of him: \"You are a priest forever, according to the order of Melchizedek.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For on the one hand, a previous command is set aside because of its weakness and uselessness",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "(for the Law brought nothing to its intended goal), but on the other hand, there is the introduction of a better hope, through which we draw near to God.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "And this was not without an oath! For while others became priests without an oath,",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "he became one with an oath through the one saying to him: \"The Lord has sworn and will not change his mind: 'You are a priest forever.'\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Because of this, Jesus has become the guarantor of a better covenant.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Furthermore, there have been many priests because they were prevented by death from continuing in office;",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "but because he remains forever, he holds a priesthood that is permanent and non-transferable.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Therefore, he is also able to save completely and for all time those who approach God through him, since he lives forever to intercede on their behalf.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "For such a high priest was indeed fitting for us: holy, innocent, undefiled, set apart from sinners, and exalted above the heavens.",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "He has no daily need, like those high priests, to offer up sacrifices first for his own sins and then for those of the people; for he did this once for all when he offered up himself.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "For the Law appoints men as high priests who have weakness, but the word of the oath, which came after the Law, appoints a Son, who has been brought to the goal of perfection forever.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Choice spoils\" (v. 4)**: The Greek *akrothiniōn* literally refers to the \"top of the heap.\" In a military context, it refers to the best portions of the plunder offered to the gods. \n\n**\"From the body\" (v. 5, 10)**: The Greek *osphyos* literally means \"loins.\" In the biological understanding of the time, the \"seed\" of all future descendants was thought to be physically present within the ancestor. \"Body\" or \"ancestry\" captures the sense for a modern reader, though the author is making a literalist argument about Levi’s physical presence within Abraham.\n\n**\"Goal\" / \"Reached the goal\" (v. 11, 19, 28)**: The Greek terms *teleiōsis* and *eteleiōsen* are often translated as \"perfection.\" However, in Hebrews, the nuance is teleological—attaining the end or the intended purpose of a system. The Law was a \"sketch,\" but it could not bring the worshiper to the \"finish line\" of direct access to God.\n\n**\"Physical requirement\" (v. 16)**: The Greek *sarkinēs* (fleshly) refers to the Levitical requirement of genealogy and physical descent. The author contrasts a priesthood based on \"who your father was\" with one based on the \"power of an indestructible life.\"\n\n**\"Set aside\" (v. 18)**: The term *athetēsis* is a legal technical term for the annulment of a decree or the cancellation of a debt.\n\n**\"Guarantor\" (v. 22)**: *Engyos* is a legal and commercial term for a person who provides \"surety\" or \"bail,\" standing as the legal guarantee that the terms of a contract (covenant) will be fulfilled.\n\n**\"Non-transferable\" (v. 24)**: The word *aparabaton* can mean \"unchangeable,\" but in a legal priestly context, it refers to a position that does not pass from one person to another upon death. Because Jesus does not die, his priesthood is not \"handed off.\"\n\n**\"Save completely and for all time\" (v. 25)**: The phrase *eis to panteles* carries both a temporal sense (forever) and a qualitative sense (totally/completely). The translation combines these to show the dual force of Christ's ability to save.\n\n**\"Innocent\" (v. 26)**: *Akakos* means \"without malice\" or \"guileless.\" It describes a character that is intrinsically pure, rather than just legally \"not guilty.\""
    },
    {
      "chapter": 8,
      "verses": [
        {
          "verse": 1,
          "text": "The main point of everything we are saying is this: we have a high priest of such a kind that he has taken his seat at the right hand of the throne of Majesty in the heavens.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He serves as a public minister of the holy sanctuary—the true Tabernacle, which the Lord pitched and not any human hand.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Now, since every high priest is appointed for the purpose of offering both gifts and sacrifices, it was necessary for this one also to have something to offer.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "If he were on earth, he would not even be a priest, because there are already those who offer the gifts according to the Law.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "These priests serve a mere sketch and shadow of the heavenly realities, just as Moses was divinely instructed when he was about to construct the Tabernacle: \"See to it,\" He said, \"that you make everything according to the pattern shown to you on the mountain.\"",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But as it stands, Jesus has attained a far more excellent ministry, to the same degree that he is the mediator of a better covenant, which has been legally enacted upon better promises.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "For if that first covenant had been faultless, no place would have been sought for a second.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But finding fault with the people, God says: \"Look, the days are coming, says the Lord, when I will complete a new covenant for the house of Israel and for the house of Judah.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "It will not be like the covenant I made with their ancestors on the day I took them by the hand to lead them out of the land of Egypt; because they did not remain faithful to my covenant, I, in turn, disregarded them, says the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For this is the covenant I will covenant with the house of Israel after those days, says the Lord: I will put my laws into their minds and inscribe them upon their hearts. I will be their God, and they will be my people.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And they will certainly not have to teach each one his fellow-citizen or each one his brother, saying, 'Know the Lord,' because they will all know me, from the least of them to the greatest.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For I will be merciful toward their wrongdoings, and I will never again call their sins to mind.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "By using the word \"New,\" he has rendered the first covenant obsolete. And whatever is becoming obsolete and growing old is on the verge of vanishing.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"The main point\" (v. 1)**: The Greek *kephalaion* can mean a \"summary\" or a \"sum of money,\" but in this rhetorical context, it refers to the \"gist\" or the \"chief point\" of the preceding argument regarding the Melchizedekian priesthood.\n\n**\"Majesty\" (v. 1)**: The Greek *megalōsynē* is a Jewish circumlocution used to avoid speaking the divine name of God directly. It captures the awesome dignity of the heavenly court.\n\n**\"Public minister\" (v. 2)**: The word *leitourgos* refers to someone who performs a public service or office, often at their own expense. In a religious context, it refers to a priest’s official duty. \"Minister\" is the standard translation, but \"public\" is added to reflect the civic/liturgical weight of the Greek term.\n\n**\"Sketch and shadow\" (v. 5)**: *Hypodeigma* refers to a sign, a copy, or a preliminary draft. Coupled with *skia* (shadow), the author is emphasizing that the earthly Temple is a derivative, two-dimensional representation of a three-dimensional heavenly reality.\n\n**\"Pattern\" (v. 5)**: The Greek *typos* (the source of the English \"type\") refers to a visual model or a blueprint. The author implies that Moses was shown the \"original\" in heaven to copy on earth.\n\n**\"Legally enacted\" (v. 6)**: The verb *nenomothetētai* comes from the word for \"law\" (*nomos*). The New Covenant is not just a vague promise; it has been established with the force of divine law.\n\n**\"I disregarded them\" (v. 9)**: The author follows the Septuagint (LXX) reading of Jeremiah 31:32 (*ēmelesa*), which means \"to be unconcerned\" or \"to neglect.\" This differs from the Masoretic Hebrew text, which says \"though I was a husband to them.\" For the original audience of Hebrews, the Greek Old Testament was their primary scriptural authority.\n\n**\"Obsolete... vanishing\" (v. 13)**: The author uses two distinct words: *pepalaiōken* (made old/obsolete) and *aphanismou* (vanishing/disappearing). This suggests that while the New Covenant has legally replaced the Old, the old system was, at the time of writing, in the process of physically fading away (likely a reference to the impending destruction of the Temple in 70 AD)."
    },
    {
      "chapter": 9,
      "verses": [
        {
          "verse": 1,
          "text": "Now even the first covenant had regulations for worship and a sanctuary belonging to this world.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For a tabernacle was constructed: in the first room—which is called the Holy Place—were the lampstand, the table, and the presentation of the loaves.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Behind the second curtain was the room called the Holy of Holies,",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "which contained the golden altar of incense and the ark of the covenant, covered on all sides with gold. Inside the ark were the golden jar containing the manna, Aaron’s staff that had budded, and the tablets of the covenant.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Above it were the Cherubim of glory overshadowing the place of atonement. We cannot speak of these things now in detail.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "With these things having been prepared in this way, the priests enter the first room continually to perform their ritual duties.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "But only the high priest enters the second room, and only once a year—never without blood, which he offers for himself and for the sins the people committed in ignorance.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "By this the Holy Spirit was making it clear that the way into the true Holy Place had not yet been revealed as long as the first tabernacle still had standing.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "This is an illustration for the present time: the gifts and sacrifices being offered are not able to perfect the conscience of the worshiper.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "They deal only with food and drink and various ceremonial washings—regulations for the body imposed until the time of setting things right.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "But when Christ appeared as High Priest of the good things that have now come, he passed through the greater and more perfect tabernacle—one not made by human hands, which is to say, not part of this creation.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "He entered the Holy Place once for all, not by the blood of goats and calves, but by his own blood, having secured eternal redemption.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For if the blood of goats and bulls and the ashes of a heifer, when sprinkled on those who are ritually defiled, sanctifies them so that their flesh is clean,",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "how much more will the blood of Christ—who through the eternal Spirit offered himself unblemished to God—purify our conscience from dead works so that we may worship the living God?",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Because of this, he is the mediator of a new covenant, so that those who have been called may receive the promise of the eternal inheritance, since a death has occurred to redeem them from the transgressions committed under the first covenant.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "For where there is a last will and testament, it is necessary to establish the death of the one who made it.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "A will only becomes valid upon death; it never has legal force while the one who made it is still alive.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "This is why even the first covenant was not inaugurated without blood.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "For when every commandment had been spoken by Moses to all the people according to the law, he took the blood of calves and goats, along with water, scarlet wool, and hyssop, and sprinkled both the scroll itself and all the people,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "saying, “This is the blood of the covenant which God commanded for you.”",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "In the same way, he sprinkled the tabernacle and all the vessels used in worship with the blood.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Indeed, under the law, nearly everything is purified with blood, and without the shedding of blood there is no release from guilt.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "It was necessary, then, for these sketches of heavenly things to be purified by such means, but the heavenly things themselves require better sacrifices than these.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "For Christ did not enter a man-made sanctuary—an earthly counterpart to the true one—but he entered heaven itself, now to appear in the presence of God on our behalf.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Nor did he enter to offer himself repeatedly, as the high priest enters the Holy Place every year with blood that is not his own.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Otherwise, he would have had to suffer many times since the foundation of the world. But now, he has appeared once for all at the climax of the ages to do away with sin by the sacrifice of himself.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "And just as it is appointed for human beings to die once, and after that to face judgment,",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "so Christ, having been offered once to bear the sins of many, will appear a second time—not to deal with sin, but to bring salvation to those who are eagerly awaiting him.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"A sanctuary belonging to this world\" (v. 1)**: The Greek *kosmikon* emphasizes that the first sanctuary belonged to the \"cosmos\" or the physical, created order, in contrast to the heavenly sanctuary mentioned later.\n\n**\"Presentation of the loaves\" (v. 2)**: Translates *prothesis tōn artōn* (literally \"the setting forth of the bread\"). This refers to what is traditionally called \"shewbread,\" but the Greek stresses the ritual act of presenting the loaves before God.\n\n**\"The place of atonement\" (v. 5)**: The Greek *hilastērion* is the term used in the Septuagint (LXX) for the *kapporet* or \"mercy seat\"—the gold lid of the Ark. It literally refers to the place where atonement is made or where wrath is propitiated.\n\n**\"Sins... committed in ignorance\" (v. 7)**: The word *agnoēmatōn* refers specifically to sins committed through error or lack of knowledge, reflecting the Old Testament distinction between unintentional sins and \"high-handed\" rebellion (Leviticus 4).\n\n**\"Illustration\" (v. 9)**: The Greek *parabolē* suggests a symbolic representation or a figure that points to a deeper reality.\n\n**\"Time of setting things right\" (v. 10)**: The Greek *diorthōseōs* refers to a reformation, a correction, or the making straight of a situation. It describes the transition from the temporary old order to the permanent new order.\n\n**\"Last will and testament / Covenant\" (vv. 16-17)**: The Greek word *diathēkē* possesses a dual meaning that English lacks. In verses 1-15 and 18-22, it carries the sense of \"covenant\" (a formal agreement between parties). However, in verses 16-17, the author employs a wordplay based on its meaning in Greek civil law: a \"last will and testament.\" The argument relies on the fact that a *diathēkē* (will) is only enforceable after a death. The translation uses \"will\" in these two verses to make the author's logic coherent to an English reader.\n\n**\"Release from guilt\" (v. 22)**: *Aphesis* is often translated as \"forgiveness,\" but its root meaning is \"release,\" \"dismissal,\" or \"remission.\" In a legal and sacrificial context, it refers to the lifting of the debt or penalty of sin.\n\n**\"Earthly counterpart\" (v. 24)**: The Greek *antitypa* refers to something that corresponds to or represents a pattern (*typos*). The earthly sanctuary is a physical representation of the heavenly original.\n\n**\"Climax of the ages\" (v. 26)**: *Synteleia tōn aiōnōn* refers to the consummation or the meeting point of the ages—the end of the old era and the beginning of the new.\n\n**\"Do away with sin\" (v. 26)**: The Greek *athetēsin* is a legal term for the annulment or cancellation of a decree or contract. Christ’s sacrifice didn't just cover sin; it legally annulled its power and standing."
    },
    {
      "chapter": 10,
      "verses": [
        {
          "verse": 1,
          "text": "For the Law contains only a shadow of the good things to come, not the actual form of those realities. Therefore, it is never able to bring to the ultimate goal those who approach year after year with the same sacrifices that they offer continually.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Otherwise, would they not have ceased being offered? For the worshipers, having been purified once for all, would no longer have any consciousness of sins.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "But in these sacrifices there is a yearly reminder of sins;",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "for it is impossible for the blood of bulls and goats to take away sins.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Therefore, when Christ comes into the world, he says: \"Sacrifice and offering you did not desire, but a body you prepared for me;",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "in whole burnt offerings and sacrifices for sin you took no pleasure.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Then I said, 'Behold, I have come—in the scroll of the book it is written concerning me—to do your will, O God.'\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Previously he says, \"Sacrifices and offerings and whole burnt offerings and sacrifices for sin you did not desire, nor did you take pleasure in them\" (these are offered according to the Law).",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Then he said, \"Behold, I have come to do your will.\" He takes away the first in order to establish the second.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "By that \"will\" we have been made holy through the offering of the body of Jesus Christ once for all.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Furthermore, every priest stands daily performing his religious service, offering the same sacrifices again and again, which are never able to strip away sins.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "But this man, after offering a single sacrifice for sins for all time, sat down at the right hand of God,",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "waiting from then on until his enemies are made a footstool for his feet.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For by a single offering he has brought to the final goal for all time those who are being made holy.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And the Holy Spirit also testifies to us; for after saying,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "\"This is the covenant that I will decree for them after those days, says the Lord: I will put my laws upon their hearts, and I will write them upon their minds,\"",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "he adds, \"And their sins and their lawless acts I will remember no more.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Now where there is forgiveness of these, there is no longer an offering for sin.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Therefore, brothers and sisters, since we have the right to speak freely and enter the sanctuary by the blood of Jesus—",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "an entrance he inaugurated for us as a fresh and living way through the curtain, that is, through his flesh—",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "and since we have a great priest over the house of God,",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "let us approach with a true heart in the full assurance of faith, our hearts having been sprinkled clean from an evil consciousness and our bodies washed with pure water.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Let us hold fast the confession of our hope without wavering, for the one who promised is faithful.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "and let us consider how to stir one another up to love and good works,",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "not abandoning our own assembling together, as is the habit of some, but encouraging one another—and all the more as you see the Day approaching.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "For if we go on sinning willfully after receiving the full knowledge of the truth, there no longer remains a sacrifice for sins,",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "but only a certain terrifying expectation of judgment and a fury of fire that is about to consume the adversaries.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Anyone who set aside the Law of Moses died without mercy on the testimony of two or three witnesses.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "How much worse punishment do you think will be deserved by the one who has trampled underfoot the Son of God, and who has regarded as ordinary the blood of the covenant by which he was made holy, and who has insulted the Spirit of grace?",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "For we know the one who said, \"Vengeance belongs to me; I will repay,\" and again, \"The Lord will judge his people.\"",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "It is a terrifying thing to fall into the hands of the living God.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "But remember the former days when, after you were enlightened, you endured a great contest of sufferings.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "On the one hand, you were theatrically exposed to insults and afflictions; on the other, you became partners with those who were treated this way.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "For you showed sympathy to those in prison and accepted the seizure of your possessions with joy, knowing that you yourselves have a better and lasting possession.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "Therefore, do not throw away your confidence, which has a great reward.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "For you have need of endurance so that, when you have done the will of God, you may receive what was promised.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "For \"In just a very little while, the one who is coming will come and will not delay;",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "but my righteous one shall live by faith, and if he shrinks back, my soul takes no pleasure in him.\"",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "But we are not among those who shrink back to destruction, but among those who have faith for the preserving of the soul.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Bring to the ultimate goal\" (v. 1, 14)**: The Greek *teleiōsai* is often translated as \"perfect.\" However, in Hebrews, it carries the sense of reaching the intended destination or completing a process (fitting someone for God's presence). \"Perfect\" in modern English often implies moral flawlessness; \"ultimate goal\" or \"final goal\" captures the teleological sense of the Greek.\n\n**\"Consciousness of sins\" (v. 2)**: *Syneidēsin* refers to the internal awareness or \"conscience.\" The author's point is that the Old Covenant rituals left the worshiper with an internal sense of lingering debt; the New Covenant removes the very awareness of that debt.\n\n**\"Strip away sins\" (v. 11)**: The Greek *perielein* is a strong verb meaning \"to take away from all around\" or \"to strip off\" (like a garment). It is more graphic than simply \"forgive.\"\n\n**\"Decree\" (v. 16)**: *Diathēsomai* is the verbal form of *diathēkē* (covenant). It implies a legal or sovereign disposition rather than a negotiated agreement.\n\n**\"Right to speak freely and enter\" (v. 19)**: *Parrēsian* means \"boldness\" or \"freedom of speech.\" In a political context, it was the right of a citizen to speak openly. Here, it signifies the unhindered right of access to God’s presence.\n\n**\"Fresh\" (v. 20)**: *Prosphaton* originally meant \"newly slaughtered\" or \"freshly killed.\" While it came to mean \"recent\" or \"new\" in Koine, the sacrificial context of Hebrews suggests a nuance that this \"way\" is eternally \"fresh\" through the sacrifice of Christ.\n\n**\"Ordinary\" (v. 29)**: *Koinon* means \"common\" or \"profane.\" It refers to treating the blood of Christ as if it were just like any other human blood, devoid of its sacred, covenant-ratifying power.\n\n**\"Theatrically exposed\" (v. 33)**: *Theatrizomenoi* specifically evokes the theater (*theatron*). To be \"theatrically exposed\" was to be made a public spectacle, often in a shameful or mocking way, as if on a stage before a crowd.\n\n**\"Preserving of the soul\" (v. 39)**: *Peripoiēsin* refers to the gaining, preserving, or keeping safe of something. It stands in contrast to *apōleian* (destruction/loss)."
    },
    {
      "chapter": 11,
      "verses": [
        {
          "verse": 1,
          "text": "Now faith is the underlying reality of things hoped for, the proof-demonstration of things not seen.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For by this the elders of old received a divine testimony of approval.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "By faith we perceive that the cosmos and its eras were brought into order by the spoken word of God, so that what is seen did not come into being from things that are visible.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "By faith Abel offered to God a more excellent sacrifice than Cain, through which he was attested to be righteous, God himself bearing witness to his gifts; and through his faith, though he died, he still speaks.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "By faith Enoch was taken up so that he should not see death, and he was not found because God had taken him; for before his being taken, he was attested as having been well-pleasing to God.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But without faith it is impossible to be well-pleasing; for the one who approaches God must believe that he exists and that he becomes a rewarder to those who seek him out.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "By faith Noah, having been divinely warned about things not yet seen, with reverent caution constructed an ark for the salvation of his household; through this he condemned the world and became an heir of the righteousness that comes by faith.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "By faith Abraham, when he was called, obeyed by going out to a place which he was to receive as an inheritance; and he went out, not knowing where he was going.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "By faith he lived as a resident alien in the land of promise as in a foreign land, dwelling in tents with Isaac and Jacob, the fellow-heirs of the same promise.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For he was looking forward to the city that has firm foundations, whose architect and builder is God.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "By faith Sarah herself also received power for the founding of a lineage even beyond the prime of life, since she regarded the one who had promised to be faithful.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Therefore, from one man—and him as good as dead—there were born descendants as numerous as the stars of heaven and as the countless grains of sand by the seashore.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "All these died in faith without having received the promises, but they saw them and greeted them from a distance, confessing that they were strangers and temporary residents on the earth.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "For those who say such things make it clear that they are seeking a homeland.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And if they had been thinking of that land from which they had gone out, they would have had opportunity to return.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But as it is, they are reaching out for a better one—that is, a heavenly one. Therefore God is not ashamed to be called their God, for he has prepared a city for them.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "By faith Abraham, when he was tested, offered up Isaac; he who had welcomed the promises was ready to offer up his only son,",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "regarding whom it had been said, \"Through Isaac shall your offspring be named.\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "He reasoned that God was able to raise people even from the dead—from which, figuratively speaking, he did receive him back.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "By faith Isaac blessed Jacob and Esau, even concerning things to come.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "By faith Jacob, when he was dying, blessed each of the sons of Joseph, and bowed in worship over the top of his staff.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "By faith Joseph, at the end of his life, made mention of the exodus of the sons of Israel and gave instructions concerning his bones.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "By faith Moses, when he was born, was hidden for three months by his parents, because they saw that the child was exceptional, and they were not afraid of the king’s edict.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "By faith Moses, when he had grown up, refused to be called the son of Pharaoh’s daughter,",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "choosing instead to be ill-treated with the people of God rather than to have the fleeting enjoyment of sin.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "He considered the disgrace of the Anointed One to be greater wealth than the treasures of Egypt, for he was looking ahead to the reward.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "By faith he left Egypt, not fearing the rage of the king; for he persevered as one seeing the invisible One.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "By faith he kept the Passover and the sprinkling of the blood, so that the Destroyer of the firstborn would not touch them.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "By faith they crossed the Red Sea as if through dry land, which the Egyptians, when they attempted it, were swallowed up.",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "By faith the walls of Jericho fell after they had been encircled for seven days.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "By faith Rahab the prostitute did not perish with those who were disobedient, because she had welcomed the spies with peace.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "And what more shall I say? For time will fail me if I tell of Gideon, Barak, Samson, Jephthah, of David and Samuel and the prophets,",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "who through faith conquered kingdoms, administered justice, obtained promises, shut the mouths of lions,",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "quenched the power of fire, escaped the edge of the sword, were made strong out of weakness, became mighty in war, and put foreign armies to flight.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "Women received their dead back by resurrection. Others were tortured on the rack, refusing to accept release, so that they might obtain a better resurrection.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "Still others experienced mockings and scourgings, and even chains and imprisonment.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "They were stoned, they were sawn in two, they were murdered by the sword. They went about in sheepskins and goatskins, destitute, afflicted, ill-treated—",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "of whom the world was not worthy—wandering over deserts and mountains, and in caves and holes in the ground.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "And all these, though they were attested through their faith, did not receive the promise,",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "because God had foreseen something better for us, so that they should not be made complete apart from us.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Underlying reality\" (v. 1)**: The Greek *hypostasis* refers to that which stands under something else—the foundation or the objective essence of a thing. In the context of property, it referred to the \"title deeds.\" Faith is the \"substance\" or \"reality\" that provides the grounding for hope.\n\n**\"Proof-demonstration\" (v. 1)**: *Elenchos* is a term from legal and philosophical contexts (as in the Socratic *elenchus*) meaning a demonstration, proof, or conviction that brings a hidden reality to light.\n\n**\"Cosmos and its eras\" (v. 3)**: *Tous aiōnas* (the ages) refers not just to the physical universe but to the totality of time, space, and the structures of history.\n\n**\"Exceptional\" (v. 23)**: *Asteion* (literally \"of the city,\" meaning refined or beautiful) is the term used in the Septuagint (Exodus 2:2) to describe the infant Moses. It suggests a divine or unusual quality that signaled God’s favor.\n\n**\"Disgrace of the Anointed One\" (v. 26)**: *Ton oneidismon tou Christou*. While *Christos* is often left as \"Christ,\" its literal meaning is \"Anointed One.\" The author views the suffering of the faithful in the Old Testament as participation in the same reproach/disgrace suffered by the Messiah.\n\n**\"Founding of a lineage\" (v. 11)**: The Greek *katabolēn spermatos* (\"deposition of seed\") is a masculine idiom for procreation. However, Sarah is the subject of the sentence. Translating this as \"founding of a lineage\" or \"founding of a seed-line\" preserves the biological metaphor while making sense of Sarah as the recipient of \"power\" (*dynamis*) for this purpose.\n\n**\"Tortured on the rack\" (v. 35)**: *Etympanisthēsan* refers to being beaten to death on the *tympanon*, an instrument of torture shaped like a drum or a wheel, often used to stretch the victim's body.\n\n**\"Made complete\" (v. 40)**: *Teleiōthōsin* refers to reaching the goal or the intended end (*telos*). The \"perfection\" or \"completion\" of the Old Testament saints is tied to the arrival of the \"something better\" provided through the new covenant."
    },
    {
      "chapter": 12,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, since we are surrounded by such a massive cloud of witnesses who have testified to the power of faith, let us also strip off every weight and the sin that so easily entangles us, and let us run with steady endurance the racecourse set out before us.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "We do this by fixing our eyes on Jesus, the trailblazer and the one who brings our faith to its finished goal. For the sake of the joy set before him, he endured a cross, disregarding its shame, and has taken his seat at the right hand of the throne of God.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Consider him who has endured such hostility from sinners against himself, so that you do not grow weary or lose heart in your souls.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "In your struggle against sin, you have not yet resisted to the point of shedding your blood.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "And you have completely forgotten the word of encouragement that addresses you as sons: *\"My son, do not think lightly of the Lord’s formative discipline, nor give up when you are corrected by him.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "For the Lord disciplines the one he loves, and he whips every son whom he welcomes as his own.\"*",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "You must endure your sufferings as formative discipline; God is treating you as sons. For what son is there whom a father does not discipline?",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "If you are left without the discipline in which all sons participate, then you are illegitimate children and not true sons.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Furthermore, we had our earthly fathers to discipline us and we respected them; shall we not much more submit to the Father of spirits and truly live?",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For our earthly fathers disciplined us for a short time as seemed best to them, but God does so for our absolute benefit, so that we may share in his holiness.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Now, all discipline seems painful rather than pleasant at the time, but later it yields the peaceful fruit of righteousness to those who have been trained by it in the gymnasium of life.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Therefore, strengthen your drooping hands and your paralyzed knees,",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "and make straight paths for your feet, so that the limb that is lame may not be dislocated but may instead be healed.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Pursue peace with everyone, and the holiness without which no one will see the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "See to it that no one falls short of the grace of God; that no \"root of bitterness\" springs up to cause trouble and defile the community;",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "and that no one is sexually immoral or godless like Esau, who sold his own birthright for a single meal.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For you know that even afterward, when he desired to inherit the blessing, he was rejected; for he found no opportunity to reverse the decision, even though he sought the blessing with tears.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For you have not come to something that can be touched—to a blazing fire, to gloom and deep darkness and a storm,",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "to the blast of a trumpet and a voice speaking such words that those who heard it begged that not another word be spoken to them.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For they could not bear the command: \"If even an animal touches the mountain, it must be stoned.\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Indeed, so terrifying was the phenomenon that Moses said, \"I am terrified and trembling.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Instead, you have come to Mount Zion—to the city of the living God, the heavenly Jerusalem—and to myriads of angels in festive assembly,",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "and to the congregation of the firstborn whose names are enrolled in heaven, and to God the Judge of all, and to the spirits of the righteous who have been brought to their goal,",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "and to Jesus, the mediator of a new covenant, and to the sprinkled blood that speaks a better word than the blood of Abel.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "See to it that you do not refuse the one who is speaking. For if those people did not escape when they refused the one who warned them on earth, how much less will we escape if we turn away from the one who warns from heaven?",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "At that time his voice shook the earth, but now he has promised, saying, \"Once more I will shake not only the earth but also the heaven.\"",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "This phrase \"once more\" indicates the removal of the things that can be shaken—that is, created things—so that the things that cannot be shaken may remain.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Therefore, since we are receiving a kingdom that cannot be shaken, let us be grateful, and by this gratitude let us offer to God acceptable worship with deep reverence and awe.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "For indeed, our God is a consuming fire.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Witnesses\" (v. 1)**: The Greek *martyrōn* refers back to the \"Hall of Faith\" in chapter 11. These are not merely spectators in a stadium, but \"testifiers\" whose lives bear witness to the validity of living by faith.\n\n**\"Trailblazer\" (v. 2)**: The Greek *archēgon* suggests a pioneer, a pathfinder, or a founder who opens the way for others to follow. \"Author\" is the traditional rendering, but it misses the kinetic, \"leader of the way\" nuance essential to the racecourse metaphor.\n\n**\"Formative discipline\" (vv. 5-11)**: The Greek *paideia* is much broader than the English \"punishment\" or \"discipline.\" It refers to the entire system of education, training, and character formation used to bring a child to maturity. The translation \"formative discipline\" attempts to capture this educational and developmental intent.\n\n**\"Trained... in the gymnasium of life\" (v. 11)**: The Greek *gegymnasmenois* explicitly evokes the *gymnasion*. The author is maintaining the athletic imagery introduced in verse 1.\n\n**\"Godless\" (v. 16)**: The Greek *bebēlos* describes someone who treats sacred things as common or profane. Esau is the archetype because he traded a spiritual inheritance for a momentary physical appetite.\n\n**\"Festive assembly\" (v. 22)**: The word *panēgyrei* refers to a massive public gathering or a national festival. It contrasts the \"festal\" joy of the New Covenant assembly with the \"terrifying\" isolation of the Sinai experience.\n\n**\"Brought to their goal\" (v. 23)**: The Greek *teteleiōmenōn* (from *teleioō*) is often translated as \"made perfect.\" However, in Hebrews, this word group refers to reaching the intended destination or completion of a process. These are the righteous of the Old Covenant who have finally reached the goal of their faith through the work of Christ.\n\n**\"Sprinkled blood that speaks a better word\" (v. 24)**: This alludes to Genesis 4:10, where Abel's blood \"cried out\" from the ground for vengeance. Jesus’s blood \"speaks\" a better word because it cries out for for forgiveness and reconciliation.\n\n**\"Removal\" (v. 27)**: The Greek *metathesin* suggests a displacement or a change in status. The author argues that the \"shaking\" of the cosmos filters out the temporary (the created order) to reveal the permanent (the Kingdom).\n\n**\"Let us be grateful\" (v. 28)**: The Greek *echōmen charin* is a common idiom for \"let us give thanks\" or \"let us have gratitude.\" This gratitude is presented as the necessary condition for \"acceptable worship.\""
    },
    {
      "chapter": 13,
      "verses": [
        {
          "verse": 1,
          "text": "Let love for the family of believers continue.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Do not neglect hospitality to strangers, for by doing this some have hosted angels without knowing it.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Remember those in prison as though you were bound alongside them, and those being mistreated as though you yourselves were suffering in the body.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Let marriage be held in high esteem among everyone and the marriage bed be kept untainted, for God will judge the sexually immoral and the adulterous.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "Keep your way of life free from the love of money, being content with what you have. For he himself has said, \"I will never, ever desert you, nor will I ever, ever abandon you.\"",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "So we can say with confidence, \"The Lord is my helper; I will not be afraid. What can a mere human do to me?\"",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Remember your leaders, who spoke the word of God to you. As you carefully observe the outcome of their way of life, imitate their faithfulness.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Jesus Christ is the same yesterday, today, and forever.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Do not be swept off course by all kinds of strange teachings. It is good for the heart to be strengthened by grace, not by ritual foods, which have not benefited those who made them a way of life.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "We have an altar from which those who serve in the Tabernacle have no right to eat.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For the bodies of those animals whose blood is brought into the Holy Place by the high priest as an offering for sin are burned outside the camp.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Therefore, Jesus also suffered outside the city gate to set the people apart as holy through his own blood.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Let us, then, go out to him outside the camp, bearing the same shame he bore.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For we do not have a lasting city here, but we are looking for the city that is to come.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Through him, then, let us continually offer up a \"sacrifice of praise\" to God—that is, the fruit of lips that openly acknowledge his name.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "Do not neglect doing good and sharing what you have, for God is well-pleased with such sacrifices.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Have confidence in your leaders and yield to them, for they keep watch over your souls as those who must give an account. Let them do this with joy and not with groaning, for that would be of no benefit to you.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Pray for us, for we are convinced that we have a clear conscience, desiring to conduct ourselves honorably in every way.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "I especially urge you to do this so that I may be restored to you all the sooner.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Now may the God of peace, who brought up from the dead our Lord Jesus—the great Shepherd of the sheep—by the blood of the eternal covenant,",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "equip you with every good thing to do his will, producing in us what is well-pleasing in his sight through Jesus Christ, to whom be glory forever and ever. Amen.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "I urge you, brothers and sisters, bear with this word of exhortation, for I have written to you only briefly.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "You should know that our brother Timothy has been released. If he comes soon, I will see you with him.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Greet all your leaders and all the holy ones. Those from Italy send their greetings.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Grace be with you all.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Love for the family of believers\" (v. 1)**: The Greek *philadelphia* literally means \"brotherly love,\" but in the New Testament context, it specifically refers to the unique bond and responsibility between members of the Christian community.\n\n**\"Hospitality to strangers\" (v. 2)**: *Philoxenia* literally translates as \"love of strangers.\" In the first-century Mediterranean world, this was a vital social and religious virtue, particularly for traveling Christians who relied on the safety of private homes.\n\n**\"I will never, ever...\" (v. 5)**: The Greek quote from the Old Testament (likely referencing Joshua 1:5 or Deuteronomy 31:6) uses a emphatic double negative (*ou mē*... *oud' ou mē*) which is difficult to capture in standard English. The repetition of \"ever\" attempts to convey this intensive promise of presence.\n\n**\"Swept off course\" (v. 9)**: The verb *parapheresthe* suggests being carried away by wind or water, implying that these \"strange teachings\" act like a current that pulls the believer away from a stable anchorage.\n\n**\"Ritual foods\" (v. 9)**: *Brōmasin* refers to foods, but in this context, it alludes to the dietary regulations or sacrificial meals of the old covenant system, which the author argues are powerless to transform the inner person.\n\n**\"Outside the camp\" (v. 11, 13)**: This is a direct allusion to the Levitical requirements for the Day of Atonement, where the remains of the sin offering were burned outside the encampment of Israel. By identifying Jesus with this, the author highlights his role as the ultimate sin offering and calls believers to join him in his social and religious marginalization (\"bearing his shame\").\n\n**\"Sacrifice of praise\" (v. 15)**: This is a technical term (*thysian aineseōs*) from the Septuagint (LXX), referring to a specific type of thank offering. The author reinterprets this cultic ritual as the verbal confession and praise of the community.\n\n**\"Have confidence... and yield\" (v. 17)**: The Greek *peithesthe* (often \"obey\") is in the middle-passive voice, suggesting a sense of being persuaded by or having confidence in someone’s character. *Hypeikete* carries the nuance of yielding or giving way, rather than blind military obedience.\n\n**\"The holy ones\" (v. 24)**: The Greek *hagioi* (traditionally \"saints\") refers to the community set apart for God. \"Holy ones\" avoids the modern baggage of \"saints\" as a special class of exceptionally pious deceased individuals."
    }
  ]
}