{
  "book": "James",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "James, a slave of God and of the Lord Jesus Christ, to the twelve tribes in the Dispersion: Greetings!",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Consider it nothing but joy, my brothers and sisters, whenever you fall into various kinds of trials,",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "for you know that the testing of your faith produces steadfast endurance.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And let that endurance have its mature effect, so that you may be mature and complete, lacking in nothing.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "If any of you lacks wisdom, let him ask God, who gives to all sincerely and without finding fault, and it will be given to him.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "But he must ask in faith, without any inner division, for the one who is divided is like a surge of the sea, driven and tossed by the wind.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "That person should not expect to receive anything from the Lord—",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "he is a man of two souls, unstable in all his ways.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Let the lowly brother boast in his high standing,",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "but the rich man in his humiliation, because he will pass away like a wildflower.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For the sun rises with its scorching wind and withers the grass; its flower falls off and the beauty of its appearance perishes. In the same way, the rich man will fade away in the midst of his pursuits.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Blessed is the man who endures trial, because when he has stood the test, he will receive the crown of life which the Lord promised to those who love him.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "No one being tempted should say, “I am being tempted by God,” for God cannot be tempted by evil, and he himself tempts no one.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Rather, each person is tempted when they are lured and baited by their own desire.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Then desire, having conceived, gives birth to sin; and sin, when it is fully grown, brings forth death.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Do not be deceived, my beloved brothers and sisters.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "Every good act of giving and every complete gift is from above, coming down from the Father of the heavenly lights, with whom there is no variation or shadow cast by a shifting orbit.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "By his own will, he gave us birth through the word of truth, so that we would be a kind of firstfruits of his creatures.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Know this, my beloved brothers and sisters: let every person be quick to listen, slow to speak, and slow to anger,",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "for human anger does not produce the righteousness of God.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Therefore, stripping off all moral filth and the overgrowth of wickedness, receive with gentleness the implanted word which is able to save your souls.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But become practitioners of the word and not listeners only, which is merely deceiving yourselves.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "For if anyone is a listener of the word and not a practitioner, he is like a man looking at the face he was born with in a mirror;",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "he looks at himself, goes away, and immediately forgets what kind of person he was.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "But the one who peers intently into the complete law—the law of freedom—and remains there, becoming not a forgetful listener but a practitioner of the work, this person will be blessed in what he does.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "If anyone thinks he is religious but does not bridle his tongue, he is deceiving his own heart; this person’s religious observance is worthless.",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "Religious observance that is pure and unstained before our God and Father is this: to look after orphans and widows in their distress, and to keep oneself unstained by the world.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"James\" (v. 1)**: The Greek *Iakōbos* is \"Jacob.\" While \"James\" is the traditional English rendering, the original audience would have immediately identified the author with the patriarch Jacob and the \"twelve tribes\" of Israel, signaling the book’s Jewish-Christian context.\n\n**\"Slave\" (v. 1)**: The Greek *doulos* is more specific than \"servant.\" It denotes a person belonging to a master. In a biblical context, it echoes the \"Slave of Yahweh\" (like Moses or David), signifying total allegiance and commissioned authority.\n\n**\"Mature\" (v. 4)**: The Greek *teleios* is often translated \"perfect,\" but in the first century, it referred to reaching an intended end (*telos*), wholeness, or adulthood. \"Mature\" better captures the goal of a faith that has survived testing.\n\n**\"Sincerely and without finding fault\" (v. 5)**: The Greek *haplōs* means \"simply\" or \"single-mindedly.\" When applied to giving, it suggests generosity without ulterior motives or \"strings attached.\" This is contrasted with *oneidizontos*, which refers to the common social practice of \"upbraiding\" or shaming a recipient to maintain a power imbalance.\n\n**\"A man of two souls\" (v. 8)**: The Greek *dipsychos* is a term likely coined by James or drawn from Jewish Hellenistic thought. It is more literal than \"double-minded\"; it suggests a person whose very life-force or \"soul\" is split between loyalty to God and loyalty to the world.\n\n**\"Scorching wind\" (v. 11)**: The Greek *kausōn* refers to the *Sirocco* or *Sharav*, a blistering hot, dust-laden wind from the desert that can wither vegetation in hours.\n\n**\"Lured and baited\" (v. 14)**: The Greek terms *exelkomenos* and *deleazomenos* are metaphors from hunting and fishing. The first means to be drawn out from a place of safety; the second means to be enticed by a lure or bait.\n\n**\"Shadow cast by a shifting orbit\" (v. 17)**: The Greek *parallagē* and *tropēs aposkiasma* are astronomical technical terms. *Parallagē* (parallax) refers to the apparent change in position of a celestial body, and *tropē* refers to the \"turning\" or solstice of the sun. James is contrasting the fixed, constant light of God with the changing positions and shadows of the physical stars and planets.\n\n**\"Practitioners\" (v. 22)**: The Greek *poiētēs* is usually \"doer,\" but it carries the sense of a \"performer\" or \"maker\" (the root of the English \"poet\"). It suggests someone whose life is the \"output\" or \"practice\" of the Word.\n\n**\"The face he was born with\" (v. 23)**: The Greek *prosōpon tēs geneseōs* (literally \"the face of his birth\") refers to one’s natural, physical appearance, contrasting it with the spiritual identity revealed (and potentially transformed) by the \"law of freedom.\"\n\n**\"Religious observance\" (v. 26–27)**: The Greek *thrēskeia* refers to the outward, ritualistic expression of religion—the ceremonies, liturgies, and visible acts of devotion. James is not defining the essence of faith here, but rather defining what \"good liturgy\" or \"true ritual\" looks like in practice."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "My brothers and sisters, as you hold onto the faith of our Lord Jesus Christ, the very Presence of Glory, do not do so with an eye for social status.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Suppose a man comes into your gathering wearing gold rings and splendid clothing, and a destitute man also comes in wearing filthy rags.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "If you pay special attention to the one wearing the splendid clothing and say, “Sit here in this fine seat,” but you say to the destitute man, “You stand over there,” or, “Sit on the floor by my footstool,”",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "have you not created internal divisions and become judges who reason from corrupt motives?",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Listen, my beloved brothers and sisters: Did God not choose those who are poor in the eyes of the world to be rich in faith and heirs of the kingdom he promised to those who love him?",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "But you have insulted the destitute. Is it not the rich who exploit you? Is it not they who drag you into the law courts?",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Is it not they who slander the noble Name that was invoked over you?",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "If you truly fulfill the sovereign law according to the Scripture, “You shall love your neighbor as yourself,” you are doing well.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "But if you show favoritism based on appearance, you are committing a sin and stand convicted by the law as transgressors.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For whoever keeps the whole law but stumbles in a single point has become liable for all of it.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For the one who said, “Do not commit adultery,” also said, “Do not murder.” Now if you do not commit adultery but you do murder, you have become a transgressor of the law.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "So speak and so act as people who are going to be judged by the law of freedom.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For judgment is merciless to the one who has not practiced mercy. Mercy triumphs over judgment.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "What is the use, my brothers and sisters, if someone claims to have faith but does not have actions to show for it? Can that kind of faith save him?",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "If a brother or sister is poorly clothed and lacks daily food,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "and one of you says to them, “Go in peace; keep warm and eat your fill,” but you do not give them the physical necessities of the body, what is the use?",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "In the same way, faith by itself, if it does not have actions, is dead.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "But someone will say, “You have faith and I have actions.” Show me your faith apart from your actions, and I will show you my faith by my actions.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "You believe that “God is one”? You do well! Even the demons believe that—and they shudder with terror.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Do you want evidence, you hollow man, that faith without actions is unproductive?",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Was not our father Abraham justified by his actions when he offered his son Isaac on the altar?",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "You see that faith was working together with his actions, and by those actions, his faith reached its intended goal.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Thus the Scripture was fulfilled which says, “Abraham believed God, and it was credited to him as righteousness,” and he was called the friend of God.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "You see that a person is shown to be righteous by actions and not by faith alone.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Likewise, was not Rahab the prostitute also justified by her actions when she welcomed the messengers and sent them out by a different route?",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "For just as the body without the spirit is dead, so also faith without actions is dead.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The very Presence of Glory\" (v. 1)**: The Greek *tēs doxēs* (\"of the glory\") stands in an unusual grammatical position. While often translated as an adjective (\"glorious Lord\"), it likely functions as a title for Christ, identifying him with the *Shekinah*—the localized, visible presence of God’s glory in the Tabernacle and Temple.\n\n**\"Social status\" / \"Favoritism\" (v. 1, 9)**: The Greek *prosōpolēmpsia* literally means \"receiving the face.\" It refers to making judgments based on someone's external appearance, wealth, or social standing rather than their character.\n\n**\"Gathering\" (v. 2)**: James uses the word *synagōgē*. While by this period it often referred to a Jewish place of worship, its root meaning is simply an assembly or \"bringing together.\" Using \"gathering\" preserves the early, flexible nature of these meetings while acknowledging the Jewish cultural context.\n\n**\"Destitute\" (v. 2, 3, 5, 6)**: The Greek *ptōchos* refers to the \"begging poor\"—those who have no resources of their own and are entirely dependent on others. It is more intense than *penēs* (the working poor).\n\n**\"Sovereign law\" (v. 8)**: *Nomon basilikon* is traditionally \"royal law.\" In this context, it refers to the law of the King (God) which holds supreme authority over all other social codes and behaviors.\n\n**\"Law of freedom\" (v. 12)**: This is a deliberate paradox. To James, the \"law\" is not a burden of rules but a liberating framework of love and mercy that frees the believer from the tyranny of self-interest and social hierarchy.\n\n**\"Actions\" (v. 14, 17, 18, 20, etc.)**: The Greek *erga* is usually translated as \"works.\" However, in modern English, \"works\" often carries a legalistic or mechanical connotation. \"Actions\" or \"deeds\" better captures James's emphasis on faith being expressed through lived behavior and practical charity.\n\n**\"Hollow man\" (v. 20)**: *Kene* means empty, vain, or shallow. James is addressing someone whose \"faith\" is merely intellectual or verbal, lacking the substance of reality.\n\n**\"Unproductive\" (v. 20)**: There is a Greek wordplay here. Faith without *erga* (works/actions) is *argē* (un-working, idle, or useless).\n\n**\"Reached its intended goal\" (v. 22)**: The verb *eteleiōthē* means to bring to completion, maturity, or its intended end. James is arguing that faith is an incomplete \"seed\" until it blossoms into action.\n\n**\"Justified\" (v. 21, 24, 25)**: In James's context, *edikaiōthē* refers to being \"shown to be righteous\" or vindicated before others. It is the outward demonstration of an inward reality."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "Not many of you should become teachers, my brothers, because you know that we who teach will receive a stricter judgment.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For we all stumble in many ways. If anyone does not stumble in what he says, he is a mature man, able to rein in his whole body as well.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Now if we put bridles into the mouths of horses to make them obey us, we direct their entire bodies.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Look also at ships: though they are so large and are driven by fierce winds, they are directed by a very small rudder wherever the impulse of the pilot determines.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "In the same way, the tongue is a small part of the body, yet it boasts of great things. See how small a fire kindles such a vast forest!",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And the tongue is a fire. The tongue is situated among our body parts as a world of unrighteousness; it stains the whole body, sets on fire the wheel of human existence, and is itself set on fire by Gehenna.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For every species of beasts and birds, of reptiles and sea creatures, is being tamed and has been tamed by the human race.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But no human being is able to tame the tongue. It is a restless evil, overflowing with deadly venom.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "With it we bless the Lord and Father, and with it we curse people who have been made in the likeness of God.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "From the same mouth come blessing and cursing. My brothers, these things ought not to be so.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Does a spring gush both sweet and bitter water from the same opening?",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Can a fig tree produce olives, my brothers, or a grapevine produce figs? Neither can a salt spring produce sweet water.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Who is wise and insightful among you? Let him show his works by his honorable way of life, done with the gentle strength that comes from wisdom.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "But if you have bitter jealousy and selfish ambition in your hearts, do not boast and lie against the truth.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "This is not the wisdom coming down from above; rather, it is earthly, unspiritual, and demonic.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For where jealousy and selfish ambition exist, there is instability and every kind of foul practice.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "But the wisdom from above is first of all pure, then peaceable, reasonable, open to persuasion, full of mercy and good fruits, unwavering, and genuine.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And the fruit of righteousness is sown in peace by those who make peace.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Mature\" (v. 2)**: The Greek *teleios* is often rendered \"perfect,\" but in the context of James, it refers to wholeness, integrity, or reaching a state of completion. A \"mature\" person is one whose speech and actions are integrated and under control.\n\n**\"Wheel of human existence\" (v. 6)**: The phrase *ton trochon tēs geneseōs* is a difficult idiom. While some translate it as \"course of life,\" the Greek *trochos* literally means \"wheel\" and *genesis* refers to \"birth\" or \"origin.\" It suggests the entire cycle of human life or the \"machinery\" of nature. The tongue is presented as a spark that can set the entire cycle of a person’s life or social order ablaze.\n\n**\"Gehenna\" (v. 6)**: This term refers to the Valley of Hinnom outside Jerusalem, a place associated in Jewish thought with fiery judgment and garbage. Translating this as \"hell\" misses the specific geographical and cultural weight the term held for the original audience.\n\n**\"Likeness of God\" (v. 9)**: The Greek *homoiōsin* alludes directly to the Septuagint (LXX) text of Genesis 1:26. James is grounding his ethics of speech in the creation theology of the Hebrew Scriptures.\n\n**\"Gentle strength\" (v. 13)**: The Greek *praÿtēs* (often \"meekness\") does not imply weakness or passivity. In a Greco-Roman context, it referred to power under control—like a stallion that has been broken or a ruler who is moderate. \"Gentle strength\" captures this balance of power and restraint.\n\n**\"Selfish ambition\" (v. 14, 16)**: *Eritheia* originally referred to a self-seeking political or partisan spirit—the attitude of those who work only for their own gain or factional interests.\n\n**\"Unspiritual\" (v. 15)**: The Greek *psychikē* refers to the *psychē* (the natural soul or life-force) as opposed to the *pneuma* (the spirit). To a first-century reader, this meant wisdom that is limited to natural human instincts and lacks divine inspiration.\n\n**\"Genuine\" (v. 17)**: The Greek *anypokritos* literally means \"without acting\" or \"without being a performer\" (see the note on *hypokritai* in the guidelines). It describes a life that is not a theatrical display but is authentic."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "Where do the wars and where do the fights among you come from? Do they not come from this: from your cravings for pleasure that are continually at war within your bodies?",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "You desire intensely and yet do not possess; you murder and you are consumed with envy, yet you are unable to obtain what you want. You fight and you wage war. You do not have because you do not ask.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "You ask and you do not receive because you ask with wicked motives, so that you may squander what you get on your own pleasures.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "You unfaithful people! Do you not know that friendship with the world-system is hostility toward God? Therefore, whoever chooses to be a friend of the world makes himself an enemy of God.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "Or do you think the Scripture speaks to no purpose when it says, “He jealously yearns for the spirit He caused to dwell in us”?",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But He gives greater grace. Therefore it says: “God arrays Himself against the arrogant, but He gives grace to the humble.”",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Submit yourselves, then, to God. Stand your ground against the Slanderer, and he will flee from you.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Draw near to God, and He will draw near to you. Cleanse your hands, you sinners, and purify your hearts, you double-minded.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Lament, mourn, and weep. Let your laughter be turned into mourning and your joy into gloom.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Humble yourselves before the Lord, and He will lift you up.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Do not speak against one another, brothers and sisters. The one who speaks against a brother or judges his brother speaks against the law and judges the law. But if you judge the law, you are not a practitioner of the law but a judge.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "There is only one Lawgiver and Judge—the One who is able to save and to destroy. But who are you to judge your neighbor?",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Come now, you who say, “Today or tomorrow we will go to this city and spend a year there, engage in business, and make a profit.”",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Yet you do not even know what tomorrow will bring. What is your life? For you are a mist that appears for a little while and then vanishes.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Instead, you ought to say, “If the Lord wills, we will live and do this or that.”",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But as it is, you boast in your arrogant pretensions. All such boasting is evil.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "So, for the one who knows the right thing to do and does not do it, for him it is sin.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Cravings for pleasure\" (v. 1, 3)**: The Greek *hēdonōn* is the root of \"hedonism.\" It refers to the desires for sensory or selfish gratification. James personifies these as soldiers \"waging a campaign\" (*strateuomenōn*) within the person’s members (limbs/body).\n\n**\"Unfaithful people\" (v. 4)**: The Greek *moichalides* is literally \"adulteresses\" (feminine plural). In the Septuagint (the Greek Old Testament), Israel is frequently described as an unfaithful wife to God when she pursues idols or worldly alliances. James uses this feminine plural to evoke this specific biblical metaphor of covenantal unfaithfulness rather than referring to literal sexual adultery.\n\n**\"World-system\" (v. 4)**: The Greek *kosmos* here refers not to the physical earth, but to the social and cultural order operating in independence from or opposition to God.\n\n**\"Spirit He caused to dwell in us\" (v. 5)**: This is one of the most difficult verses in the New Testament to translate. The Greek *pneuma* could be the Holy Spirit or the human spirit. Given the allusion to God’s \"jealousy\" (a common Old Testament theme regarding His people), it likely refers to the spirit God breathed into humanity at creation, which He \"yearns for\" with a divine jealousy when it is given over to the world.\n\n**\"Arrays Himself against\" (v. 6)**: The verb *antitassetai* is a military term meaning to range oneself in battle formation against an opponent. \n\n**\"Slanderer\" (v. 7)**: The Greek *diabolos* (the Devil) literally means \"the slanderer\" or \"the accuser.\" In a context where James is discussing speaking against one another (v. 11), retaining the descriptive meaning of the title is significant.\n\n**\"Double-minded\" (v. 8)**: *Dipsychoi* literally means \"two-souled.\" It describes a person divided in their loyalties between God and the world. \n\n**\"Gloom\" (v. 9)**: *Katēpheia* refers to the literal casting down of the eyes. It describes the physical expression of shame or deep sorrow.\n\n**\"Practitioner\" (v. 11)**: *Poiētēs* is often translated \"doer,\" but in the context of law, it refers to one who carries it out or practices it as a way of life.\n\n**\"Arrogant pretensions\" (v. 16)**: *Alazoneiais* refers to a kind of empty, wandering boastfulness—originally used of traveling quacks who claimed to have cures or powers they did not possess. It captures the hubris of planning the future without acknowledging God."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "Come now, you who are wealthy, weep and howl for the miseries coming upon you.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Your riches have rotted, and your fine clothes have become moth-eaten.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Your gold and silver are corroded, and their corrosion will stand as a witness against you and will consume your flesh like fire. You have stored up treasure in the final days.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Look! The wages you withheld from the laborers who mowed your fields are crying out, and the cries of the harvesters have reached the ears of the Lord of Armies.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "You have lived on the earth in luxury and self-indulgence; you have fattened your hearts for a day of slaughter.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "You have condemned and murdered the righteous person; he does not resist you.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Therefore, brothers and sisters, be patient until the arrival of the Lord. See how the farmer waits for the precious fruit of the earth, being patient for it until it receives the early and late rains.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "You also must be patient. Strengthen your hearts, because the arrival of the Lord is near.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Do not groan against one another, brothers and sisters, so that you are not judged; look, the Judge is standing right at the doors.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "As an example of suffering and patience, brothers and sisters, take the prophets who spoke in the name of the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "See, we call those who endured \"blessed.\" You have heard of the endurance of Job, and you have seen the outcome the Lord brought about—that the Lord is deeply compassionate and merciful.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Above all, my brothers and sisters, do not swear oaths—not by heaven, or by earth, or by any other oath. Let your \"Yes\" be yes and your \"No\" be no, so that you do not fall under judgment.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Is anyone among you suffering? Let them pray. Is anyone cheerful? Let them sing songs of praise.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Is anyone among you sick? Let them call for the elders of the assembly, and let them pray over them, anointing them with oil in the name of the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And the prayer offered in faith will restore the one who is weary, and the Lord will raise them up; even if they have committed sins, they will be forgiven.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Therefore, confess your sins to one another and pray for one another so that you may be healed. The petition of a righteous person is very powerful in its working.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Elijah was a human being with a nature just like ours, and he prayed fervently that it would not rain, and it did not rain on the land for three years and six months.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Then he prayed again, and the sky gave rain and the earth sprouted its fruit.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "My brothers and sisters, if anyone among you wanders from the truth and someone turns them back,",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "know that the one who turns a sinner from the error of their way will save their soul from death and will cover a multitude of sins.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Lord of Armies\" (v. 4)**: The Greek *Kyrios Sabaōth* transliterates the Hebrew *Yahweh Tsebaoth*. While many translations use \"Lord of Hosts,\" this can feel archaic or liturgical to modern readers. \"Lord of Armies\" captures the original sense of God as a sovereign commander and judge who hears the cries of the oppressed.\n\n**\"Day of slaughter\" (v. 5)**: This refers to the practice of fattening livestock immediately before they are killed. James uses this to suggest that the self-indulgence of the rich is not a sign of security, but a sign that their own judgment is imminent.\n\n**\"Arrival\" (v. 7, 8)**: The Greek *parousia* refers to the arrival or presence of a high-ranking official or a king. While \"coming\" is common, \"arrival\" emphasizes the impending presence of the Lord as judge and king.\n\n**\"Early and late rains\" (v. 7)**: This is a specific Palestinian agricultural reference (the *yoreh* and *malkosh*). The early rains (Autumn) allow for germination, and the late rains (Spring) ensure the ripening of the crop.\n\n**\"Deeply compassionate\" (v. 11)**: The Greek *polysplanchnos* literally means \"many-boweled.\" In the ancient world, the bowels (the \"gut\") were the seat of the deepest emotions. \"Deeply compassionate\" or \"profoundly moved\" captures this visceral intensity better than \"full of pity.\"\n\n**\"The one who is weary\" (v. 15)**: The Greek *kamnonta* can mean \"sick,\" but its root refers to being weary, exhausted, or spent. In the context of James, where suffering and endurance are central themes, this encompasses both physical illness and the spiritual exhaustion that comes with prolonged hardship.\n\n**\"Powerful in its working\" (v. 16)**: The Greek *energoumenē* (from which we get \"energy\") suggests something that is active and effective. The phrase *poly ischyei... energoumenē* emphasizes that the prayer of a righteous person isn't just \"good,\" but carries significant power in its operation.\n\n**\"Prayed fervently\" (v. 17)**: The Greek *proseuchē prosēuxato* is a Semitic idiom (an Aramaic/Hebrew \"absolute infinitive\" construction) that literally says \"he prayed with prayer.\" This is a way of intensifying the verb, indicating earnestness or fervency.\n\n**\"Save their soul\" (v. 20)**: In the context of James (and the Aramaic/Hebrew *nephesh*), *psychē* refers to the whole person—the life or the self—not just a disembodied \"soul.\" To \"save a soul from death\" is to rescue a person's life from destruction."
    }
  ]
}