{
  "book": "John",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "In the beginning was the Logos, and the Logos was with God, and the Logos was God.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "This one was in the beginning with God.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "All things came into being through him, and apart from him not one thing came into being that has come into being.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "In him was life, and the life was the light of humanity.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And the light shines in the darkness, and the darkness did not grasp it.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "There came a man sent from God, whose name was John.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "This one came as a witness, in order to testify about the light, so that all might believe through him.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "He himself was not the light, but came to testify about the light.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "The true light, which enlightens every person, was coming into the world.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "He was in the world, and the world came into being through him, and the world did not know him.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "He came into his own domain, and his own people did not receive him.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "But to as many as did receive him, he gave authority to become children of God—to those who trust in his name,",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "who were born not from bloods, nor from the will of the flesh, nor from the will of a man, but from God.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And the Logos became flesh and pitched his tent among us, and we beheld his glory—glory as of a uniquely-born one from the Father, full of grace and truth.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "(John testifies about him and has cried out, saying, \"This was the one about whom I said, 'The one coming after me has taken precedence over me, because he existed before me.'\")",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For from his fullness we have all received, even grace in place of grace.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For the Law was given through Moses; grace and truth came into being through Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "No one has ever seen God. The uniquely-born one, himself God, the one who is in the bosom of the Father—that one has made him known.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And this is John's testimony when the Judeans sent priests and Levites from Jerusalem to ask him, \"Who are you?\"",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "And he confessed and did not deny—he confessed, \"I am not the Messiah.\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "And they asked him, \"What then? Are you Elijah?\" And he says, \"I am not.\" \"Are you the Prophet?\" And he answered, \"No.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "So they said to him, \"Who are you? So that we may give an answer to those who sent us. What do you say about yourself?\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "He said, \"I am the voice of one crying out in the wilderness: 'Make straight the way of the Lord,' just as Isaiah the prophet said.\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Now they had been sent from among the Pharisees.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "And they questioned him and said to him, \"Why then do you baptize if you are not the Messiah, nor Elijah, nor the Prophet?\"",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "John answered them, saying, \"I baptize in water. In your midst stands one whom you do not know,",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "the one coming after me, of whom I am not worthy to untie the strap of his sandal.\"",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "These things happened in Bethany across the Jordan, where John was baptizing.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "The next day he sees Jesus coming toward him, and he says, \"Look—the Lamb of God who takes away the sin of the world!",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "This is the one about whom I said, 'After me comes a man who has taken precedence over me, because he existed before me.'",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "And I did not know him, but so that he might be revealed to Israel—for this reason I came baptizing in water.\"",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "And John testified, saying, \"I have seen the Spirit descending like a dove from heaven, and it remained upon him.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "And I did not know him, but the one who sent me to baptize in water—that one said to me, 'The one upon whom you see the Spirit descending and remaining upon him, this is the one who baptizes in the Holy Spirit.'",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "And I have seen and have testified that this is the Chosen One of God.\"",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "The next day, John was standing again with two of his disciples,",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "and watching Jesus as he walked by, he says, \"Look—the Lamb of God!\"",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "And the two disciples heard him speaking and followed Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "But Jesus turned and, seeing them following, says to them, \"What are you seeking?\" They said to him, \"Rabbi\" (which translated means Teacher), \"where are you staying?\"",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "He says to them, \"Come and you will see.\" So they came and saw where he was staying, and they remained with him that day. It was about the tenth hour.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "Andrew, the brother of Simon Peter, was one of the two who heard this from John and followed him.",
          "paragraphStart": true
        },
        {
          "verse": 41,
          "text": "This one first finds his own brother Simon and says to him, \"We have found the Messiah\" (which is translated Christ).",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "He led him to Jesus. Looking intently at him, Jesus said, \"You are Simon, son of John. You will be called Cephas\" (which is translated Peter).",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "The next day he decided to go out to Galilee. And he finds Philip and says to him, Jesus does, \"Follow me.\"",
          "paragraphStart": true
        },
        {
          "verse": 44,
          "text": "Now Philip was from Bethsaida, from the city of Andrew and Peter.",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "Philip finds Nathanael and says to him, \"We have found the one about whom Moses wrote in the Law, and the prophets also—Jesus, son of Joseph, from Nazareth.\"",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "And Nathanael said to him, \"Can anything good come out of Nazareth?\" Philip says to him, \"Come and see.\"",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "Jesus saw Nathanael coming toward him and says about him, \"Look—truly an Israelite in whom there is no deceit!\"",
          "paragraphStart": true
        },
        {
          "verse": 48,
          "text": "Nathanael says to him, \"From where do you know me?\" Jesus answered and said to him, \"Before Philip called you, when you were under the fig tree, I saw you.\"",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "Nathanael answered him, \"Rabbi, you are the Son of God! You are the King of Israel!\"",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "Jesus answered and said to him, \"Because I told you that I saw you under the fig tree, you believe? You will see greater things than these.\"",
          "paragraphStart": false
        },
        {
          "verse": 51,
          "text": "And he says to him, \"Amen, amen, I tell you all: you will see heaven opened and the angels of God ascending and descending upon the Son of Man.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Logos\" (vv. 1, 14)**: The Greek term is retained rather than translating it as \"Word.\" For Greek readers, *logos* carried profound philosophical freight: the divine rational principle ordering the cosmos (Heraclitus, Stoicism), God's creative speech in Genesis, personified Wisdom in Proverbs 8, and Philo's intermediary between God and creation. No single English word captures this range. Like \"Christ\" or \"baptize,\" it functions better as a loanword that invites reflection on its rich meaning.\n\n**\"Did not grasp it\" (v. 5)**: The Greek *katelaben* can mean either \"comprehend/understand\" or \"seize/overcome.\" The ambiguity is likely intentional. The darkness both failed to understand the light and failed to extinguish it.\n\n**\"Pitched his tent\" (v. 14)**: The Greek *eskēnōsen* literally means \"dwelt in a tent/tabernacle.\" This evokes the Tabernacle where God's glory dwelt among Israel in the wilderness (Exodus 40:34-35). The standard \"dwelt\" loses this resonance.\n\n**\"Uniquely-born one\" (vv. 14, 18)**: The Greek *monogenēs* means \"only one of its kind\" or \"unique,\" not necessarily \"only-begotten\" (which would be *monogennētos*). It emphasizes the unique relationship and nature, not merely biological generation.\n\n**\"Bloods\" (v. 13)**: The Greek *haimatōn* is plural—\"bloods.\" This may refer to the Jewish teaching that a child's blood came from both parents' bloodlines, emphasizing that divine birth has nothing to do with human ancestry or procreation.\n\n**\"Grace in place of grace\" (v. 16)**: The Greek *charin anti charitos* uses *anti*, which typically means \"in place of\" or \"instead of,\" suggesting successive waves of grace or one gracious dispensation replacing another, rather than simply \"grace upon grace.\"\n\n**\"The Judeans\" (v. 19)**: The Greek *hoi Ioudaioi* means \"the Judeans\"—referring either to people from Judea specifically or, by extension, to the religious authorities in Jerusalem. The term \"Jews\" is anachronistic and misleading for a first-century context where all the participants are ethnically and religiously Jewish.\n\n**\"The Prophet\" (vv. 21, 25)**: With the definite article, this refers to the prophet like Moses promised in Deuteronomy 18:15-18, expected in first-century Jewish eschatology.\n\n**\"Chosen One\" (v. 34)**: While some manuscripts read \"Son,\" the better-attested reading is *eklektos* (\"chosen\" or \"elect\"), which echoes Isaiah's Servant (Isaiah 42:1).\n\n**\"The tenth hour\" (v. 39)**: About 4 p.m. if counting from sunrise (6 a.m.), or 10 a.m. if using Roman time from midnight. The former is more likely in Jewish Palestinian context.\n\n**\"Son of Man\" (v. 51)**: This phrase (*ho huios tou anthrōpou*) evokes both the human figure in Daniel 7:13-14 who receives divine authority, and may also carry the Aramaic idiom where *bar nasha* can mean simply \"a human being\" or \"this person.\" Jesus's usage makes it a title of eschatological authority."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "On the third day a wedding took place in Cana of Galilee, and the mother of Jesus was there.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Jesus too was invited, along with his disciples, to the wedding.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "When the wine ran short, the mother of Jesus said to him, \"They have no wine.\"",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Jesus said to her, \"What is that to me and to you, woman? My hour has not yet come.\"",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "His mother said to the servants, \"Do whatever he tells you.\"",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Now standing there were six stone water jars, set out for the purification practices of the Judeans, each holding twenty to thirty gallons.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Jesus said to them, \"Fill the jars with water.\" So they filled them to the brim.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Then he said to them, \"Now draw some out and take it to the master of the feast.\" And they took it.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "When the master of the feast tasted the water that had become wine—he did not know where it came from, though the servants who had drawn the water knew—the master of the feast called the bridegroom",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "and said to him, \"Everyone serves the good wine first, and when people have drunk freely, then the inferior wine. But you have kept the good wine until now.\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "This, in Cana of Galilee, Jesus did as the beginning of the signs, and he revealed his glory, and his disciples believed in him.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "After this he went down to Capernaum—he and his mother and his brothers and his disciples—and they remained there not many days.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "The Passover of the Judeans was near, and Jesus went up to Jerusalem.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "In the temple he found those selling oxen and sheep and doves, and the money-changers seated at their tables.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Making a whip out of cords, he drove them all out of the temple, both the sheep and the oxen, and he poured out the coins of the money-changers and overturned their tables.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "To those selling doves he said, \"Take these things out of here! Stop making my Father's house a house of trade!\"",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "His disciples remembered that it is written: \"Zeal for your house will consume me.\"",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "So the Judeans responded and said to him, \"What sign do you show us, since you are doing these things?\"",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "Jesus answered and said to them, \"Destroy this temple, and in three days I will raise it up.\"",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "The Judeans then said, \"This temple was built over forty-six years, and you will raise it up in three days?\"",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "But he was speaking about the temple of his body.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Therefore, when he was raised from the dead, his disciples remembered that he had said this, and they believed the scripture and the word that Jesus had spoken.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "Now while he was in Jerusalem during the Passover, during the feast, many believed in his name when they saw the signs he was doing.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "But Jesus himself did not entrust himself to them, because he knew all people",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "and because he had no need for anyone to testify about humanity, for he himself knew what was in a human being.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"What is that to me and to you\" (v. 4)**: The Greek phrase τί ἐμοὶ καὶ σοί is a Semitic idiom that appears throughout the LXX and the Gospels. It establishes distance or questions relevance: \"What do we have in common in this matter?\" The traditional \"What does this have to do with me?\" loses the relational aspect. This rendering preserves both the strangeness and the sense of Jesus questioning the shared concern.\n\n**\"Woman\" (v. 4)**: The Greek γύναι is not disrespectful in Greek (it can be used affectionately), but it is formal and creates distance. Jesus is establishing a boundary between familial obligation and his messianic mission. Translating it as \"Mother\" would obscure this distancing function.\n\n**\"My hour\" (v. 4)**: In John's Gospel, ἡ ὥρα μου is a technical term referring to Jesus's appointed time of glorification through death and resurrection. The first-century audience attuned to John's theology would recognize this as more than a simple temporal reference.\n\n**\"Judeans\" (throughout)**: The Greek Ἰουδαῖοι is complex in John's Gospel. It can mean ethnic Jews, residents of Judea, or (often in John) the religious authorities opposed to Jesus. Here I've used \"Judeans\" to preserve the ambiguity of the Greek—sometimes it clearly means the religious establishment (v. 18, 20), and sometimes it's more neutral (v. 6, 13, referring to purification customs and the Passover festival). The term creates a literary pattern in John that \"Jews\" in modern English cannot preserve without triggering anachronistic associations.\n\n**\"Purification practices\" (v. 6)**: The phrase κατὰ τὸν καθαρισμὸν refers to the ritual washing practices prescribed in Torah and elaborated in Second Temple tradition. \"Purification rites\" would work, but \"practices\" feels less stilted in contemporary English while maintaining accuracy.\n\n**\"Master of the feast\" (v. 8-10)**: The Greek ἀρχιτρίκλινος is a compound meaning \"chief of the dining couches\"—the person responsible for managing the banquet, including wine service. \"Master of the feast\" captures both the authority and the festive context better than \"steward\" or \"headwaiter.\"\n\n**\"Drunk freely\" (v. 10)**: The Greek μεθυσθῶσιν is from μεθύω, meaning to become drunk or intoxicated. The traditional euphemism \"well drunk\" is archaic. \"Drunk freely\" conveys that guests have drunk to satisfaction without being prudish about wine consumption.\n\n**\"Signs\" (v. 11, 18, 23)**: The Greek σημεῖον is John's preferred term for Jesus's miracles. Unlike the Synoptics' δύναμις (\"mighty work\" or \"power\"), σημεῖον emphasizes that these acts point beyond themselves to Jesus's identity. The first-century reader would understand these as revelatory acts, not mere wonders. \"Signs\" preserves this precisely.\n\n**\"Revealed his glory\" (v. 11)**: The verb ἐφανέρωσεν (made manifest/visible) with δόξαν (glory) evokes the Exodus tradition where God's glory was made visible to Israel. John's audience would catch this echo.\n\n**\"House of trade\" (v. 16)**: The Greek οἶκον ἐμπορίου means a commercial establishment, a place of business. Jesus is not objecting to the temple having a marketplace function per se (which was necessary for sacrifices), but to the temple being turned into a business operation. \"House of trade\" preserves the wordplay with \"house\" (οἶκον) that would be lost with \"marketplace.\"\n\n**\"Zeal for your house will consume me\" (v. 17)**: This quotes Psalm 69:9 (LXX 68:10). The verb καταφάγεταί is future tense—\"will consume\"—which in the context of John's narrative points forward to Jesus's passion. The disciples remember this after the resurrection (v. 22), understanding it prophetically.\n\n**\"Did not entrust himself\" (v. 24)**: The Greek οὐκ ἐπίστευεν αὑτὸν αὐτοῖς creates a wordplay with πιστεύω that appears in v. 23 (\"many believed\") and v. 24 (\"Jesus did not believe/entrust\"). The same verb means both \"to believe in\" and \"to entrust to.\" While they believed in him, he did not entrust himself to them. This reciprocal dynamic is crucial to preserve."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "Now there was a man from among the Pharisees, Nicodemus by name, a ruler of the Jews.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "This man came to him at night and said to him, \"Rabbi, we know that you have come from God as a teacher, for no one can do these signs that you are doing unless God is with him.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Jesus answered and said to him, \"Truly, truly, I tell you, unless someone is born from above, he cannot see the kingdom of God.\"",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Nicodemus said to him, \"How can a person be born when he is old? Surely he cannot enter into his mother's womb a second time and be born, can he?\"",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "Jesus answered, \"Truly, truly, I tell you, unless someone is born of water and Spirit, he cannot enter into the kingdom of God.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "What has been born from the flesh is flesh, and what has been born from the Spirit is spirit.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Do not be astonished that I said to you, 'You must be born from above.'",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "The wind blows where it wills, and you hear its sound, but you do not know where it comes from or where it is going. So it is with everyone who has been born of the Spirit.\"",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Nicodemus answered and said to him, \"How can these things happen?\"",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Jesus answered and said to him, \"You are the teacher of Israel and you do not understand these things?",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "Truly, truly, I tell you, we speak what we know and we bear witness to what we have seen, yet you people do not accept our testimony.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "If I have told you about earthly things and you do not believe, how will you believe if I tell you about heavenly things?",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And no one has ascended into heaven except the one who descended from heaven—the Son of Humanity.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And just as Moses lifted up the serpent in the wilderness, so must the Son of Humanity be lifted up,",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "so that everyone who believes in him may have eternal life.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For God loved the world in this way: he gave his only Son, so that everyone who believes in him should not perish but have eternal life.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "For God did not send his Son into the world to condemn the world, but so that the world might be saved through him.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "The one who believes in him is not condemned, but the one who does not believe has already been condemned, because he has not believed in the name of the only Son of God.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And this is the judgment: that the light has come into the world, and people loved the darkness rather than the light, for their deeds were evil.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For everyone who does worthless things hates the light and does not come to the light, so that his deeds may not be exposed.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "But the one who does the truth comes to the light, so that his deeds may be made visible—that they have been worked in God.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "After these things, Jesus and his disciples came into the land of Judea, and there he spent time with them and was baptizing.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "Now John also was baptizing at Aenon near Salim, because there was an abundance of water there, and people kept coming and being baptized—",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "for John had not yet been thrown into prison.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Then a dispute arose on the part of John's disciples with a Judean about purification.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "And they came to John and said to him, \"Rabbi, the one who was with you across the Jordan, to whom you have borne witness—look, he is baptizing and everyone is going to him.\"",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "John answered and said, \"A person cannot receive even one thing unless it has been given to him from heaven.",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "You yourselves bear witness for me that I said, 'I am not the Christ, but rather I have been sent ahead of him.'",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "The one who has the bride is the bridegroom. But the friend of the bridegroom, who stands and listens for him, rejoices greatly at the bridegroom's voice. So this joy of mine has been fulfilled.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "He must increase, but I must decrease.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "The one who comes from above is above all. The one who is from the earth is of the earth and speaks of the earth. The one who comes from heaven is above all.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "What he has seen and heard, this he testifies to, yet no one accepts his testimony.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "The one who has accepted his testimony has certified that God is true.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "For the one whom God has sent speaks the words of God, for he does not give the Spirit by measure.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "The Father loves the Son and has given all things into his hand.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "The one who believes in the Son has eternal life, but the one who disobeys the Son will not see life—rather, the wrath of God remains upon him.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Born from above\" (vv. 3, 7)**: The Greek ἄνωθεν carries a deliberate double meaning: \"from above\" (spatially/theologically) and \"again\" (temporally). Nicodemus takes it in the second sense (v. 4), but Jesus clearly intends the first. The wordplay is essential to the dialogue. \"From above\" preserves Jesus's intended meaning while allowing readers to understand Nicodemus's confusion.\n\n**\"Son of Humanity\" (vv. 13, 14)**: The Greek ὁ υἱὸς τοῦ ἀνθρώπου literally means \"the son of the human\" or \"the son of humanity.\" This is Jesus's preferred self-designation, evoking Daniel 7:13-14 where \"one like a son of man\" receives eternal dominion. The traditional \"Son of Man\" obscures this, as it sounds like a mere synonym for \"human being\" in modern English. \"Son of Humanity\" better conveys both the human dimension and the corporate/representative nature of the figure.\n\n**\"Wind/Spirit\" (v. 8)**: The Greek πνεῦμα means both \"wind\" and \"spirit.\" The verse exploits this double meaning: \"The πνεῦμα blows where it wills... so it is with everyone born of the πνεῦμα.\" I have used \"wind\" and \"Spirit\" to make the analogy clear in English, though the original's wordplay is untranslatable.\n\n**\"Only Son\" (vv. 16, 18)**: The Greek μονογενής means \"only\" or \"unique,\" not \"only-begotten\" (a later theological reading). It emphasizes the Son's singular status, not his mode of generation.\n\n**\"Worthless things\" (v. 20)**: The Greek φαῦλα means cheap, worthless, or base—not merely \"evil\" but things of no value. It contrasts with \"doing the truth\" in v. 21.\n\n**\"Does the truth\" (v. 21)**: The Greek ποιῶν τὴν ἀλήθειαν is a Hebraic idiom meaning to act truthfully, to live according to truth—not merely to \"practice\" truth in some abstract sense. \"Does the truth\" preserves the concrete, active sense.\n\n**Singular vs. plural shifts**: Jesus shifts between singular \"you\" (Nicodemus) and plural \"you\" (addressing a broader audience) in vv. 7, 11-12. This is preserved in the translation where English allows clarification (\"you people\" in v. 11).\n\n**\"A Judean\" (v. 25)**: The Greek Ἰουδαίου is singular, indicating one individual, though some manuscripts have the plural. The singular reading is better attested.\n\n**\"Disobeys\" (v. 36)**: The Greek ἀπειθῶν means \"refuses to be persuaded, disobeys, is disobedient\"—not merely intellectual disbelief but active resistance. This contrasts with the believing/trusting (πιστεύων) of the first part of the verse."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "When Jesus learned that the Pharisees had heard that Jesus was making and baptizing more disciples than John",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "—although Jesus himself was not baptizing, but his disciples were—",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "he left Judea and went back again to Galilee.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Now he had to pass through Samaria.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "So he comes to a Samaritan town called Sychar, near the piece of land that Jacob gave to his son Joseph.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Jacob's well was there. Jesus, exhausted from the journey, sat down just as he was by the well. It was about the sixth hour.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "A woman from Samaria comes to draw water. Jesus says to her, \"Give me a drink.\"",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "(For his disciples had gone off into the town to buy food.)",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "So the Samaritan woman says to him, \"How is it that you, being a Jew, ask for a drink from me, a Samaritan woman?\" (For Jews do not associate with Samaritans.)",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Jesus answered and said to her, \"If you knew the gift of God, and who it is that is saying to you, 'Give me a drink,' you would have asked him, and he would have given you living water.\"",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "The woman says to him, \"Sir, you have no bucket and the well is deep. Where then do you get this living water?",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "You aren't greater than our father Jacob, are you?—who gave us the well and drank from it himself, along with his sons and his livestock.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Jesus answered and said to her, \"Everyone who drinks from this water will thirst again.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "But whoever drinks from the water that I will give him will never thirst for all eternity. Rather, the water that I will give him will become in him a spring of water leaping up into eternal life.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "The woman says to him, \"Sir, give me this water, so that I won't be thirsty or have to keep coming here to draw.\"",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "He says to her, \"Go, call your husband and come back here.\"",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "The woman answered and said to him, \"I don't have a husband.\" Jesus says to her, \"You've spoken well in saying, 'I don't have a husband.'",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "For you've had five husbands, and the one you now have is not your husband. This you've spoken truthfully.\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "The woman says to him, \"Sir, I perceive that you are a prophet.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Our fathers worshiped on this mountain, yet you people say that in Jerusalem is the place where one must worship.\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Jesus says to her, \"Believe me, woman, an hour is coming when neither on this mountain nor in Jerusalem will you worship the Father.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "You worship what you do not know; we worship what we know, because salvation is from the Jews.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "But an hour is coming—and is now here—when the true worshipers will worship the Father in spirit and truth, for indeed the Father seeks such people as his worshipers.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "God is spirit, and those who worship him must worship in spirit and truth.\"",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "The woman says to him, \"I know that Messiah is coming\"—the one called Christ—\"when that one comes, he will proclaim all things to us.\"",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "Jesus says to her, \"I am—the one speaking to you.\"",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "And at this point his disciples came, and they were astonished that he was speaking with a woman. Yet no one said, \"What are you seeking?\" or \"Why are you talking with her?\"",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "So the woman left her water jar and went off into the town and says to the people,",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "\"Come, see a man who told me everything I ever did. Could this be the Christ?\"",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "They went out from the town and were making their way toward him.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "In the meantime, the disciples were urging him, saying, \"Rabbi, eat.\"",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "But he said to them, \"I have food to eat that you don't know about.\"",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "So the disciples were saying to one another, \"No one brought him something to eat, did they?\"",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "Jesus says to them, \"My food is to do the will of the one who sent me and to complete his work.",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "Don't you say, 'There are still four months, and then the harvest comes'? Look, I tell you: lift up your eyes and see the fields—they are white, ready for harvest! Already",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "the reaper is receiving wages and gathering fruit for eternal life, so that the sower and the reaper may rejoice together.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "For in this the saying is true: 'One sows and another reaps.'",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "I sent you to reap that for which you haven't labored; others have labored, and you have entered into their labor.\"",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "Now many Samaritans from that town believed in him because of the woman's testimony: \"He told me everything I did.\"",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "So when the Samaritans came to him, they asked him to stay with them, and he stayed there two days.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "And many more believed because of his message,",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "and they were saying to the woman, \"We no longer believe just because of your account, for we ourselves have heard, and we know that this one truly is the Savior of the world.\"",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "After the two days, he went out from there to Galilee.",
          "paragraphStart": true
        },
        {
          "verse": 44,
          "text": "For Jesus himself had testified that a prophet has no honor in his own homeland.",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "So when he came into Galilee, the Galileans welcomed him, having seen all that he had done in Jerusalem at the festival, for they too had gone to the festival.",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "So he came again to Cana of Galilee, where he had made the water wine. And there was a certain royal official whose son was sick in Capernaum.",
          "paragraphStart": true
        },
        {
          "verse": 47,
          "text": "When this man heard that Jesus had come from Judea into Galilee, he went to him and was asking him to come down and heal his son, for he was about to die.",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "So Jesus said to him, \"Unless you people see signs and wonders, you will never believe.\"",
          "paragraphStart": true
        },
        {
          "verse": 49,
          "text": "The royal official says to him, \"Sir, come down before my child dies.\"",
          "paragraphStart": true
        },
        {
          "verse": 50,
          "text": "Jesus says to him, \"Go; your son lives.\" The man believed the word that Jesus spoke to him and set out.",
          "paragraphStart": true
        },
        {
          "verse": 51,
          "text": "Already as he was going down, his servants met him, saying that his boy was living.",
          "paragraphStart": false
        },
        {
          "verse": 52,
          "text": "So he inquired from them the hour at which he got better. They said to him, \"Yesterday at the seventh hour the fever left him.\"",
          "paragraphStart": true
        },
        {
          "verse": 53,
          "text": "So the father knew that it was at that very hour in which Jesus had said to him, \"Your son lives,\" and he believed, along with his entire household.",
          "paragraphStart": true
        },
        {
          "verse": 54,
          "text": "Now this again was a second sign that Jesus performed after coming from Judea into Galilee.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Had to pass through Samaria\" (v. 4)**: The Greek ἔδει carries a sense of divine necessity or compulsion, not merely geographical necessity (Jews often avoided Samaria by crossing the Jordan). This suggests theological purpose.\n\n**\"Just as he was\" (v. 6)**: The phrase οὕτως here conveys Jesus sitting down in an informal, natural way—exhausted, without ceremony.\n\n**\"Sixth hour\" (v. 6)**: In John's reckoning (following Roman timekeeping), this is approximately noon, the hottest part of the day—an unusual time for drawing water, which was typically done in morning or evening.\n\n**\"Living water\" (vv. 10-11)**: The Greek ὕδωρ ζῶν can mean both \"running water\" (fresh, flowing water from a spring, as opposed to cistern water) and \"life-giving water.\" The woman initially understands the former; Jesus means the latter. The wordplay is intentional and preserved.\n\n**\"Associate with\" (v. 9)**: The verb συγχρῶνται means to use things in common or to have dealings with. The statement reflects the social and religious barrier between Jews and Samaritans.\n\n**\"I am\" (v. 26)**: The Greek Ἐγώ εἰμι can be simply \"I am [he]\" (identifying himself as Messiah) or can echo the divine name from Exodus 3:14. John frequently uses this phrase with theological weight. The ambiguity is likely intentional.\n\n**\"In spirit and truth\" (vv. 23-24)**: The Greek ἐν πνεύματι καὶ ἀληθείᾳ likely means \"in [the realm of] Spirit and [the realm of] truth\"—worship that is spiritual (not tied to physical location) and genuine (not false). The anarthrous construction (no articles before \"spirit\" and \"truth\") suggests these are spheres or modes of worship.\n\n**\"God is spirit\" (v. 24)**: The Greek πνεῦμα ὁ θεός is a qualitative statement about God's nature—God is of the order of spirit, not material. This explains why worship is no longer tied to physical locations.\n\n**\"Everything I ever did\" (v. 29, 39)**: Literally \"all things which I did,\" but the context and the woman's amazement suggest the comprehensive sense of her past being known.\n\n**\"Royal official\" (v. 46)**: The Greek βασιλικός means one in service to the king (Herod Antipas)—a government official or courtier, not necessarily nobility himself.\n\n**\"White, ready for harvest\" (v. 35)**: The fields are λευκαί (\"white\"), describing grain ready to harvest. This may also be a visual reference to the Samaritans in white garments approaching (v. 30), whom Jesus sees as a spiritual harvest.\n\n**\"Savior of the world\" (v. 42)**: This title ὁ σωτὴρ τοῦ κόσμου was used of Roman emperors and pagan deities. Its application to Jesus by Samaritans (outsiders to Judaism) emphasizes the universal scope of his mission."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "After these things there was a festival of the Jews, and Jesus went up to Jerusalem.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Now there is in Jerusalem, by the Sheep Gate, a pool called in Hebrew Bethesda, which has five colonnades.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "In these colonnades lay a crowd of people who were sick—blind, lame, and paralyzed.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "A certain man was there who had been in his sickness for thirty-eight years.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "When Jesus saw him lying there and knew that he had already been in this condition for a long time, he said to him, \"Do you want to become well?\"",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "The sick man answered him, \"Sir, I have no one to put me into the pool when the water is stirred up. While I am trying to get there, someone else goes down ahead of me.\"",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Jesus said to him, \"Get up, pick up your mat, and walk.\"",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "And immediately the man became well, and he picked up his mat and began to walk. Now that day was a Sabbath.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "So the Jewish authorities said to the man who had been healed, \"It is the Sabbath, and it is not lawful for you to carry your mat.\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "But he answered them, \"The one who made me well—that man said to me, 'Pick up your mat and walk.'\"",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "They asked him, \"Who is this man who told you, 'Pick up your mat and walk'?\"",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "But the one who had been healed did not know who it was, for Jesus had slipped away, since there was a crowd in the place.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "After these things Jesus found him in the temple and said to him, \"Look, you have become well. Stop sinning, so that nothing worse happens to you.\"",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "The man went away and reported to the Jewish authorities that it was Jesus who had made him well.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And because of this the Jewish authorities began persecuting Jesus, because he was doing these things on the Sabbath.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "But Jesus answered them, \"My Father is working until now, and I myself am working.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Because of this, therefore, the Jewish authorities were seeking all the more to kill him, because not only was he breaking the Sabbath, but he was also calling God his own Father, making himself equal with God.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "So Jesus responded and began saying to them, \"Amen, amen, I tell you, the Son can do nothing on his own initiative, but only what he sees the Father doing. For whatever that one does, these things the Son likewise does.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "For the Father loves the Son and shows him everything that he himself is doing, and he will show him greater works than these, so that you may be amazed.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For just as the Father raises the dead and gives them life, so also the Son gives life to whomever he wishes.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "For the Father judges no one, but has given all judgment to the Son,",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "so that all may honor the Son just as they honor the Father. The one who does not honor the Son does not honor the Father who sent him.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Amen, amen, I tell you that the one who hears my word and trusts in the one who sent me has eternal life, and does not come into judgment but has passed over from death into life.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "Amen, amen, I tell you that an hour is coming—and now is—when the dead will hear the voice of the Son of God, and those who hear will live.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "For just as the Father has life in himself, so he has also granted the Son to have life in himself.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "And he has given him authority to execute judgment, because he is the Son of Man.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Do not be amazed at this, because an hour is coming in which all who are in the tombs will hear his voice",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "and will come out—those who have done good things to a resurrection of life, and those who have practiced worthless things to a resurrection of judgment.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "I can do nothing on my own initiative. Just as I hear, I judge, and my judgment is just, because I do not seek my own will but the will of the one who sent me.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "If I testify about myself, my testimony is not valid.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "There is another who testifies about me, and I know that the testimony he gives about me is valid.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "You have sent messengers to John, and he has testified to the truth.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Now I do not receive testimony from a human being, but I say these things so that you may be saved.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "That man was the lamp that burns and shines, and you were willing to celebrate for an hour in his light.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "But I have testimony greater than John's. For the works that the Father has given me to complete—these very works that I am doing—testify about me that the Father has sent me.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "And the Father who sent me—that one has testified about me. You have never heard his voice, nor have you seen his form,",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "and you do not have his word remaining in you, because you do not trust in the one whom that one sent.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "You search the scriptures because you think that in them you possess eternal life. Yet these are the very ones that testify about me,",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "and you refuse to come to me so that you may have life.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "I do not receive glory from human beings,",
          "paragraphStart": true
        },
        {
          "verse": 42,
          "text": "but I have come to know you—that you do not have the love of God in yourselves.",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "I have come in my Father's name, and you do not receive me. If another comes in his own name, you will receive that one.",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "How can you trust, when you receive glory from one another and do not seek the glory that comes from the only God?",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "Do not suppose that I will accuse you before the Father. There is one who accuses you: Moses, in whom you have placed your hope.",
          "paragraphStart": true
        },
        {
          "verse": 46,
          "text": "For if you trusted Moses, you would trust me, because that man wrote about me.",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "But if you do not trust his writings, how will you trust my words?\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Jewish authorities\" (vv. 10, 15, 16, 18)**: The phrase οἱ Ἰουδαῖοι in John's Gospel is context-dependent. Here it clearly refers not to Jewish people generally (Jesus and his followers were Jewish), but to the religious leadership in Jerusalem who opposed Jesus. \"The Jews\" in English misleadingly suggests ethnic or religious antagonism rather than a specific power structure. \"Jewish authorities\" captures the institutional nature of the opposition.\n\n**\"Amen, amen\"**: Retained rather than translated as \"truly, truly\" or \"verily, verily.\" This is Jesus's distinctive formula in John (ἀμὴν ἀμὴν), an Aramaic liturgical word meaning \"it is reliable, trustworthy.\" Keeping \"Amen\" preserves its solemnity and connection to Jewish worship practice.\n\n**\"Trusts/trust\" rather than \"believes\"**: The Greek πιστεύω means to place confidence in, to entrust oneself to—more relational and active than English \"believe,\" which can be merely intellectual assent. \"Trust\" better captures the commitment involved.\n\n**\"Son of Man\" (v. 27)**: Retained as a title rather than paraphrased. This phrase (υἱὸς ἀνθρώπου) evokes Daniel 7:13-14, where \"one like a son of man\" receives authority and kingdom from the Ancient of Days. First-century Jewish readers would have caught this allusion to divine authority and eschatological judgment.\n\n**\"Worthless things\" (v. 29)**: The Greek φαῦλα means things of poor quality, base, worthless—not necessarily \"evil\" in a moral sense but actions lacking value or goodness. This contrasts with τὰ ἀγαθά (\"good things\").\n\n**\"Search/You search\" (v. 39)**: The Greek ἐραυνᾶτε is ambiguous—it could be either indicative (\"you search\") or imperative (\"search!\"). Context suggests indicative: Jesus is describing their current practice of studying scripture while missing its testimony to him, not commanding them to do something new. This continues the critique begun in v. 38.\n\n**\"Celebrate\" (v. 35)**: The verb ἀγαλλιάω means to exult, rejoice greatly, celebrate. It's stronger than mere willingness—they were eager to revel in John's ministry, but only \"for an hour\" (temporarily, superficially).\n\n**\"Glory\" (vv. 41, 44)**: The Greek δόξα can mean honor, glory, reputation, or praise. In this context, it refers to human acclaim and reputation-seeking versus seeking honor from God. \"Glory\" preserves the theological weight while encompassing the social dimension.\n\n**\"Bethesda\" (v. 2)**: The manuscript tradition varies (Bethesda, Bethzatha, Bethsaida), but Bethesda has strong early support and likely reflects the Aramaic בית חסדא (House of Mercy).\n\n**Verse 4 omitted**: Not present in the earliest and best manuscripts. This verse (explaining an angel stirring the water) was a later scribal addition attempting to explain v. 7."
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "After these things, Jesus went away to the far side of the Sea of Galilee (which is the Sea of Tiberias).",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "A large crowd was following him, because they had been observing the signs he was performing on those who were sick.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Jesus went up the mountain, and there he sat down with his disciples.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Now the Passover, the festival of the Judeans, was near.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "So when Jesus lifted up his eyes and saw that a large crowd was coming toward him, he says to Philip, \"Where can we buy bread so that these people may eat?\"",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "He was saying this to test him, for he himself knew what he was about to do.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Philip answered him, \"Two hundred denarii worth of bread would not be enough for them, so that each one might receive even a little.\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "One of his disciples, Andrew the brother of Simon Peter, says to him,",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "\"There is a young boy here who has five barley loaves and two small fish—but what are these for so many people?\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Jesus said, \"Have the people recline.\" Now there was abundant grass in the place. So the men reclined, numbering about five thousand.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "Then Jesus took the loaves, and after giving thanks, he distributed them to those reclining, and likewise from the fish, as much as they wanted.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "When they were satisfied, he says to his disciples, \"Gather up the leftover fragments, so that nothing is lost.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "So they gathered them up and filled twelve baskets with fragments from the five barley loaves that were left over by those who had eaten.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Therefore when the people saw the sign he had performed, they began saying, \"This is truly the Prophet who is coming into the world.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "So Jesus, knowing that they were about to come and seize him to make him king, withdrew again to the mountain, alone by himself.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Now when evening came, his disciples went down to the sea,",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "and after getting into a boat, they began going across the sea toward Capernaum. Darkness had already fallen, and Jesus had not yet come to them.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "The sea was being stirred up because a strong wind was blowing.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "When they had rowed about three or four miles, they see Jesus walking on the sea and coming near the boat, and they were terrified.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "But he says to them, \"I AM; do not be afraid.\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "So they were willing to take him into the boat, and immediately the boat came to be at the land toward which they were going.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "On the next day, the crowd standing on the far side of the sea saw that there had been no other boat there except one, and that Jesus had not entered the boat with his disciples, but his disciples had gone away alone.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "However, boats from Tiberias came near the place where they had eaten the bread after the Lord gave thanks.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "So when the crowd saw that Jesus was not there, nor his disciples, they themselves got into the boats and came to Capernaum seeking Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "And when they found him on the far side of the sea, they said to him, \"Rabbi, when did you come here?\"",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "Jesus answered them and said, \"Truly, truly I tell you, you are seeking me not because you saw signs but because you ate from the loaves and were filled.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Do not work for the food that perishes, but for the food that endures into eternal life, which the Son of Man will give to you—for the Father, God himself, has set his seal on this one.\"",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "So they said to him, \"What must we do in order to work the works of God?\"",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "Jesus answered and said to them, \"This is the work of God: that you trust in the one whom that one has sent.\"",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "So they said to him, \"Then what sign are you performing, so that we may see and trust you? What work are you doing?",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Our fathers ate the manna in the wilderness, just as it is written: 'He gave them bread from heaven to eat.'\"",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "So Jesus said to them, \"Truly, truly I tell you, Moses did not give you the bread from heaven; rather, my Father gives you the true bread from heaven.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "For the bread of God is the one who comes down from heaven and gives life to the world.\"",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "So they said to him, \"Lord, give us this bread always.\"",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "Jesus said to them, \"I AM the bread of life. The one who comes to me will never hunger, and the one who trusts in me will never, ever thirst.",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "But I have told you that you have seen me and yet do not trust.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "Everything that the Father gives to me will come to me, and the one who comes to me I will certainly not cast out,",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "because I have come down from heaven not to do my own will but the will of the one who sent me.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "And this is the will of the one who sent me: that I should lose nothing of all that he has given me, but should raise it up on the last day.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "For this is the will of my Father: that everyone who looks upon the Son and trusts in him should have eternal life, and I will raise him up on the last day.\"",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "So the Judeans began grumbling about him because he said, \"I AM the bread that came down from heaven,\"",
          "paragraphStart": true
        },
        {
          "verse": 42,
          "text": "and they were saying, \"Is this not Jesus the son of Joseph, whose father and mother we know? How does he now say, 'I have come down from heaven'?\"",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "Jesus answered and said to them, \"Stop grumbling among yourselves.",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "No one is able to come to me unless the Father who sent me draws him, and I will raise him up on the last day.",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "It is written in the Prophets: 'And they will all be taught by God.' Everyone who has heard from the Father and learned comes to me.",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "Not that anyone has seen the Father except the one who is from God—this one has seen the Father.",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "Truly, truly I tell you, the one who trusts has eternal life.",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "I AM the bread of life.",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "Your fathers ate the manna in the wilderness and died.",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "This is the bread that comes down from heaven so that anyone may eat from it and not die.",
          "paragraphStart": false
        },
        {
          "verse": 51,
          "text": "I AM the living bread that came down from heaven. If anyone eats from this bread, he will live forever. And the bread that I will give is my flesh, for the life of the world.\"",
          "paragraphStart": false
        },
        {
          "verse": 52,
          "text": "So the Judeans began arguing sharply with one another, saying, \"How can this man give us his flesh to eat?\"",
          "paragraphStart": true
        },
        {
          "verse": 53,
          "text": "So Jesus said to them, \"Truly, truly I tell you, unless you eat the flesh of the Son of Man and drink his blood, you have no life in yourselves.",
          "paragraphStart": false
        },
        {
          "verse": 54,
          "text": "The one who feeds on my flesh and drinks my blood has eternal life, and I will raise him up on the last day.",
          "paragraphStart": false
        },
        {
          "verse": 55,
          "text": "For my flesh is true food, and my blood is true drink.",
          "paragraphStart": false
        },
        {
          "verse": 56,
          "text": "The one who feeds on my flesh and drinks my blood remains in me, and I in him.",
          "paragraphStart": false
        },
        {
          "verse": 57,
          "text": "Just as the living Father sent me and I live because of the Father, so also the one who feeds on me—that one will live because of me.",
          "paragraphStart": false
        },
        {
          "verse": 58,
          "text": "This is the bread that came down from heaven—not like the bread the fathers ate and died. The one who feeds on this bread will live forever.\"",
          "paragraphStart": false
        },
        {
          "verse": 59,
          "text": "He said these things while teaching in a synagogue in Capernaum.",
          "paragraphStart": false
        },
        {
          "verse": 60,
          "text": "Therefore many of his disciples, when they heard this, said, \"This word is harsh. Who can listen to it?\"",
          "paragraphStart": true
        },
        {
          "verse": 61,
          "text": "But Jesus, knowing within himself that his disciples were grumbling about this, said to them, \"Does this cause you to stumble?",
          "paragraphStart": false
        },
        {
          "verse": 62,
          "text": "What if you should see the Son of Man ascending to where he was before?",
          "paragraphStart": false
        },
        {
          "verse": 63,
          "text": "The Spirit is what gives life; the flesh profits nothing. The words that I have spoken to you are spirit and are life.",
          "paragraphStart": false
        },
        {
          "verse": 64,
          "text": "But there are some among you who do not trust.\" For Jesus knew from the beginning who those were who did not trust and who it was who would betray him.",
          "paragraphStart": false
        },
        {
          "verse": 65,
          "text": "And he was saying, \"This is why I have told you that no one is able to come to me unless it has been granted to him from the Father.\"",
          "paragraphStart": false
        },
        {
          "verse": 66,
          "text": "From this point many of his disciples withdrew to the things behind and no longer walked with him.",
          "paragraphStart": true
        },
        {
          "verse": 67,
          "text": "So Jesus said to the Twelve, \"You don't want to go away too, do you?\"",
          "paragraphStart": false
        },
        {
          "verse": 68,
          "text": "Simon Peter answered him, \"Lord, to whom shall we go? You have words of eternal life,",
          "paragraphStart": false
        },
        {
          "verse": 69,
          "text": "and we have come to trust and have come to know that you are the Holy One of God.\"",
          "paragraphStart": false
        },
        {
          "verse": 70,
          "text": "Jesus answered them, \"Did I not choose you, the Twelve? And yet one of you is a devil.\"",
          "paragraphStart": false
        },
        {
          "verse": 71,
          "text": "He was speaking of Judas, son of Simon Iscariot, for this one—one of the Twelve—was about to betray him.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Judeans\" (vv. 4, 41, 52)**: The Greek Ἰουδαῖοι is typically rendered \"the Jews,\" but in John's Gospel this term often functions more specifically to denote the religious authorities or those from Judea proper, particularly those hostile to Jesus. \"Judeans\" better captures this geographical and socio-religious specificity while avoiding the anachronistic implications of \"Jews\" as a wholesale ethnic or religious category.\n\n**\"I AM\" (vv. 20, 35, 41, 48, 51)**: The Greek ἐγώ εἰμι carries the double force of simple self-identification and—especially in John's Gospel—deliberate evocation of the divine name revealed to Moses (LXX Exodus 3:14, ἐγώ εἰμι ὁ ὤν). In verse 20, where Jesus walks on the water, the emphatic \"I AM\" announces divine presence. In the bread discourse, the formula becomes a revelatory refrain identifying Jesus with the divine identity. English \"I am\" is too weak; \"I AM\" preserves the solemnity and theological weight.\n\n**\"Trust\" for πιστεύω (throughout)**: While \"believe\" is traditional, πιστεύω in John carries the stronger sense of active trust, reliance, and commitment—not merely intellectual assent. \"Trust\" better captures this relational dimension, especially when the verb takes εἰς (\"trust in/into\") indicating movement toward and union with its object.\n\n**\"The one who feeds on\" for ὁ τρώγων (vv. 54, 56, 57, 58)**: John shifts from the more common φαγεῖν (to eat) to the more visceral τρώγειν, which suggests chewing, gnawing, or audibly consuming. \"Feeds on\" conveys this more physical, ongoing action without resorting to crude literalism.\n\n**\"Looking upon\" for θεωρῶν (v. 40)**: Not merely \"seeing\" (ὁράω) but contemplative beholding or observing—the kind of sustained, attentive seeing that leads to recognition and faith.\n\n**\"Harsh\" for σκληρός (v. 60)**: The word means hard, difficult, offensive—not simply \"difficult to understand\" but difficult to accept. \"Harsh\" captures the disciples' sense that this teaching is offensively demanding.\n\n**\"To the things behind\" (v. 66)**: The phrase εἰς τὰ ὀπίσω is literally \"to the back things\" or \"backward\"—they returned to their former way of life, abandoning forward movement with Jesus.\n\n**\"Performers\" avoided in \"grumbling\"**: The verb γογγύζω (vv. 41, 43, 61) specifically means to grumble or murmur in complaint, echoing Israel's wilderness murmuring (Exodus 16:2ff LXX). This is not theatrical performance but discontent—\"grumbling\" is precise here.\n\n**\"Two hundred denarii\" (v. 7)**: Retained the specific amount rather than converting to vague modern equivalents. A denarius was a day's wage for a laborer; the specificity matters for understanding the scale of the miracle.\n\n**Historical present tense**: John frequently uses the present tense for past events to create vividness (the \"historical present\"). I've generally preserved this where it flows naturally in English (e.g., \"he says\" rather than \"he said\") to maintain the narrative's immediacy."
    },
    {
      "chapter": 7,
      "verses": [
        {
          "verse": 1,
          "text": "After these things, Jesus traveled about in Galilee. He did not want to move about in Judea, because the Judean authorities were seeking to kill him.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Now the Jewish feast of Tabernacles was near.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "So his brothers said to him, \"Leave here and go to Judea, so that your disciples there may also observe the works you are doing.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "For no one does anything in secret while seeking to be known publicly. If you are doing these things, reveal yourself to the world.\"",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For not even his brothers believed in him.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Jesus therefore said to them, \"My time has not yet arrived, but your time is always ready.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "The world cannot hate you, but it hates me, because I testify concerning it that its works are evil.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "You go up to the feast. I am not going up to this feast, because my time has not yet been fulfilled.\"",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Having said these things to them, he remained in Galilee.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "But when his brothers had gone up to the feast, then he also went up—not openly, but as though in secret.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "The Judean authorities were therefore looking for him at the feast and saying, \"Where is that man?\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And there was much murmuring about him among the crowds. Some were saying, \"He is good,\" but others were saying, \"No, rather he is leading the crowd astray.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Yet no one was speaking openly about him because of their fear of the Judean authorities.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Already at the middle of the feast, Jesus went up to the temple and began teaching.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "The Judean authorities were therefore amazed, saying, \"How does this man know the Scriptures, having never been trained?\"",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Jesus therefore answered them and said, \"My teaching is not mine, but belongs to the one who sent me.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "If anyone desires to do his will, that person will know concerning the teaching—whether it comes from God, or whether I am speaking from myself.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "The one who speaks from himself seeks his own glory, but the one who seeks the glory of the one who sent him—this person is true, and there is no unrighteousness in him.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Did not Moses give you the law? Yet none of you keeps the law. Why are you seeking to kill me?\"",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "The crowd answered, \"You have a demon! Who is seeking to kill you?\"",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "Jesus answered and said to them, \"I performed one work, and you are all astonished.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "Because of this, Moses has given you circumcision—not that it comes from Moses, but from the fathers—and you circumcise a man on the Sabbath.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "If a man receives circumcision on the Sabbath so that the law of Moses may not be broken, are you angry with me because I made an entire man well on the Sabbath?",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Stop judging by outward appearance, but judge with right judgment.\"",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Some of the people from Jerusalem were therefore saying, \"Is this not the man they are seeking to kill?",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "And look—he is speaking openly, and they are saying nothing to him! Can it be that the rulers have truly recognized that this man is the Messiah?",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "But we know where this man is from. Yet when the Messiah comes, no one will know where he is from.\"",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Jesus therefore cried out in the temple as he was teaching, saying, \"You know me, and you know where I am from! Yet I have not come on my own initiative, but the one who sent me is true—the one whom you do not know.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "I know him, because I am from him, and he sent me.\"",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "They were therefore seeking to seize him, but no one laid a hand on him, because his hour had not yet come.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "Yet many from the crowd believed in him, and they were saying, \"When the Messiah comes, will he perform more signs than this man has performed?\"",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "The Pharisees heard the crowd murmuring these things about him, and the chief priests and the Pharisees sent temple guards to seize him.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "Jesus therefore said, \"I am with you for only a short time longer, and then I am going to the one who sent me.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "You will search for me and will not find me, and where I am, you cannot come.\"",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "The Judean authorities therefore said to one another, \"Where is this man about to go that we will not find him? He is not going to the Dispersion among the Greeks to teach the Greeks, is he?",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "What is this statement he made: 'You will search for me and will not find me, and where I am, you cannot come'?\"",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "Now on the last day of the feast, the great day, Jesus stood and cried out, saying, \"If anyone thirsts, let him come to me and drink.",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "The one who believes in me, as the Scripture has said, 'Rivers of living water will flow from within him.'\"",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "Now he said this concerning the Spirit, which those who believed in him were about to receive—for the Spirit was not yet given, because Jesus had not yet been glorified.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "Some from the crowd, therefore, when they heard these words, were saying, \"This is truly the Prophet.\"",
          "paragraphStart": true
        },
        {
          "verse": 41,
          "text": "Others were saying, \"This is the Messiah.\" But some were saying, \"Surely the Messiah does not come from Galilee, does he?",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "Has not the Scripture said that the Messiah comes from the seed of David, and from Bethlehem, the village where David was?\"",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "So a division occurred in the crowd because of him.",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "Some of them wanted to seize him, but no one laid hands on him.",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "The temple guards therefore came to the chief priests and Pharisees, and those men said to them, \"Why did you not bring him?\"",
          "paragraphStart": true
        },
        {
          "verse": 46,
          "text": "The guards answered, \"Never has anyone spoken like this.\"",
          "paragraphStart": true
        },
        {
          "verse": 47,
          "text": "The Pharisees therefore answered them, \"Have you also been led astray?",
          "paragraphStart": true
        },
        {
          "verse": 48,
          "text": "Has any one of the rulers believed in him, or any of the Pharisees?",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "But this crowd that does not know the law—they are accursed!\"",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "Nicodemus, the one who had come to him earlier, being one of them, said to them,",
          "paragraphStart": true
        },
        {
          "verse": 51,
          "text": "\"Our law does not judge a man unless it first hears from him and learns what he is doing, does it?\"",
          "paragraphStart": false
        },
        {
          "verse": 52,
          "text": "They answered and said to him, \"You are not also from Galilee, are you? Search and see that no prophet arises from Galilee.\"",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Judean authorities\" (vv. 1, 11, 13, 15, 35)**: The Greek οἱ Ἰουδαῖοι is notoriously difficult. In John's Gospel, it often refers not to Jewish people generally (Jesus and his disciples were themselves Jewish), but to the religious-political leadership centered in Jerusalem who opposed Jesus. Context determines meaning: in v. 13 it clearly means \"authorities\" (the crowd fears them); in v. 2 it simply means \"Jewish\" (as a descriptor of the feast). I've translated contextually, using \"Judean authorities\" where the term refers to the hostile leadership, and \"Jewish\" where it's a religious-ethnic descriptor.\n\n**\"Brothers\" (vv. 3, 5, 10)**: The Greek ἀδελφοί. These are Jesus's siblings (see Mark 6:3 for their names). Some theological traditions understand these as cousins or step-siblings, but the natural reading of the Greek supports biological brothers.\n\n**\"My time\" / \"my hour\"** (vv. 6, 8, 30): Jesus uses both καιρός (appointed time, right moment) and ὥρα (hour) to refer to the time of his death and glorification, a major theme in John's Gospel. The terms are nearly synonymous in this context but I've preserved the distinction where it appears.\n\n**\"Leading the crowd astray\" (v. 12)**: The verb πλανάω means to cause to wander, deceive, lead astray—with connotations of leading someone off the true path. This is more specific than generic deception.\n\n**\"Know the Scriptures\" (v. 15)**: Literally \"know letters/writings\" (γράμματα). This refers to formal training in the sacred texts, not mere literacy. The authorities are astonished that Jesus can interpret Scripture at a professional level without having studied under recognized teachers.\n\n**\"Outward appearance\" (v. 24)**: The Greek κατ' ὄψιν means \"according to face/appearance\"—judging by surface-level observation rather than penetrating to truth.\n\n**\"The Prophet\" (v. 40)**: With the definite article, this refers to the prophet like Moses promised in Deuteronomy 18:15-18, a specific messianic expectation.\n\n**\"The Dispersion among the Greeks\" (v. 35)**: ἡ διασπορὰ τῶν Ἑλλήνων—the Jewish Diaspora living in Greek-speaking lands outside Palestine. Their question drips with irony: would Jesus leave the holy land to teach among scattered Jews and Gentiles?\n\n**\"Rivers of living water will flow from within him\" (v. 38)**: The quotation doesn't match any single Old Testament text precisely but alludes to several passages about water flowing from Jerusalem/the temple (Ezekiel 47:1-12, Zechariah 14:8, Isaiah 58:11). The Greek κοιλία can mean belly, womb, or innermost being—I've used \"within him\" to capture the sense of an interior source.\n\n**\"The Spirit was not yet given\" (v. 39)**: The Greek literally says \"the Spirit was not yet\" (οὔπω γὰρ ἦν πνεῦμα), which sounds odd. I've added \"given\" as this is clearly the sense—the Spirit would be given after Jesus's glorification (his death, resurrection, and ascension). Some manuscripts add \"given\" or \"upon them.\"\n\n**\"Accursed\" (v. 49)**: ἐπάρατοι—literally \"cursed\" or \"under a curse.\" This is harsh religious language, expressing contempt for those not trained in the law."
    },
    {
      "chapter": 8,
      "verses": [
        {
          "verse": 12,
          "text": "Again, therefore, Jesus spoke to them, saying: \"I am the light of the world. The one who follows me will never walk in darkness, but will have the light of life.\"",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "So the Pharisees said to him, \"You are testifying about yourself; your testimony is not valid.\"",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Jesus answered and said to them, \"Even if I testify about myself, my testimony is valid, because I know where I came from and where I am going. But you do not know where I come from or where I am going.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "You judge according to the flesh; I judge no one.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Yet even if I do judge, my judgment is true, because I am not alone—rather, I and the Father who sent me.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "And it is written in your own law that the testimony of two persons is valid.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "I am the one testifying about myself, and the Father who sent me testifies about me.\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "So they were saying to him, \"Where is your father?\" Jesus answered, \"You know neither me nor my Father. If you knew me, you would know my Father as well.\"",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "He spoke these words in the treasury while teaching in the temple. And no one arrested him, because his hour had not yet come.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "So he said to them again, \"I am going away, and you will search for me, and you will die in your sin. Where I am going, you cannot come.\"",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "So the Judeans were saying, \"Surely he's not going to kill himself, is he? Because he says, 'Where I am going, you cannot come.'\"",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "And he was saying to them, \"You are from below; I am from above. You are from this world; I am not from this world.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "I said to you that you will die in your sins. For if you do not believe that I am, you will die in your sins.\"",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "So they were saying to him, \"Who are you?\" Jesus said to them, \"Why am I even speaking to you at all?",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "I have many things to say about you and to judge. But the one who sent me is true, and what I have heard from him, these things I speak into the world.\"",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "They did not understand that he was speaking to them about the Father.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "So Jesus said, \"When you lift up the Son of Man, then you will know that I am, and that I do nothing on my own authority, but I speak these things just as the Father taught me.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "And the one who sent me is with me. He has not left me alone, because I always do what is pleasing to him.\"",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "As he was speaking these things, many believed in him.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "So Jesus was saying to the Judeans who had believed in him, \"If you remain in my word, you are truly my disciples,",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "and you will know the truth, and the truth will set you free.\"",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "They answered him, \"We are Abraham's offspring and have never been enslaved to anyone. How can you say, 'You will become free'?\"",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "Jesus answered them, \"Truly, truly, I tell you: everyone who commits sin is a slave of sin.",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "Now the slave does not remain in the household forever; the son remains forever.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "So if the Son sets you free, you will be truly free.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "I know that you are Abraham's offspring. Yet you are seeking to kill me, because my word finds no place in you.",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "I speak what I have seen with the Father; so also you do what you have heard from your father.\"",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "They answered and said to him, \"Our father is Abraham.\" Jesus says to them, \"If you are Abraham's children, you would be doing the works of Abraham.",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "But now you are seeking to kill me—a man who has spoken to you the truth that I heard from God. Abraham did not do this.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "You are doing the works of your father.\" They said to him, \"We were not born of sexual immorality. We have one Father—God.\"",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "Jesus said to them, \"If God were your Father, you would love me, for I came forth from God and have arrived here. For I have not come on my own authority, but that one sent me.",
          "paragraphStart": true
        },
        {
          "verse": 43,
          "text": "Why do you not understand my speech? Because you cannot hear my word.",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "You are of your father the devil, and you want to carry out the desires of your father. He was a murderer from the beginning, and does not stand in the truth, because there is no truth in him. When he speaks the lie, he speaks from his own nature, because he is a liar and the father of it.",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "But because I speak the truth, you do not believe me.",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "Which of you convicts me of sin? If I speak truth, why do you not believe me?",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "The one who is from God hears the words of God. For this reason you do not hear: because you are not from God.\"",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "The Judeans answered and said to him, \"Are we not right in saying that you are a Samaritan and have a demon?\"",
          "paragraphStart": true
        },
        {
          "verse": 49,
          "text": "Jesus answered, \"I do not have a demon, but I honor my Father, and you dishonor me.",
          "paragraphStart": true
        },
        {
          "verse": 50,
          "text": "Yet I do not seek my own glory; there is one who seeks it and judges.",
          "paragraphStart": false
        },
        {
          "verse": 51,
          "text": "Truly, truly, I tell you: if anyone keeps my word, he will never see death forever.\"",
          "paragraphStart": false
        },
        {
          "verse": 52,
          "text": "The Judeans said to him, \"Now we know that you have a demon. Abraham died, and so did the prophets, yet you say, 'If anyone keeps my word, he will never taste death forever.'",
          "paragraphStart": true
        },
        {
          "verse": 53,
          "text": "You are not greater than our father Abraham, are you? He died, and the prophets died. Who do you make yourself out to be?\"",
          "paragraphStart": false
        },
        {
          "verse": 54,
          "text": "Jesus answered, \"If I glorify myself, my glory is nothing. It is my Father who glorifies me—the one about whom you say, 'He is our God.'",
          "paragraphStart": true
        },
        {
          "verse": 55,
          "text": "Yet you have not known him, but I know him. And if I were to say that I do not know him, I would be a liar like you. But I do know him, and I keep his word.",
          "paragraphStart": false
        },
        {
          "verse": 56,
          "text": "Abraham your father rejoiced that he might see my day, and he saw it and was glad.\"",
          "paragraphStart": false
        },
        {
          "verse": 57,
          "text": "So the Judeans said to him, \"You are not yet fifty years old, and you have seen Abraham?\"",
          "paragraphStart": true
        },
        {
          "verse": 58,
          "text": "Jesus said to them, \"Truly, truly, I tell you: before Abraham came into being, I am.\"",
          "paragraphStart": true
        },
        {
          "verse": 59,
          "text": "So they picked up stones to throw at them. But Jesus hid himself and went out from the temple.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Judeans\" (οἱ Ἰουδαῖοι)**: Throughout this passage, I've translated this as \"Judeans\" rather than the traditional \"Jews.\" In John's Gospel, this term often functions as a technical designation for the Jerusalem religious authorities and their allies, not as a general ethnic or religious label. The conflict is regional and institutional (Galilean Jesus vs. Jerusalem establishment), not ethnic. The first-century audience would have understood this specificity.\n\n**\"I am\" (ἐγώ εἰμι, verses 24, 28, 58)**: This phrase echoes Exodus 3:14 (LXX: ἐγώ εἰμι ὁ ὤν, \"I am the one who is\"), where God reveals his name to Moses. In verse 58, it is grammatically absolute and theologically explosive—Jesus claims eternal, pre-existent identity using the divine name. The verse structure deliberately contrasts created being (γενέσθαι, \"to come into being\") with eternal existence (εἰμί, \"I am\"). Their violent response (v. 59) shows they understood this as a divine claim.\n\n**\"Your own law\" (v. 17)**: Jesus says τῷ νόμῳ... τῷ ὑμετέρῳ (\"your law\"), creating distance between himself and the Torah. This is significant in John's christology—Jesus stands outside and above the Mosaic dispensation as its fulfillment and judge.\n\n**\"Where I am going, you cannot come\" (v. 21-22)**: The irony is tragic. Jesus speaks of ascending to the Father; they wonder if he means suicide. Suicide would bring ritual uncleanness and separation from God—the opposite of Jesus's destination. They comprehend his words only at the fleshly level (v. 15).\n\n**\"My word finds no place in you\" (v. 37)**: The verb χωρεῖ means \"to have space for, to make room for, to advance into.\" It's spatial imagery—Jesus's word cannot gain ground in them, cannot find lodging, is blocked from entry.\n\n**\"The lie\" (v. 44)**: The Greek τὸ ψεῦδος has the definite article—\"the lie,\" not just \"lies.\" In context, this likely refers to the fundamental deception in Eden (Genesis 3), where the serpent contradicted God's word. The devil is the originator and father of that primal falsehood.\n\n**\"He is a liar and the father of it\" (v. 44)**: The phrase ὁ πατὴρ αὐτοῦ is ambiguous—it could mean \"the father of the lie\" or \"the father of the liar\" (referring to anyone who lies). I've translated \"the father of it\" to preserve the ambiguity, though the former reading (father of the lie itself) fits the immediate context better.\n\n**\"Why am I even speaking to you at all?\" (v. 25)**: This verse is notoriously difficult. The Greek Τὴν ἀρχὴν ὅ τι καὶ λαλῶ ὑμῖν could mean: (1) \"From the beginning, what I have been telling you,\" (2) \"Why am I speaking to you at all?\" or (3) \"I am the beginning, which is what I am telling you.\" I've chosen option 2, understanding it as Jesus's exasperated response to their obtuseness—a rhetorical question expressing frustration at their inability to understand even after extensive explanation.\n\n**\"Sexual immorality\" (πορνεία, v. 41)**: Their protest \"We were not born of sexual immorality\" may be: (1) an assertion of legitimate Israelite descent (not mixed ancestry like Samaritans), (2) a veiled insult about Jesus's birth circumstances (the virgin birth could be misunderstood as illegitimacy), or (3) a theological claim that they are not spiritually adulterous like Israel's past idolatry. All three layers may be present to the original audience.\n\n**\"He saw it and was glad\" (v. 56)**: Jesus claims Abraham foresaw the Messiah's coming. This may allude to Genesis 17:17 (Abraham's laughter at the promise) or to rabbinic traditions about Abraham's eschatological vision. The original audience, steeped in interpretive traditions, would have recognized such prophetic foresight as plausible."
    },
    {
      "chapter": 9,
      "verses": [
        {
          "verse": 1,
          "text": "And as he was passing by, he saw a man who had been blind from birth.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "His disciples asked him, \"Rabbi, who sinned—this man or his parents—that he should be born blind?\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Jesus answered, \"Neither this man sinned nor his parents. Rather, this happened so that the works of God might be made visible in him.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "We must work the works of the one who sent me while it is day. Night is coming, when no one can work.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "While I am in the world, I am the light of the world.\"",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Having said these things, he spat on the ground and made mud from the saliva, and he spread the mud on his eyes.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Then he said to him, \"Go, wash in the pool of Siloam\" (which is translated \"Sent One\"). So he went off and washed, and he came back seeing.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Then the neighbors and those who had previously observed him begging were saying, \"Isn't this the one who used to sit and beg?\"",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Some were saying, \"This is the man.\" Others were saying, \"No, but he looks like him.\" The man himself kept saying, \"I am the one.\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "So they said to him, \"How then were your eyes opened?\"",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "He answered, \"The man called Jesus made mud and spread it on my eyes and said to me, 'Go to Siloam and wash.' So I went, and when I had washed, I received my sight.\"",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "They said to him, \"Where is he?\" He said, \"I don't know.\"",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "They brought him to the Pharisees—the man who had once been blind.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Now it was a Sabbath day on which Jesus made the mud and opened his eyes.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "So the Pharisees also began questioning him about how he had received his sight. He said to them, \"He put mud on my eyes, and I washed, and now I see.\"",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Therefore some of the Pharisees were saying, \"This man is not from God, because he does not keep the Sabbath.\" But others were saying, \"How can a sinful man perform such signs?\" And there was a division among them.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "So they said to the blind man again, \"What do you say about him, since he opened your eyes?\" He said, \"He is a prophet.\"",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Now the Judean authorities did not believe the facts about him—that he had been blind and had received his sight—until they summoned the parents of the man who had received his sight.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "They questioned them, saying, \"Is this your son, whom you say was born blind? How then does he now see?\"",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "His parents answered, \"We know that this is our son and that he was born blind.",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "But how he now sees, we do not know, nor do we know who opened his eyes. Ask him—he is of age. He will speak for himself.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "His parents said these things because they were afraid of the Judean authorities, for the Judean authorities had already agreed that if anyone should acknowledge him as the Messiah, that person would be expelled from the synagogue.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "This is why his parents said, \"He is of age; question him.\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "So they summoned the man a second time—the one who had been blind—and said to him, \"Give glory to God. We know that this man is a sinner.\"",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "He answered, \"Whether he is a sinner, I do not know. One thing I do know: that though I was blind, now I see.\"",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "They said to him, \"What did he do to you? How did he open your eyes?\"",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "He answered them, \"I have already told you, and you did not listen. Why do you want to hear it again? You don't want to become his disciples too, do you?\"",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "Then they reviled him and said, \"You are a disciple of that man, but we are disciples of Moses.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "We know that God has spoken to Moses, but as for this man, we do not know where he is from.\"",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "The man answered and said to them, \"Well, here is something remarkable: that you do not know where he is from, and yet he opened my eyes.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "We know that God does not listen to sinners, but if anyone is devout and does his will, God listens to that person.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Never in all history has it been heard that anyone opened the eyes of a person born blind.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "If this man were not from God, he could do nothing.\"",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "They answered and said to him, \"You were born entirely in sins, and you are teaching us?\" And they threw him out.",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "Jesus heard that they had thrown him out, and when he found him, he said, \"Do you believe in the Son of Man?\"",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "He answered, \"And who is he, sir, that I may believe in him?\"",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "Jesus said to him, \"You have both seen him, and he is the one speaking with you.\"",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "He said, \"I believe, Lord,\" and he worshipped him.",
          "paragraphStart": true
        },
        {
          "verse": 39,
          "text": "And Jesus said, \"For judgment I came into this world, so that those who do not see may see, and those who see may become blind.\"",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "Some of the Pharisees who were with him heard these things and said to him, \"Surely we are not blind too, are we?\"",
          "paragraphStart": true
        },
        {
          "verse": 41,
          "text": "Jesus said to them, \"If you were blind, you would have no sin. But now you say, 'We see.' Your sin remains.\"",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Judean authorities\" (vv. 18, 22)**: The Greek οἱ Ἰουδαῖοι presents a translation challenge throughout John's Gospel. While often rendered \"the Jews,\" this creates confusion since Jesus and his disciples were themselves Jewish. In John's narrative, the term frequently refers specifically to the Jerusalem-based religious leadership hostile to Jesus. \"Judean authorities\" captures this institutional sense while avoiding the anachronism of ethnic/religious categories that would make all parties \"Jewish.\"\n\n**\"Expelled from the synagogue\" (v. 22)**: The term ἀποσυνάγωγος refers to formal excommunication from the synagogue community. This was not merely social ostracism but cut one off from religious participation and communal life, a severe penalty in first-century Jewish society.\n\n**\"Give glory to God\" (v. 24)**: This was a formal oath formula used to compel truthful testimony (see Joshua 7:19). The Pharisees are not praising God but rather demanding that the man swear an oath and confirm their version of events—that Jesus is a sinner.\n\n**\"Never in all history\" (v. 32)**: The phrase ἐκ τοῦ αἰῶνος literally means \"from the age\" but idiomatically refers to all recorded time or history. The man is making a dramatic rhetorical point about the unprecedented nature of the miracle.\n\n**\"Son of Man\" (v. 35)**: This preserves Jesus's characteristic self-designation, which carries both messianic overtones (Daniel 7:13-14) and an emphasis on his humanity and representative role.\n\n**\"You have both seen him\" (v. 37)**: There is wordplay here impossible to fully preserve in English. The man who was physically blind and is now able to see is told that he has \"seen\" (ἑώρακας) the Son of Man—both literally with his new sight and spiritually through recognition of Jesus's identity.\n\n**\"For judgment\" (v. 39)**: The Greek εἰς κρίμα indicates purpose. Jesus came to bring about a crisis of judgment that would reveal people's true spiritual condition—those who acknowledge their blindness can receive sight, while those who claim to see remain in darkness."
    },
    {
      "chapter": 10,
      "verses": [
        {
          "verse": 1,
          "text": "Truly, truly I tell you: the one who does not enter through the door into the sheepfold but climbs in some other way—that one is a thief and a bandit.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "But the one who enters through the door is the shepherd of the sheep.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "The doorkeeper opens for him, and the sheep hear his voice. He calls his own sheep by name and leads them out.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "When he has brought out all his own, he goes ahead of them, and the sheep follow him because they know his voice.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But they will never follow a stranger; instead they will flee from him, because they do not know the voice of strangers.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Jesus spoke this figure of speech to them, but they did not understand what he was saying to them.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "So Jesus said to them again: Truly, truly I tell you, I am the door of the sheep.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "All who came before me are thieves and bandits, but the sheep did not listen to them.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "I am the door. If anyone enters through me, he will be saved—he will come in and go out and find pasture.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "The thief comes only to steal and slaughter and destroy. I have come so that they may have life, and have it abundantly.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "I am the good shepherd. The good shepherd lays down his life for the sheep.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "The hired hand, who is not the shepherd and does not own the sheep, sees the wolf coming and abandons the sheep and flees—and the wolf snatches them and scatters them—",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "because he is a hired hand and does not care about the sheep.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "I am the good shepherd. I know my own and my own know me,",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "just as the Father knows me and I know the Father. And I lay down my life for the sheep.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "I have other sheep that are not of this fold. I must bring them also, and they will hear my voice. Then there will be one flock, one shepherd.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "This is why the Father loves me: because I lay down my life so that I may take it up again.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "No one takes it from me, but I lay it down of my own accord. I have authority to lay it down, and I have authority to take it up again. This command I received from my Father.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "A division occurred again among the Judeans because of these words.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Many of them were saying, \"He has a demon and is out of his mind. Why are you listening to him?\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Others were saying, \"These are not the words of someone demon-possessed. A demon cannot open the eyes of the blind, can it?\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "At that time the Festival of Dedication took place in Jerusalem. It was winter,",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "and Jesus was walking in the temple, in Solomon's Colonnade.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "The Judeans gathered around him and said to him, \"How long will you keep us in suspense? If you are the Messiah, tell us plainly.\"",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Jesus answered them, \"I have told you, and you do not believe. The works that I do in my Father's name—these testify about me.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "But you do not believe because you are not of my sheep.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "My sheep hear my voice. I know them, and they follow me.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "I give them eternal life, and they will never perish, and no one will snatch them out of my hand.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "My Father, who has given them to me, is greater than all, and no one is able to snatch them out of the Father's hand.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "I and the Father are one.\"",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "The Judeans picked up stones again to stone him.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "Jesus answered them, \"I have shown you many good works from the Father. For which of these works are you stoning me?\"",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "The Judeans answered him, \"We are not stoning you for a good work but for blasphemy—because you, being a man, make yourself God.\"",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "Jesus answered them, \"Is it not written in your law, 'I said, you are gods'?",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "If he called them 'gods'—those to whom the word of God came, and the scripture cannot be broken—",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "do you say of the one whom the Father consecrated and sent into the world, 'You are blaspheming,' because I said, 'I am the Son of God'?",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "If I am not doing the works of my Father, do not believe me.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "But if I am doing them, even if you do not believe me, believe the works, so that you may come to know and continue to know that the Father is in me and I am in the Father.\"",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "Then they tried again to seize him, but he escaped from their hands.",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "He went away again across the Jordan to the place where John had been baptizing at first, and he remained there.",
          "paragraphStart": true
        },
        {
          "verse": 41,
          "text": "Many came to him and were saying, \"John performed no sign, but everything John said about this man was true.\"",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "And many believed in him there.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Truly, truly\"**: The doubled ἀμὴν ἀμήν is a solemn formula unique to John's Gospel, representing the Hebrew/Aramaic אָמֵן. This emphatic doubling marks Jesus's words as carrying divine authority.\n\n**\"Bandit\" (λῃστής)**: This term denotes not merely a petty thief but a violent robber or insurgent—someone who takes by force. In first-century Judean context, it often referred to revolutionary brigands. The pairing with κλέπτης (thief, stealth-thief) covers both covert and violent forms of predation.\n\n**\"Figure of speech\" (παροιμία)**: Not quite \"parable\" (παραβολή), which John never uses. This term suggests a veiled saying, proverb, or figurative discourse—something requiring interpretation.\n\n**\"Good shepherd\" (ποιμὴν ὁ καλός)**: While καλός can mean \"beautiful,\" in this context it carries the sense of \"noble, excellent, exemplary\"—the shepherd who embodies the ideal. The background is Ezekiel 34, where God condemns Israel's failed shepherds and promises to shepherd his people himself.\n\n**\"Lay down\" (τίθημι)**: Rather than the more common \"give up,\" this verb emphasizes the voluntary, deliberate nature of the action—Jesus places his life down by choice.\n\n**\"Abundantly\" (περισσὸν ἔχωσιν)**: The phrase literally means \"have in excess\" or \"have overflowing\"—life not just preserved but flourishing beyond mere survival.\n\n**\"Judeans\" (Ἰουδαῖοι)**: This term in John's Gospel is complex. While often translated \"Jews,\" it frequently refers specifically to the Judean authorities or inhabitants of Judea who oppose Jesus, not to Jewish people generally. The context usually indicates religious-political leadership. I've used \"Judeans\" to preserve this ambiguity and avoid anachronistic readings.\n\n**\"Keep us in suspense\" (τὴν ψυχὴν ἡμῶν αἴρεις)**: Literally \"lift up our soul/life.\" This idiom means to keep someone in anxious uncertainty or doubt—holding them suspended.\n\n**\"Messiah\" (χριστός)**: While often transliterated as \"Christ,\" in this context the interrogators are asking about the expected Jewish deliverer-king, so \"Messiah\" better captures the original sense for modern readers.\n\n**\"Are one\" (ἕν ἐσμεν)**: The neuter ἕν (not masculine εἷς) indicates unity of essence or purpose, not numerical identity. This is the claim that provokes the charge of blasphemy.\n\n**\"Your law\"**: Jesus's distancing language (\"your law\" rather than \"our law\") is characteristic of John's presentation of Jesus's relationship to Jewish authority structures.\n\n**\"Come to know and continue to know\" (γνῶτε καὶ γινώσκητε)**: The aorist followed by the present subjunctive suggests both an initial realization and an ongoing, deepening knowledge.\n\n**\"Escaped from their hands\" (ἐξῆλθεν ἐκ τῆς χειρὸς αὐτῶν)**: The language suggests a mysterious departure—he went out from their grasp, implying either supernatural evasion or the crowd's inability to hold him."
    },
    {
      "chapter": 11,
      "verses": [
        {
          "verse": 1,
          "text": "Now there was a man who was ill—Lazarus from Bethany, from the village of Mary and her sister Martha.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "(This Mary was the one who anointed the Lord with perfumed oil and wiped his feet with her hair; it was her brother Lazarus who was ill.)",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "So the sisters sent word to him, saying, \"Lord, look—the one you love is ill.\"",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But when Jesus heard this, he said, \"This illness is not destined for death, but rather for the glory of God, so that the Son of God may be glorified through it.\"",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "Now Jesus loved Martha and her sister and Lazarus.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "So when he heard that Lazarus was ill, he actually remained in the place where he was for two more days.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Then after this he says to the disciples, \"Let us go back to Judea.\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "The disciples say to him, \"Rabbi, the Judeans were just now trying to stone you, and you're going back there again?\"",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Jesus answered, \"Are there not twelve hours in the day? If anyone walks during the day, he does not stumble, because he sees the light of this world.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "But if anyone walks during the night, he stumbles, because the light is not in him.\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "He said these things, and after this he tells them, \"Our friend Lazarus has fallen asleep, but I am going so that I may awaken him.\"",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "So the disciples said to him, \"Lord, if he has fallen asleep, he will recover.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Jesus had been speaking about his death, but they supposed that he was speaking about the rest that comes from sleep.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "So then Jesus told them plainly, \"Lazarus has died,",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "and I am glad for your sake that I was not there, so that you may believe. But let us go to him.\"",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Then Thomas, the one called the Twin, said to his fellow disciples, \"Let us also go, so that we may die with him.\"",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "When Jesus arrived, he found that Lazarus had already been in the tomb for four days.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Now Bethany was near Jerusalem, about fifteen stadia away.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Many of the Judeans had come to Martha and Mary to console them concerning their brother.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "So when Martha heard that Jesus was coming, she went out to meet him, while Mary remained sitting in the house.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Martha said to Jesus, \"Lord, if you had been here, my brother would not have died.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "But even now I know that whatever you ask from God, God will give you.\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Jesus says to her, \"Your brother will rise again.\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Martha says to him, \"I know that he will rise again in the resurrection on the last day.\"",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Jesus said to her, \"I am the resurrection and the life. The one who believes in me, even if he dies, will live,",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "and everyone who lives and believes in me will never die—not ever. Do you believe this?\"",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "She says to him, \"Yes, Lord. I have come to believe that you are the Messiah, the Son of God, the one coming into the world.\"",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "And having said this, she went away and called her sister Mary privately, saying, \"The Teacher is here and is calling for you.\"",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "When she heard this, she got up quickly and went to him.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Now Jesus had not yet entered the village, but was still in the place where Martha had met him.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "So the Judeans who were with her in the house, consoling her, when they saw Mary get up quickly and go out, followed her, supposing that she was going to the tomb to weep there.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Then when Mary came to where Jesus was and saw him, she fell at his feet, saying to him, \"Lord, if you had been here, my brother would not have died.\"",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "When Jesus saw her weeping, and the Judeans who came with her also weeping, he was deeply moved in spirit and troubled within himself.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "He said, \"Where have you laid him?\" They say to him, \"Lord, come and see.\"",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "Jesus wept.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "So the Judeans were saying, \"See how much he loved him!\"",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "But some of them said, \"Could not this man, who opened the eyes of the blind man, have done something so that this man would not die?\"",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "Then Jesus, again deeply moved within himself, comes to the tomb. It was a cave, and a stone was lying against it.",
          "paragraphStart": true
        },
        {
          "verse": 39,
          "text": "Jesus says, \"Remove the stone.\" Martha, the sister of the one who had died, says to him, \"Lord, by now there will be a stench, for it has been four days.\"",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "Jesus says to her, \"Did I not tell you that if you believe, you will see the glory of God?\"",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "So they removed the stone. Then Jesus lifted his eyes upward and said, \"Father, I thank you that you heard me.",
          "paragraphStart": true
        },
        {
          "verse": 42,
          "text": "I myself knew that you always hear me, but I spoke because of the crowd standing around, so that they may believe that you sent me.\"",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "And having said these things, he cried out with a loud voice, \"Lazarus, come out!\"",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "The dead man came out, his feet and hands bound with strips of linen, and his face wrapped with a burial cloth. Jesus says to them, \"Unbind him and let him go.\"",
          "paragraphStart": true
        },
        {
          "verse": 45,
          "text": "Therefore many of the Judeans who had come to Mary and had seen what he did believed in him.",
          "paragraphStart": true
        },
        {
          "verse": 46,
          "text": "But some of them went to the Pharisees and told them what Jesus had done.",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "So the chief priests and the Pharisees convened the council and were saying, \"What are we doing? For this man is performing many signs.",
          "paragraphStart": true
        },
        {
          "verse": 48,
          "text": "If we let him go on like this, everyone will believe in him, and the Romans will come and take away both our place and our nation.\"",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "But one of them, Caiaphas, who was high priest that year, said to them, \"You know nothing at all.",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "You do not even consider that it is better for you that one man should die for the people than that the whole nation should perish.\"",
          "paragraphStart": false
        },
        {
          "verse": 51,
          "text": "Now he did not say this on his own initiative, but being high priest that year, he prophesied that Jesus was about to die for the nation—",
          "paragraphStart": true
        },
        {
          "verse": 52,
          "text": "and not only for the nation, but also in order to gather into one the scattered children of God.",
          "paragraphStart": false
        },
        {
          "verse": 53,
          "text": "So from that day on they resolved to kill him.",
          "paragraphStart": false
        },
        {
          "verse": 54,
          "text": "Therefore Jesus no longer walked about openly among the Judeans, but went away from there to the region near the wilderness, to a town called Ephraim, and there he remained with the disciples.",
          "paragraphStart": true
        },
        {
          "verse": 55,
          "text": "Now the Passover of the Judeans was near, and many went up to Jerusalem from the countryside before the Passover to purify themselves.",
          "paragraphStart": true
        },
        {
          "verse": 56,
          "text": "So they were looking for Jesus and saying to one another as they stood in the temple, \"What do you think? Surely he will not come to the festival, will he?\"",
          "paragraphStart": false
        },
        {
          "verse": 57,
          "text": "Now the chief priests and the Pharisees had given orders that if anyone knew where he was, they should report it, so that they might arrest him.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The Judeans\" (throughout)**: The Greek οἱ Ἰουδαῖοι in John's Gospel is complex. It sometimes means the religious authorities (especially in Jerusalem), sometimes the inhabitants of Judea as distinct from Galilee or Samaria, and sometimes Jewish people generally. In this chapter, the context suggests the term primarily refers to people from Judea—hence \"the Judeans\" rather than the anachronistic \"the Jews.\" This maintains the geographical and political specificity John intends while avoiding the later theological freight that \"the Jews\" has acquired.\n\n**\"Deeply moved\" (v. 33, 38)**: The verb ἐμβριμάομαι (ἐνεβριμήσατο, ἐμβριμώμενος) is notoriously difficult. It can mean \"snort with anger\" (like a horse), \"scold,\" or \"express deep emotion.\" Traditional translations often soften it to \"troubled\" or \"deeply moved,\" but the term carries a note of indignation or intense emotional disturbance. \"Deeply moved\" captures the intensity while acknowledging the interpretive difficulty—Jesus is not merely sad but profoundly agitated, whether at death itself, at unbelief, or at the mourning before him.\n\n**\"The one you love\" vs. \"loved\"**: In verse 3, the sisters use φιλέω (love/affection), which Jesus echoes in verse 11 calling Lazarus \"our friend\" (φίλος). In verse 5, the narrator uses ἀγαπάω (love) for Jesus's love of all three siblings. In verse 36, the Judeans use ἐφίλει (past tense of φιλέω). John often uses these terms interchangeably (see John 21), so I have not forced a sharp distinction, but retained \"love\" and \"loved\" to reflect the semantic field of affection and friendship.\n\n**\"Will recover\" (v. 12)**: The Greek σωθήσεται literally means \"will be saved,\" but in the context of physical sleep and illness, the disciples clearly mean \"will get better/recover.\" The verb σῴζω has a range from physical deliverance to spiritual salvation; context determines the sense.\n\n**\"The Twin\" (v. 16)**: Δίδυμος is Greek for \"twin,\" translating the Aramaic name Thomas (תאומא, *te'oma*). I have rendered it \"the Twin\" to show that it functions as a descriptive title.\n\n**\"Stadia\" (v. 18)**: A stadion (plural stadia) was roughly 185 meters or 607 feet. Fifteen stadia equals about 1.7 miles or 2.8 kilometers. I retained \"stadia\" as it preserves the ancient measurement system without imposing anachronistic conversions.\n\n**\"Never die—not ever\" (v. 26)**: The Greek οὐ μὴ ἀποθάνῃ εἰς τὸν αἰῶνα uses the strongest form of negation (οὐ μή) combined with the temporal phrase \"into the age/forever.\" The double negative construction in Greek (which creates an emphatic positive in meaning) is captured by the emphatic English rendering \"never... not ever.\"\n\n**\"I have come to believe\" (v. 27)**: The perfect tense πεπίστευκα indicates completed action with ongoing results—Martha's belief is not just a past event but a present reality. \"I have come to believe\" captures this better than \"I believe.\"\n\n**\"Troubled within himself\" (v. 33)**: The phrase ἐτάραξεν ἑαυτόν is reflexive—literally \"he troubled himself\" or \"he agitated himself.\" This is an unusual construction suggesting Jesus deliberately allowed himself to experience profound emotional disturbance.\n\n**\"Burial cloth\" (v. 44)**: The σουδάριον was a cloth used to cover the face of the deceased. \"Burial cloth\" is more specific than \"cloth\" and clearer than the transliterated \"sudarium.\"\n\n**\"Resolved\" (v. 53)**: The verb ἐβουλεύσαντο means to deliberate and reach a decision—\"they resolved\" captures both the deliberative process and the decision reached.\n\n**\"Our place\" (v. 48)**: The τόπος (\"place\") likely refers to the temple, the geographic center of Jewish religious and political life under Roman occupation."
    },
    {
      "chapter": 12,
      "verses": [
        {
          "verse": 1,
          "text": "Six days before the Passover, Jesus came to Bethany, where Lazarus was—the one Jesus had raised from the dead.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "So they prepared a dinner for him there. Martha was serving, and Lazarus was one of those reclining at the table with him.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Then Mary took a Roman pound of perfume—pure nard oil, very costly—and anointed the feet of Jesus and wiped his feet with her hair. And the house was filled with the fragrance of the perfume.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But Judas Iscariot, one of his disciples—the one who was about to betray him—said,",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "\"Why was this perfume not sold for three hundred denarii and the money given to the poor?\"",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "He said this not because he cared about the poor, but because he was a thief; he kept the money box and used to pilfer what was put into it.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Jesus said, \"Leave her alone, so that she may keep it for the day of my burial preparation.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "For the poor you always have with you, but you do not always have me.\"",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Now a large crowd from among the Judeans learned that he was there, and they came not only because of Jesus but also to see Lazarus, whom he had raised from the dead.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "So the chief priests plotted to kill Lazarus as well,",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "because on account of him many of the Judeans were going over and believing in Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "The next day, the large crowd that had come for the festival heard that Jesus was coming to Jerusalem.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "So they took branches of palm trees and went out to meet him, and they were shouting: \"Hosanna! Blessed is the one who comes in the name of the Lord—even the King of Israel!\"",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And Jesus, finding a young donkey, sat on it, just as it is written:",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "\"Do not fear, daughter of Zion; look, your king is coming, seated on a donkey's colt.\"",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "His disciples did not understand these things at first, but when Jesus was glorified, then they remembered that these things had been written about him and that they had done these things to him.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "So the crowd that had been with him when he called Lazarus out of the tomb and raised him from the dead continued to bear witness.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "This is also why the crowd went to meet him—because they heard that he had performed this sign.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "The Pharisees therefore said to one another, \"You see that you are accomplishing nothing. Look—the world has gone after him!\"",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Now there were some Greeks among those who were going up to worship at the festival.",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "These men approached Philip, who was from Bethsaida of Galilee, and made a request of him, saying, \"Sir, we wish to see Jesus.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Philip went and told Andrew; Andrew and Philip went and told Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Jesus answered them, saying, \"The hour has come for the Son of Man to be glorified.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Truly, truly I tell you: unless the grain of wheat falls into the earth and dies, it remains alone; but if it dies, it bears much fruit.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "The one who loves his life destroys it, and the one who hates his life in this world will preserve it for eternal life.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "If anyone serves me, let him follow me, and where I am, there my servant will also be. If anyone serves me, the Father will honor him.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "\"Now my soul is troubled. And what shall I say? 'Father, save me from this hour'? But it is for this very reason that I came to this hour.",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "Father, glorify your name.\" Then a voice came from heaven: \"I have glorified it, and I will glorify it again.\"",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "The crowd standing there who heard it said that thunder had occurred. Others said, \"An angel has spoken to him.\"",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "Jesus answered and said, \"This voice has not come for my sake but for yours.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "Now is the judgment of this world; now the ruler of this world will be cast out.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "And I, when I am lifted up from the earth, will draw all people to myself.\"",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "He said this to indicate what kind of death he was about to die.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "The crowd answered him, \"We have heard from the Law that the Messiah remains forever. So how can you say that the Son of Man must be lifted up? Who is this Son of Man?\"",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "Jesus therefore said to them, \"The light is among you for a little while longer. Walk while you have the light, so that darkness may not overtake you. The one who walks in the darkness does not know where he is going.",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "While you have the light, believe in the light, so that you may become sons of light.\" After Jesus had said these things, he departed and hid himself from them.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "Although he had performed so many signs in their presence, they did not believe in him,",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "so that the word spoken by Isaiah the prophet might be fulfilled: \"Lord, who has believed our message? And to whom has the arm of the Lord been revealed?\"",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "For this reason they were unable to believe, because Isaiah again said:",
          "paragraphStart": true
        },
        {
          "verse": 40,
          "text": "\"He has blinded their eyes and hardened their heart, so that they might not see with their eyes and understand with their heart and turn back—and I would heal them.\"",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "Isaiah said these things because he saw his glory and spoke about him.",
          "paragraphStart": true
        },
        {
          "verse": 42,
          "text": "Nevertheless, even among the rulers many believed in him, but because of the Pharisees they would not openly acknowledge it, so that they would not be expelled from the synagogue.",
          "paragraphStart": true
        },
        {
          "verse": 43,
          "text": "For they loved the glory that comes from people more than the glory that comes from God.",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "Jesus cried out and said, \"The one who believes in me believes not in me but in the one who sent me,",
          "paragraphStart": true
        },
        {
          "verse": 45,
          "text": "and the one who sees me sees the one who sent me.",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "I have come as light into the world, so that everyone who believes in me may not remain in darkness.",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "And if anyone hears my words and does not keep them, I do not judge him; for I did not come to judge the world but to save the world.",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "The one who rejects me and does not receive my words has his judge: the word that I have spoken—that will judge him on the last day.",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "For I have not spoken from myself, but the Father who sent me has himself given me commandment about what I should say and what I should speak.",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "And I know that his commandment is eternal life. Therefore what I speak, just as the Father has told me, so I speak.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Pure nard oil\" (v. 3)**: The Greek πιστικῆς (pistikēs) modifying νάρδου (nard) is notoriously difficult. Options include \"genuine/authentic,\" \"liquid/distilled,\" or a place name. The most likely sense is \"pure\" or \"genuine,\" emphasizing the quality of this expensive aromatic oil extracted from the nardostachys plant.\n\n**\"Used to pilfer\" (v. 6)**: The Greek ἐβάσταζεν (literally \"to carry\" or \"bear\") in the context of ὁ κλέπτης (\"thief\") and keeping the money box clearly means embezzlement or theft. The imperfect tense indicates habitual action.\n\n**\"Keep it\" (v. 7)**: The Greek τηρήσῃ can mean either \"keep/preserve\" or \"observe/keep (a command).\" Given the context (the anointing has already occurred), this is best understood as Jesus saying Mary should be allowed to keep/preserve what remains of the anointing for his burial preparation—or that the act itself should be understood as preserving/honoring him for burial.\n\n**\"Judeans\" (v. 9, 11)**: The Greek Ἰουδαίων typically translated \"Jews\" more precisely means \"Judeans\" in this context—people from the region of Judea, as distinct from Galileans or Samaritans. The ethnic-religious sense of \"Jewish\" as we use it today is anachronistic for the first century.\n\n**\"Hosanna\" (v. 13)**: Retained as a loanword. Originally Hebrew הוֹשִׁיעָה נָּא (hoshia na, \"save now/please\"), it had become a liturgical acclamation by the first century, much like \"Hallelujah.\"\n\n**\"Greeks\" (v. 20)**: Ἕλληνες could mean ethnic Greeks or Greek-speaking Gentiles more broadly—likely God-fearers (Gentile adherents to Judaism) given that they came to worship at the festival.\n\n**\"Loves his life/hates his life\" (v. 25)**: The Greek φιλέω (\"loves\") and μισέω (\"hates\") represent Semitic idiom where \"hate\" means \"love less\" or \"be willing to give up.\" This is comparative preference language, not emotional loathing.\n\n**\"Lifted up\" (v. 32, 34)**: The Greek ὑψωθῶ (hypsōthō) is a characteristic Johannine double entendre: it means both \"exalted/glorified\" and literally \"lifted up\" (on the cross). The crowd's confusion in v. 34 shows they catch only the exaltation sense.\n\n**\"Arm of the Lord\" (v. 38)**: Citation from Isaiah 53:1 (LXX). In Hebrew idiom, God's \"arm\" represents his power and saving action.\n\n**\"He has blinded\" (v. 40)**: Citation from Isaiah 6:10. The divine passive construction raises theological questions about divine causation and human responsibility that John leaves in tension. The Greek preserves the active voice (\"he has blinded\"), referring to God as the subject, maintaining the force of the Isaiah text.\n\n**\"Sons of light\" (v. 36)**: A Semitic idiom meaning \"people characterized by light\" or \"belonging to the light.\" Compare the Qumran community's self-designation as \"sons of light\" versus \"sons of darkness.\""
    },
    {
      "chapter": 13,
      "verses": [
        {
          "verse": 1,
          "text": "Now before the festival of Passover, Jesus, knowing that his hour had come to pass from this world to the Father, having loved his own who were in the world, loved them to the end.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And during supper, when the devil had already put it into the heart of Judas, son of Simon Iscariot, to betray him,",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "Jesus—knowing that the Father had given all things into his hands, and that he had come forth from God and was going back to God—",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "rises from the supper and lays aside his outer garments. He took a linen towel and wrapped it around himself.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Then he pours water into the basin and began to wash the feet of the disciples and to wipe them with the towel that was wrapped around him.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "So he comes to Simon Peter. He says to him, \"Lord, are you going to wash my feet?\"",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Jesus answered and said to him, \"What I am doing you do not understand now, but you will understand after these things.\"",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Peter says to him, \"You will never wash my feet—not for all eternity!\" Jesus answered him, \"If I do not wash you, you have no share with me.\"",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Simon Peter says to him, \"Lord, then not only my feet, but also my hands and my head!\"",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Jesus says to him, \"The one who has bathed has no need to wash, except for the feet, but is entirely clean. And you are clean—but not all of you.\"",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "For he knew the one who was betraying him; that is why he said, \"Not all of you are clean.\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "So when he had washed their feet and taken up his garments and reclined again, he said to them, \"Do you understand what I have done for you?",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "You call me 'the Teacher' and 'the Lord,' and you speak rightly, for I am.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "If I then, the Lord and the Teacher, have washed your feet, you also ought to wash one another's feet.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For I have given you an example, so that just as I have done for you, you also should do.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Truly, truly, I tell you: a slave is not greater than his master, nor is one who is sent out greater than the one who sent him.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "If you know these things, you are blessed if you do them.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "\"I am not speaking about all of you—I know whom I have chosen. But the Scripture must be fulfilled: 'The one who eats my bread has lifted his heel against me.'",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "I am telling you now, before it happens, so that when it does happen you may believe that I AM.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Truly, truly, I tell you: whoever receives anyone I send receives me, and whoever receives me receives the one who sent me.\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "After saying these things, Jesus was troubled in his spirit and testified, saying, \"Truly, truly, I tell you that one of you will betray me.\"",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "The disciples began looking at one another, bewildered about whom he was speaking.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "One of his disciples—the one whom Jesus loved—was reclining at table close beside Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "So Simon Peter motions to him to find out who it might be about whom he is speaking.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "That disciple, leaning back thus against the chest of Jesus, says to him, \"Lord, who is it?\"",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Jesus answers, \"It is the one for whom I will dip the morsel and give it to him.\" So after dipping the morsel, he gives it to Judas, son of Simon Iscariot.",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "And after the morsel, then Satan entered into him. So Jesus says to him, \"What you are doing, do quickly.\"",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Now no one at the table understood why he said this to him.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "For some were thinking, since Judas had the money box, that Jesus was telling him, \"Buy what we need for the festival,\" or that he should give something to the poor.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "So after receiving the morsel, that man went out immediately. And it was night.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "When he had gone out, Jesus says, \"Now the Son of Man is glorified, and God is glorified in him.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "If God is glorified in him, God will also glorify him in himself, and will glorify him at once.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "Little children, I am with you only a little longer. You will search for me, and just as I said to the Jews, 'Where I am going, you cannot come,' so now I say to you.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "A new commandment I give to you: that you love one another. Just as I have loved you, so you also should love one another.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "By this everyone will know that you are my disciples—if you have love for one another.\"",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "Simon Peter says to him, \"Lord, where are you going?\" Jesus answered, \"Where I am going you cannot follow me now, but you will follow later.\"",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "Peter says to him, \"Lord, why can't I follow you now? I will lay down my life for you.\"",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "Jesus answers, \"Will you lay down your life for me? Truly, truly, I tell you: the rooster will not crow before you have denied me three times.\"",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Loved them to the end\" (v. 1)**: The phrase εἰς τέλος can mean either \"to the end\" (temporally—through to the conclusion) or \"to the uttermost\" (to the full extent). Both meanings resonate here: Jesus loved them through to the end of his life, and he loved them completely. \"To the end\" preserves the temporal sense while allowing the fuller meaning to echo, especially given what follows.\n\n**\"Not for all eternity\" (v. 8)**: Peter's εἰς τὸν αἰῶνα is an emphatic negative construction—literally \"into the age/eternity.\" This is stronger than a simple \"never\"; it expresses absolute, eternal refusal. The rendering captures Peter's characteristic hyperbole.\n\n**\"Have no share with me\" (v. 8)**: The word μέρος means \"part, portion, share\"—particularly in the sense of participation or partnership. This is relational language about belonging, not merely about having something. Peter would have no place in Jesus's community.\n\n**\"The one who has bathed\" (v. 10)**: The Greek distinguishes between λούω (to bathe the whole body) and νίπτω (to wash a part, here the feet). Jesus is drawing on the cultural practice: one bathed at home, then walked to dinner on dusty roads, requiring only foot-washing upon arrival. The spiritual metaphor is clear to the original audience.\n\n**\"One who is sent out\" (v. 16)**: The term ἀπόστολος literally means \"one sent out with a commission\"—an envoy or emissary. Before becoming a technical term for the Twelve, it carried this general sense of authorized messenger. The translation preserves this meaning without imposing the later technical usage.\n\n**\"I AM\" (v. 19)**: The phrase ἐγώ εἰμι echoes the divine self-identification from Exodus 3:14 and appears repeatedly in John's Gospel as a claim to divine identity. When used absolutely (without a predicate), as here, it carries this weight of divine self-disclosure. The capitalization signals this is not merely \"I am he\" but the divine Name.\n\n**\"Close beside Jesus\" (v. 23)**: The phrase ἐν τῷ κόλπῳ (\"in the bosom/chest\") refers to the ancient practice of reclining at meals. Diners reclined on their left side, so the beloved disciple's position at Jesus's right meant his head was near Jesus's chest—the place of intimacy and honor.\n\n**\"Leaning back\" (v. 25)**: The verb ἀναπίπτω means to fall or lean backward—here, the disciple shifts his position to speak privately with Jesus by leaning back against his chest.\n\n**\"It was night\" (v. 30)**: While literally describing the time of day, John's Gospel consistently uses light and darkness symbolically. This simple statement carries ominous weight: Judas goes out into the darkness, both literally and spiritually.\n\n**\"Little children\" (v. 33)**: The diminutive τεκνία expresses deep affection and intimacy—this is Jesus's only use of this tender address in John's Gospel, heightening the poignancy of the moment."
    },
    {
      "chapter": 14,
      "verses": [
        {
          "verse": 1,
          "text": "Do not let your heart be troubled. You trust in God—trust also in me.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "In my Father's house there are many dwelling places. If it were not so, would I have told you that I am going to prepare a place for you?",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And if I go and prepare a place for you, I am coming again and will receive you to myself, so that where I am, you also may be.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And where I am going, you know the way.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Thomas said to him, \"Lord, we do not know where you are going. How can we know the way?\"",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Jesus said to him, \"I am the way and the truth and the life. No one comes to the Father except through me.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "If you have come to know me, you will also know my Father. From this moment forward you know him and have seen him.\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Philip said to him, \"Lord, show us the Father, and that will be enough for us.\"",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Jesus said to him, \"Have I been with you for so long a time, and you have not come to know me, Philip? The one who has seen me has seen the Father. How can you say, 'Show us the Father'?",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Do you not trust that I am in the Father and the Father is in me? The words that I speak to you I do not speak from myself, but the Father who remains in me does his works.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Trust me that I am in the Father and the Father is in me—or if not, trust because of the works themselves.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Truly, truly I tell you, the one who trusts in me will also do the works that I do, and will do greater works than these, because I am going to the Father.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "And whatever you ask in my name, I will do it, so that the Father may be glorified in the Son.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "If you ask me anything in my name, I will do it.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "If you love me, you will keep my commandments.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "And I will ask the Father, and he will give you another Advocate to be with you forever—",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "the Spirit of truth, whom the world cannot receive because it does not see him or know him. You know him, because he remains with you and will be in you.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "I will not leave you orphaned. I am coming to you.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "In just a little while the world will no longer see me, but you will see me. Because I live, you also will live.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "On that day you will know that I am in my Father, and you are in me, and I am in you.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "The one who has my commandments and keeps them—that one is the one who loves me. And the one who loves me will be loved by my Father, and I will love him and will reveal myself to him.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Judas (not Iscariot) said to him, \"Lord, what has happened that you are about to reveal yourself to us and not to the world?\"",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "Jesus answered and said to him, \"If anyone loves me, he will keep my word, and my Father will love him, and we will come to him and make our dwelling place with him.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "The one who does not love me does not keep my words. And the word that you hear is not mine but belongs to the Father who sent me.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "These things I have spoken to you while remaining with you.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "But the Advocate, the Holy Spirit whom the Father will send in my name—he will teach you all things and will remind you of everything I have said to you.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Peace I leave to you. My peace I give to you. Not as the world gives do I give to you. Do not let your heart be troubled, and do not let it be fearful.",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "You heard me say to you, 'I am going away and I am coming to you.' If you loved me, you would have rejoiced that I am going to the Father, because the Father is greater than I am.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "And now I have told you before it happens, so that when it does happen you may trust.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "I will no longer speak much with you, for the ruler of this world is coming. And he has no claim on me,",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "but so that the world may know that I love the Father, I do exactly as the Father has commanded me. Get up, let us go from here.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Trust\" rather than \"believe\" (vv. 1, 10, 11, 12, 29)**: The Greek πιστεύω in Johannine literature carries more than intellectual assent—it implies personal reliance and commitment. \"Trust\" better captures this relational dimension, particularly in contexts like verse 1 where Jesus is addressing their troubled hearts, not their intellectual doubts.\n\n**\"Dwelling places\" (v. 2) and \"dwelling place\" (v. 23)**: The Greek μονή means a place where one stays or abides. The traditional \"mansions\" (from Latin *mansiones*) misleads modern readers toward luxury estates. The term simply means rooms or quarters where one remains. The wordplay becomes significant in verse 23, where Jesus promises that he and the Father will make their μονή with the believer—using the same term from verse 2. This is about intimate presence, not real estate.\n\n**\"Advocate\" (vv. 16, 26)**: The Greek παράκλητος is notoriously difficult to translate. It means one called alongside to help—a legal advocate, counselor, or helper. \"Comforter\" (KJV) is too narrow and somewhat archaic. \"Helper\" is too generic. \"Advocate\" captures the legal and supportive dimensions while remaining accessible. The term emphasizes active assistance and representation.\n\n**\"Remains/remaining\" (vv. 10, 17, 25)**: The Greek μένω is a key Johannine term meaning to stay, abide, remain, dwell. It conveys permanence and intimate presence. I've varied between \"remains\" and \"remaining\" based on English syntax, but the underlying concept is consistent—ongoing, stable presence.\n\n**\"From this moment forward\" (v. 7)**: The Greek ἀπ' ἄρτι marks a pivotal temporal shift—from this point on, things are different. It's more emphatic than a simple \"now.\"\n\n**\"What has happened\" (v. 22)**: The Greek τί γέγονεν (perfect tense) suggests Judas is asking about what circumstance or event has occurred to cause this change in Jesus's plans. He's puzzled about why the revelation will be limited rather than universal.\n\n**\"He has no claim on me\" (v. 30)**: The Greek ἐν ἐμοὶ οὐκ ἔχει οὐδέν literally means \"in me he has nothing.\" This is an idiomatic way of saying the ruler of this world has no hold, claim, or authority over Jesus—no ground to stand on, no legitimate charge or power.\n\n**\"Greater than I am\" (v. 28)**: This statement has generated enormous theological discussion. The Greek ὁ πατὴρ μείζων μού ἐστιν is straightforward—within the narrative context of the incarnation and Jesus's impending return to the Father, this comparative makes sense without necessarily implying ontological subordination. The context is Jesus's going to the Father, which is cause for joy."
    },
    {
      "chapter": 15,
      "verses": [
        {
          "verse": 1,
          "text": "I am the true vine, and my Father is the vinegrower.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Every branch in me that does not bear fruit, he removes; and every branch that does bear fruit, he prunes clean so that it may bear more fruit.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "You are already clean because of the word I have spoken to you.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Remain in me, and I in you. Just as the branch cannot bear fruit by itself unless it remains in the vine, so neither can you unless you remain in me.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "I am the vine; you are the branches. The one who remains in me and I in him—this one bears much fruit, because apart from me you can do nothing.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "If anyone does not remain in me, he is thrown out like the branch and withers; and they gather them and throw them into the fire, and they are burned.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "If you remain in me and my words remain in you, ask whatever you wish, and it will come to be for you.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "In this my Father has been glorified: that you bear much fruit and so prove to be my disciples.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Just as the Father has loved me, so I have loved you. Remain in my love.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "If you keep my commandments, you will remain in my love, just as I have kept my Father's commandments and remain in his love.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "I have spoken these things to you so that my joy may be in you and your joy may be made full.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "This is my commandment: that you love one another as I have loved you.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "No one has greater love than this: that someone lay down his life for his friends.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "You are my friends if you do what I command you.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "I no longer call you servants, because the servant does not know what his master is doing. But I have called you friends, because everything I have heard from my Father I have made known to you.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "You did not choose me, but I chose you and appointed you so that you would go and bear fruit, and that your fruit would remain, so that whatever you ask the Father in my name, he will give you.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "These things I command you: that you love one another.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "If the world hates you, understand that it has hated me before it hated you.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "If you belonged to the world, the world would love what is its own. But because you do not belong to the world—rather, I chose you out of the world—for this reason the world hates you.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Remember the word that I spoke to you: 'A servant is not greater than his master.' If they persecuted me, they will persecute you also. If they kept my word, they will keep yours also.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "But they will do all these things to you on account of my name, because they do not know the one who sent me.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "If I had not come and spoken to them, they would not have sin. But now they have no excuse for their sin.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "The one who hates me hates my Father also.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "If I had not done among them the works that no one else has done, they would not have sin. But now they have both seen and hated both me and my Father.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "But this is to fulfill the word that is written in their law: 'They hated me without cause.'",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "When the Advocate comes, whom I will send to you from the Father—the Spirit of truth who proceeds from the Father—that one will bear witness concerning me.",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "And you also bear witness, because you have been with me from the beginning.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Vinegrower\" (v. 1)**: The Greek γεωργός literally means \"earth-worker\" or \"farmer,\" but in the context of this extended vine metaphor, \"vinegrower\" (or \"vine-dresser\") more precisely captures the specialized agricultural role being described.\n\n**\"Removes\" and \"prunes clean\" (v. 2)**: The Greek uses αἴρει (lifts up/takes away/removes) and καθαίρει (cleanses/prunes). There's wordplay here with \"clean\" (καθαροί) in verse 3. The vinegrower's pruning makes branches clean/pure for better fruitfulness. I've preserved the connection with \"prunes clean.\"\n\n**\"Remain\" (throughout)**: The Greek μένω/μείνατε appears repeatedly throughout this passage. While often translated \"abide,\" the more natural English \"remain\" better captures the sense of continuing presence and connection. The repetition is deliberate and creates a structural rhythm that should be preserved.\n\n**\"Come to be\" (v. 7)**: The Greek γενήσεται is simply \"it will be/become/happen,\" emphasizing realization rather than mere receiving.\n\n**\"Prove to be\" (v. 8)**: The Greek γένησθε with the verb \"become\" suggests demonstrating or proving one's identity as disciples through bearing fruit, not merely being identified as such.\n\n**\"Lay down his life\" (v. 13)**: The Greek τὴν ψυχὴν αὐτοῦ θῇ literally means \"lay down his soul/life.\" The word ψυχή encompasses both physical life and the animating principle of a person.\n\n**\"Appointed\" (v. 16)**: The Greek ἔθηκα literally means \"placed\" or \"set,\" but in this context of divine commission, \"appointed\" better captures the authoritative assignment to a role and purpose.\n\n**\"Belonged to\" (v. 19)**: The Greek ἐκ τοῦ κόσμου ἦτε literally means \"you were from/of the world.\" I've used \"belonged to\" to capture the sense of origin and allegiance that ἐκ conveys here.\n\n**\"Advocate\" (v. 26)**: The Greek παράκλητος is a rich legal and social term meaning one called alongside to help—an advocate, counselor, helper, or comforter. In the Johannine context, this is a forensic figure who testifies and defends. \"Advocate\" captures the legal dimension while remaining accessible. The traditional \"Comforter\" is too narrow; \"Helper\" too generic; \"Counselor\" misses the forensic context.\n\n**\"Proceeds from\" (v. 26)**: The Greek ἐκπορεύεται has theological significance in later Trinitarian debates. It means \"goes out from\" or \"proceeds from,\" indicating the Spirit's origin or mission from the Father.\n\n**\"Without cause\" (v. 25)**: The Greek δωρεάν means \"freely, as a gift, gratuitously\"—here in the negative sense of \"without reason or justification.\" This quotes Psalm 69:4 (LXX 68:5) or Psalm 35:19."
    },
    {
      "chapter": 16,
      "verses": [
        {
          "verse": 1,
          "text": "I have spoken these things to you so that you will not fall away.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "They will expel you from the synagogues. Indeed, an hour is coming when everyone who kills you will think they are offering sacred service to God.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And they will do these things because they have not known the Father or me.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But I have spoken these things to you so that when their hour comes, you may remember that I told you about them. I did not tell you these things from the beginning, because I was with you.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But now I am going to the one who sent me, and not one of you asks me, \"Where are you going?\"",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Rather, because I have spoken these things to you, grief has filled your heart.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "But I tell you the truth: it is to your advantage that I go away. For if I do not go away, the Advocate will not come to you; but if I go, I will send him to you.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "And when he comes, he will expose the world concerning sin, and concerning righteousness, and concerning judgment:",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "concerning sin, because they do not believe in me;",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "concerning righteousness, because I am going to the Father and you will no longer see me;",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "and concerning judgment, because the ruler of this world has been judged.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "I still have many things to say to you, but you cannot bear them now.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "But when he comes—that one, the Spirit of truth—he will guide you into all the truth. For he will not speak from himself, but whatever he hears he will speak, and he will announce to you the things that are coming.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "He will glorify me, because he will take from what is mine and announce it to you.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Everything that the Father has is mine. This is why I said that he takes from what is mine and will announce it to you.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "A little while and you will no longer see me, and again a little while and you will see me.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "So some of his disciples said to one another, \"What does this mean that he is saying to us: 'A little while and you do not see me, and again a little while and you will see me,' and, 'Because I am going to the Father'?\"",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "They were saying, \"What is this 'little while' he is talking about? We do not know what he is saying.\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Jesus knew that they wanted to question him, and he said to them, \"Are you inquiring among yourselves about this—that I said, 'A little while and you do not see me, and again a little while and you will see me'?",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Amen, amen, I tell you: you will weep and lament, but the world will rejoice. You will be grieved, but your grief will become joy.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "A woman, when she is giving birth, has grief because her hour has come. But when she has delivered the child, she no longer remembers the anguish because of the joy that a human being has been born into the world.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "So you also now have grief. But I will see you again, and your heart will rejoice, and no one will take your joy from you.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "And on that day you will not ask me anything. Amen, amen, I tell you: whatever you ask the Father, he will give you in my name.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Until now you have asked for nothing in my name. Ask, and you will receive, so that your joy may be complete.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "I have spoken these things to you in figures of speech. An hour is coming when I will no longer speak to you in figures of speech, but I will announce to you plainly about the Father.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "On that day you will ask in my name, and I do not tell you that I will petition the Father on your behalf,",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "for the Father himself loves you, because you have loved me and have believed that I came forth from God.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "I came forth from the Father and have come into the world. Again, I am leaving the world and going to the Father.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "His disciples said, \"Look, now you are speaking plainly and not using any figure of speech.",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "Now we know that you know all things and have no need for anyone to question you. By this we believe that you came forth from God.\"",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Jesus answered them, \"Do you believe now?",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "Look, an hour is coming—and has come—when you will be scattered, each to his own, and you will leave me alone. Yet I am not alone, because the Father is with me.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "I have spoken these things to you so that in me you may have peace. In the world you have affliction, but take courage: I have conquered the world.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Fall away\" (v. 1)**: The Greek σκανδαλισθῆτε carries the sense of being trapped or caused to stumble, leading to apostasy. \"Fall away\" captures this meaning of abandoning faith under pressure.\n\n**\"Sacred service\" (v. 2)**: The Greek λατρείαν refers specifically to religious worship or cultic service. The point is that persecutors will believe their violence is an act of devotion to God—a chilling warning about religious zeal divorced from true knowledge.\n\n**\"The Advocate\" (v. 7)**: The Greek παράκλητος is a technical legal and forensic term meaning one called alongside to help—an advocate, counselor, or defender. The traditional \"Comforter\" (from Latin *confortare*, to strengthen) captures only part of the meaning. \"Helper\" is too weak. \"Advocate\" better conveys the legal and defensive role this figure plays in the following verses.\n\n**\"Expose\" (v. 8)**: The Greek ἐλέγξει means to expose, convict, or bring to light—particularly in a legal sense. It's stronger than merely \"convict\" (internal) or \"prove wrong\" (intellectual). The Spirit will lay bare the truth about these matters before the world.\n\n**\"Guide you into all the truth\" (v. 13)**: The Greek ὁδηγήσει ὑμᾶς ἐν τῇ ἀληθείᾳ πάσῃ literally means \"guide you in all the truth\" (with a locative sense of being within truth's realm). The Spirit leads disciples deeper into truth's territory, not just to a single doctrinal destination.\n\n**\"Bear\" (v. 12)**: The Greek βαστάζειν means to carry, bear the weight of. The disciples cannot yet carry the full weight of what Jesus wants to teach them.\n\n**\"Figures of speech\" (v. 25, 29)**: The Greek παροιμίαις refers to figurative or veiled speech—proverbs, riddles, indirect sayings. \"Plainly\" translates παρρησίᾳ, which means open, frank, bold speech without concealment.\n\n**\"Complete\" (v. 24)**: The Greek πεπληρωμένη means filled full, made complete. Their joy will reach its intended fullness.\n\n**\"Conquered\" (v. 33)**: The Greek νενίκηκα is a perfect tense verb meaning \"I have conquered\" or \"I have overcome.\" The victory is already accomplished, though its effects continue. Jesus speaks from the vantage point of completed triumph."
    },
    {
      "chapter": 17,
      "verses": [
        {
          "verse": 1,
          "text": "Jesus said these things, and lifting his eyes toward heaven, he said: \"Father, the hour has come. Glorify your Son, so that the Son may glorify you,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "just as you gave him authority over all flesh, so that to all whom you have given him, he may give eternal life.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And this is eternal life: that they may know you, the only true God, and Jesus Christ whom you sent.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "I glorified you on the earth, having completed the work that you gave me to do.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "And now, Father, glorify me in your own presence with the glory that I had in your presence before the world existed.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "I have made your name known to the people whom you gave me out of the world. They were yours, and you gave them to me, and they have kept your word.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Now they have come to know that everything you have given me is from you,",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "because the words that you gave me I have given to them, and they received them and truly knew that I came forth from you, and they believed that you sent me.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "I am asking on their behalf. I am not asking on behalf of the world, but on behalf of those whom you have given me, because they are yours.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "And all that is mine is yours, and what is yours is mine, and I have been glorified in them.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And I am no longer in the world, yet they are in the world, and I am coming to you. Holy Father, keep them in your name that you have given me, so that they may be one just as we are one.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "When I was with them, I kept them in your name that you have given me. I guarded them, and not one of them was lost except the son of destruction, so that the scripture might be fulfilled.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "But now I am coming to you, and I speak these things in the world so that they may have my joy brought to completion in themselves.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "I have given them your word, and the world has hated them because they are not from the world, just as I am not from the world.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "I am not asking that you take them out of the world, but that you keep them from the evil one.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "They are not from the world, just as I am not from the world.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Consecrate them in the truth; your word is truth.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Just as you sent me into the world, so I have sent them into the world.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And on their behalf I consecrate myself, so that they also may be consecrated in truth.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "I am asking not only on behalf of these, but also on behalf of those who believe in me through their word,",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "so that all may be one. Just as you, Father, are in me and I am in you, may they also be in us, so that the world may believe that you sent me.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "And the glory that you have given me I have given to them, so that they may be one just as we are one,",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "I in them and you in me, so that they may be perfected into one, so that the world may know that you sent me and loved them just as you loved me.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Father, as for what you have given me, I desire that where I am, they also may be with me, so that they may behold my glory that you have given me, because you loved me before the foundation of the world.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "Righteous Father, the world did not know you, but I knew you, and these have come to know that you sent me.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "And I made your name known to them, and I will make it known, so that the love with which you loved me may be in them, and I in them.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Authority over all flesh\" (v. 2)**: The Greek πάσης σαρκός literally means \"all flesh\"—a Hebraism referring to all humanity, not just physical bodies. This echoes Old Testament usage where \"all flesh\" denotes all people (e.g., Genesis 6:12, Isaiah 40:5-6).\n\n**\"Eternal life\" (v. 2-3)**: The Greek ζωὴν αἰώνιον means life of the age to come—not merely unending duration but the quality of life characteristic of God's eternal realm. The immediate definition provided in verse 3 (knowing God) emphasizes relationship over mere temporal extension.\n\n**\"Made your name known / made known\" (v. 6, 26)**: The Greek ἐφανέρωσα and ἐγνώρισα mean to reveal, manifest, or make known. In Hebrew thought, God's \"name\" represents his character, nature, and presence—not merely a designation. Jesus reveals who God truly is.\n\n**\"Keep them / kept them / guarded them\" (v. 11-12)**: The Greek τηρέω means to guard, protect, preserve, keep safe. It appears repeatedly in this prayer with different nuances—sometimes keeping in safety, sometimes keeping in faithfulness to God's name or word.\n\n**\"The son of destruction\" (v. 12)**: A Hebrew idiom where \"son of X\" means one characterized by or destined for X. The Greek ὁ υἱὸς τῆς ἀπωλείας refers to Judas as one destined for or characterized by destruction/perdition.\n\n**\"Consecrate / consecrated / consecrate myself\" (v. 17, 19)**: The Greek ἁγιάζω means to make holy, set apart for sacred purpose. \"Sanctify\" is traditional but increasingly archaic. \"Consecrate\" better captures the sense of being dedicated or set apart for God's purposes. In verse 19, Jesus consecrates himself—sets himself apart for the sacrificial purpose of the cross.\n\n**\"The evil one\" (v. 15)**: The Greek τοῦ πονηροῦ can be either neuter (\"evil\" as an abstract) or masculine (\"the evil one\" as a personal being). Given Johannine theology's emphasis on personal cosmic conflict (the ruler of this world, the devil, Satan), the personal rendering is more likely.\n\n**\"Perfected into one\" (v. 23)**: The Greek τετελειωμένοι εἰς ἕν uses a perfect participle suggesting completion or maturity brought to fullness. \"Perfected\" preserves both the sense of completion and the intensification of unity—not just \"being\" one but being brought to complete/mature oneness.\n\n**\"Behold\" (v. 24)**: The Greek θεωρῶσιν means more than casual seeing—it implies contemplative viewing, sustained observation, or beholding with understanding. It's the root of our word \"theory\" (contemplation of truth).\n\n**\"Before the foundation of the world\" (v. 24)**: The Greek πρὸ καταβολῆς κόσμου is a technical phrase meaning before creation's beginning. Καταβολή literally means \"laying down\" or \"founding,\" hence \"foundation.\"\n\n**Repetition of \"you sent me\"**: This phrase (σύ με ἀπέστειλας) appears repeatedly (vv. 3, 8, 18, 21, 23, 25) as a central theme. The consistency has been preserved to maintain the rhetorical emphasis on Jesus's mission as rooted in the Father's sending."
    },
    {
      "chapter": 18,
      "verses": [
        {
          "verse": 1,
          "text": "After saying these things, Jesus went out with his disciples across the Kidron ravine, where there was a garden, and he and his disciples entered it.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Now Judas, who was betraying him, also knew the place, because Jesus had often gathered there with his disciples.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "So Judas, having received the cohort and officers from the chief priests and from the Pharisees, comes there with torches, lanterns, and weapons.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Then Jesus, knowing everything that was coming upon him, went out and says to them, \"Who are you looking for?\"",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "They answered him, \"Jesus the Nazorean.\" He says to them, \"I am.\" Now Judas, who was betraying him, was also standing with them.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "So when he said to them, \"I am,\" they drew back and fell to the ground.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Again, then, he asked them, \"Who are you looking for?\" And they said, \"Jesus the Nazorean.\"",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Jesus answered, \"I told you that I am. So if you are looking for me, let these men go\"—",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "so that the word he had spoken might be fulfilled: \"Of those you have given me, I have not lost a single one of them.\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Then Simon Peter, who had a sword, drew it and struck the high priest's slave and cut off his right ear. The slave's name was Malchus.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "So Jesus said to Peter, \"Put the sword into its sheath. The cup that the Father has given me—shall I not drink it?\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Then the cohort, the tribune, and the officers of the Jews seized Jesus and bound him,",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "and they led him first to Annas, for he was the father-in-law of Caiaphas, who was high priest that year.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Now Caiaphas was the one who had advised the Jews that it was expedient for one man to die on behalf of the people.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Simon Peter was following Jesus, and so was another disciple. That disciple was known to the high priest and entered with Jesus into the high priest's courtyard,",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "but Peter was standing outside at the door. So the other disciple, the one known to the high priest, went out and spoke to the doorkeeper and brought Peter in.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Then the servant-girl who was the doorkeeper says to Peter, \"You're not also one of this man's disciples, are you?\" He says, \"I am not.\"",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Now the slaves and the officers were standing around a charcoal fire they had made, because it was cold, and they were warming themselves. Peter was also with them, standing and warming himself.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "The high priest then questioned Jesus about his disciples and about his teaching.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Jesus answered him, \"I have spoken openly to the world. I have always taught in synagogue and in the temple, where all the Jews gather together, and I have said nothing in secret.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Why do you question me? Question those who have heard what I said to them. Look—these people know what I said.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "When he said these things, one of the officers standing nearby gave Jesus a slap, saying, \"Is this how you answer the high priest?\"",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "Jesus answered him, \"If I have spoken wrongly, testify about what is wrong. But if I have spoken rightly, why do you strike me?\"",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Then Annas sent him, still bound, to Caiaphas the high priest.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "Now Simon Peter was standing and warming himself. So they said to him, \"You're not also one of his disciples, are you?\" He denied it and said, \"I am not.\"",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "One of the high priest's slaves, a relative of the man whose ear Peter had cut off, says, \"Didn't I see you in the garden with him?\"",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "Again, then, Peter denied it, and immediately a rooster crowed.",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "Then they lead Jesus from Caiaphas to the praetorium. It was early morning. They themselves did not enter the praetorium, so that they would not be defiled but could eat the Passover.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "So Pilate came out to them and says, \"What accusation do you bring against this man?\"",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "They answered and said to him, \"If this man were not doing evil, we would not have handed him over to you.\"",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "Then Pilate said to them, \"Take him yourselves and judge him according to your law.\" The Jews said to him, \"It is not lawful for us to execute anyone\"—",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "so that the word of Jesus might be fulfilled that he had spoken, indicating by what kind of death he was going to die.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "So Pilate entered the praetorium again and summoned Jesus and said to him, \"Are you the King of the Jews?\"",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "Jesus answered, \"Are you saying this on your own, or did others tell you about me?\"",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "Pilate answered, \"I'm not a Jew, am I? Your own nation and the chief priests handed you over to me. What have you done?\"",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "Jesus answered, \"My kingdom is not from this world. If my kingdom were from this world, my servants would have been fighting to prevent me from being handed over to the Jews. But as it is, my kingdom is not from here.\"",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "Then Pilate said to him, \"So you are a king?\" Jesus answered, \"You say that I am a king. For this I was born, and for this I have come into the world: to bear witness to the truth. Everyone who is from the truth hears my voice.\"",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "Pilate says to him, \"What is truth?\" After saying this, he went out again to the Jews and says to them, \"I find no case against him.",
          "paragraphStart": true
        },
        {
          "verse": 39,
          "text": "But you have a custom that I release one man for you at the Passover. So do you want me to release for you the King of the Jews?\"",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "Then they shouted back, saying, \"Not this man, but Barabbas!\" Now Barabbas was a bandit.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Kidron ravine\" (v. 1)**: The Greek χείμαρρος refers specifically to a wadi or ravine that flows with winter rains but is often dry. \"Brook\" or \"stream\" (common in traditional translations) misses this seasonal character. The Kidron is a ravine east of Jerusalem.\n\n**\"I am\" (vv. 5, 6, 8)**: The Greek ἐγώ εἰμι carries deliberate theological weight in John's Gospel, echoing the divine name from Exodus 3:14 (LXX). The dramatic response in v. 6—falling to the ground—suggests the recognition of divine presence. While \"It is I\" is grammatically possible, the absolute \"I am\" preserves the echo of divine self-identification that John's first audience would have heard.\n\n**\"Cohort\" (vv. 3, 12)**: The Greek σπεῖρα is a Roman military term for a cohort, normally 600 soldiers (or more loosely, a detachment). This is not a small arresting party but a significant military force, emphasizing the perceived threat Jesus posed.\n\n**\"Tribune\" (v. 12)**: The χιλίαρχος is the Roman military officer commanding a cohort, typically translated \"commander\" or \"captain,\" but \"tribune\" is the more precise technical term.\n\n**\"Nazorean\" (vv. 5, 7)**: The Greek Ναζωραῖος is rendered here as \"Nazorean\" rather than \"Nazarene\" to preserve its more formal, possibly titular quality in John's usage (as opposed to the more common Ναζαρηνός).\n\n**\"The word he had spoken\" (v. 9)**: John refers back to Jesus's prayer in 17:12. This is an internal fulfillment within the Gospel narrative itself, not a citation of Hebrew Scripture.\n\n**\"Expedient\" (v. 14)**: The Greek συμφέρει means \"it is advantageous, expedient, beneficial\"—a calculated political judgment, not a moral or theological necessity. This preserves Caiaphas's pragmatic reasoning (see 11:50).\n\n**\"Servant-girl who was the doorkeeper\" (v. 17)**: The Greek παιδίσκη ἡ θυρωρός specifies both her gender (female servant) and role (doorkeeper/gatekeeper). This detail matters for the narrative—Peter is challenged by someone of low social status.\n\n**\"Praetorium\" (vv. 28, 33)**: The Greek πραιτώριον (Latin loanword) refers to the Roman governor's headquarters/residence. Left untranslated as a technical term, like other Roman administrative vocabulary.\n\n**\"So that they would not be defiled\" (v. 28)**: The concern is ritual purity to eat the Passover meal. Entering a Gentile residence would convey impurity. John's chronology places Jesus's crucifixion on the day of Passover preparation, when the lambs were slaughtered—making Jesus the Passover lamb.\n\n**\"Are you saying this on your own\" (v. 34)**: Literally \"from yourself\"—Jesus asks whether Pilate's question originates from his own assessment or from what he has been told by the Jewish authorities.\n\n**\"From this world\" / \"from here\" (v. 36)**: The Greek ἐκ with genitive indicates origin or source. Jesus's kingdom has a different origin than earthly political kingdoms—it does not derive its nature or authority from the present world system.\n\n**\"You say that I am a king\" (v. 37)**: This can be understood as affirmation (\"You are correct in saying...\") rather than evasion. The following sentence confirms Jesus's kingship but redefines it in terms of witness to truth.\n\n**\"Bandit\" (v. 40)**: The Greek λῃστής can mean robber, bandit, or revolutionary/insurrectionist. Given the Roman context and Pilate's involvement, Barabbas was likely involved in violent resistance against Rome—more than a mere thief."
    },
    {
      "chapter": 19,
      "verses": [
        {
          "verse": 1,
          "text": "Then Pilate took Jesus and had him flogged.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "The soldiers wove a crown out of thorns and placed it on his head, and they threw a purple robe around him.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "They kept coming up to him and saying, \"Hail, King of the Jews!\"—and they struck him with their hands.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Pilate came out again and said to them, \"Look, I am bringing him out to you so that you may know I find no basis for a charge against him.\"",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "So Jesus came out, wearing the thorn crown and the purple robe. And Pilate said to them, \"Look—the man!\"",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "When the chief priests and the temple guards saw him, they shouted, \"Crucify him! Crucify him!\" Pilate said to them, \"You take him and crucify him. I find no basis for a charge against him.\"",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "The Judean authorities answered him, \"We have a law, and according to that law he must die, because he made himself the Son of God.\"",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "When Pilate heard this statement, he became even more afraid.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "He went back into the praetorium and said to Jesus, \"Where are you from?\" But Jesus gave him no answer.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "So Pilate said to him, \"You will not speak to me? Do you not know that I have authority to release you and I have authority to crucify you?\"",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "Jesus answered, \"You would have no authority over me at all unless it had been given to you from above. Therefore the one who handed me over to you has the greater sin.\"",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "From that moment on, Pilate kept trying to release him. But the Judean authorities shouted, \"If you release this man, you are no friend of Caesar! Everyone who makes himself a king sets himself against Caesar!\"",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "When Pilate heard these words, he brought Jesus outside and sat down on the judgment seat at a place called the Stone Pavement—in Hebrew, Gabbatha.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "It was the day of Preparation for Passover, about the sixth hour. He said to the Judeans, \"Look—your king!\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "They shouted back, \"Away with him! Away with him! Crucify him!\" Pilate said to them, \"Should I crucify your king?\" The chief priests answered, \"We have no king but Caesar!\"",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "So then he handed him over to them to be crucified. They took Jesus,",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "and carrying the cross for himself, he went out to what is called the Place of the Skull, which in Hebrew is called Golgotha.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "There they crucified him, and with him two others—one on each side, with Jesus in the middle.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Pilate also had an inscription written and placed on the cross. It read: \"Jesus the Nazorean, the King of the Judeans.\"",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Many of the Judeans read this inscription, because the place where Jesus was crucified was near the city, and it was written in Hebrew, in Latin, and in Greek.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "So the chief priests of the Judeans said to Pilate, \"Do not write 'The King of the Judeans,' but rather 'This man said, I am King of the Judeans.'\"",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "Pilate answered, \"What I have written, I have written.\"",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "When the soldiers crucified Jesus, they took his clothing and divided it into four shares, one share for each soldier. They also took the tunic, but the tunic was seamless, woven in one piece from top to bottom.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "So they said to one another, \"Let us not tear it, but cast lots for it to see who will get it\"—so that the scripture might be fulfilled that says, *They divided my garments among themselves, and for my clothing they cast lots.* This is what the soldiers did.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Standing near the cross of Jesus were his mother, his mother's sister, Mary the wife of Clopas, and Mary Magdalene.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "When Jesus saw his mother and the disciple whom he loved standing nearby, he said to his mother, \"Woman, look—your son.\"",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Then he said to the disciple, \"Look—your mother.\" And from that hour the disciple took her into his own home.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "After this, Jesus, knowing that everything was now completed in order that the scripture might be brought to its fulfillment, said, \"I thirst.\"",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "A jar full of sour wine was standing there, so they put a sponge soaked with the sour wine on a hyssop branch and brought it to his mouth.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "When Jesus had received the sour wine, he said, \"It is completed.\" And he bowed his head and gave up his spirit.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Since it was the day of Preparation, the Judean authorities asked Pilate to have the legs broken and the bodies taken down, so that the bodies would not remain on the cross during the Sabbath—for that Sabbath was a high day.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "So the soldiers came and broke the legs of the first man and of the other who had been crucified with him.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "But when they came to Jesus and saw that he was already dead, they did not break his legs.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Instead, one of the soldiers pierced his side with a spear, and immediately blood and water came out.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "The one who saw this has testified, and his testimony is true, and he knows that he speaks the truth, so that you also may believe.",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "For these things happened so that the scripture would be fulfilled: *Not one of his bones shall be broken.*",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "And again another scripture says, *They shall look on the one whom they have pierced.*",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "After these things, Joseph from Arimathea, who was a disciple of Jesus but secretly because of his fear of the Judean authorities, asked Pilate if he could take away the body of Jesus. Pilate gave permission, so he came and took his body.",
          "paragraphStart": true
        },
        {
          "verse": 39,
          "text": "Nicodemus also came—the one who had first come to him at night—bringing a mixture of myrrh and aloes, about a hundred pounds.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "So they took the body of Jesus and wrapped it in linen cloths with the spices, according to the burial custom of the Judeans.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "Now in the place where he was crucified there was a garden, and in the garden a new tomb in which no one had ever been laid.",
          "paragraphStart": true
        },
        {
          "verse": 42,
          "text": "So because it was the Judean day of Preparation, and because the tomb was nearby, they laid Jesus there.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The Judeans\" vs. \"the Jews\"**: The Greek Ἰουδαῖοι presents a well-known translation challenge. In John's Gospel, it often refers not to Jewish people generally but to the Judean religious authorities (centered in Jerusalem) who oppose Jesus. \"Judeans\" preserves both the geographical specificity and the institutional power dynamics. Where the term clearly means ethnic/religious identity broadly (as in v. 40, \"burial custom\"), \"Judean\" still works since Jesus himself was Judean/Jewish. The alternative \"the Jews\" is both anachronistic (Judaism as we know it post-dates the Second Temple period) and has contributed to centuries of anti-Semitism.\n\n**\"The Nazorean\" (v. 19)**: Ναζωραῖος rather than the more common Ναζαρηνός. Both mean \"from Nazareth,\" but Nazorean is the specific form Pilate's inscription uses. The distinction may reflect official Roman nomenclature.\n\n**\"It is completed\" (v. 30)**: Τετέλεσται is the perfect tense of τελέω—to complete, to accomplish, to bring to fulfillment. This is not merely \"it is finished\" in the sense of being over, but rather \"it has been accomplished/brought to completion.\" The perfect tense emphasizes the completed state with ongoing significance. This saying echoes the language of v. 28 (τετέλεσται/τελειωθῇ) and frames Jesus's death as the completion of his mission and the fulfillment of scripture.\n\n**\"Gave up his spirit\" (v. 30)**: παρέδωκεν τὸ πνεῦμα could be rendered \"handed over the spirit\" or \"delivered up the spirit.\" The verb παραδίδωμι (to hand over, deliver, betray) has been used throughout the passion narrative for Judas's betrayal and the handing over of Jesus to the authorities. Here Jesus himself actively \"hands over\" his spirit—a final sovereign act.\n\n**\"The sixth hour\" (v. 14)**: This is approximately noon by Roman reckoning (counting from midnight), though some scholars suggest John uses Jewish reckoning (from dawn), which would make it around 6 AM. The chronology differs from the Synoptic accounts. I've left it as \"sixth hour\" to preserve the ambiguity in the original.\n\n**\"High day\" (v. 31)**: μεγάλη ἡ ἡμέρα—literally \"that day was great.\" This Sabbath was particularly significant because it coincided with Passover.\n\n**\"Hyssop\" (v. 29)**: ὑσσώπῳ. This is likely an allusion to Exodus 12:22, where hyssop is used to apply the Passover lamb's blood to the doorposts. John presents Jesus as the true Passover lamb throughout this Gospel.\n\n**\"One of his bones shall be broken\" (v. 36)**: This fulfills both Exodus 12:46 (Passover lamb regulation) and Psalm 34:20. John consistently presents Jesus as the Passover lamb whose sacrifice brings deliverance.\n\n**\"They shall look on the one whom they have pierced\" (v. 37)**: From Zechariah 12:10. The verb ἐξεκέντησαν specifically means to pierce through, matching the spear thrust of v. 34.\n\n**\"A hundred pounds\" (v. 39)**: λίτρας ἑκατόν—about 75 pounds in modern measurement. This is an extraordinary amount of spices, fitting for a royal burial and signaling Jesus's true kingship."
    },
    {
      "chapter": 20,
      "verses": [
        {
          "verse": 1,
          "text": "On the first day of the week, Mary the Magdalene comes to the tomb early while it was still dark, and she sees the stone having been removed from the tomb.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "So she runs and comes to Simon Peter and to the other disciple whom Jesus loved, and says to them, \"They have taken the Lord out of the tomb, and we do not know where they have laid him.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "So Peter and the other disciple went out and were making their way toward the tomb.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "The two were running together, but the other disciple ran ahead faster than Peter and arrived at the tomb first.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And stooping to look in, he sees the linen cloths lying there, but he did not go in.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Then Simon Peter also comes, following him, and he entered into the tomb. And he observes the linen cloths lying there,",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "and the face cloth, which had been on his head, not lying with the linen cloths but rolled up in a place by itself.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Then the other disciple, who had arrived at the tomb first, also entered, and he saw and believed.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For they did not yet understand the scripture, that it was necessary for him to rise from the dead.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "So the disciples went back home again.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "But Mary stood outside the tomb weeping. As she wept, she stooped to look into the tomb,",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "and she observes two angels in white, seated one at the head and one at the feet where the body of Jesus had been lying.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And they say to her, \"Woman, why are you weeping?\" She says to them, \"They have taken my Lord, and I do not know where they have laid him.\"",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Having said these things, she turned back around and observes Jesus standing there, but she did not know that it was Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "Jesus says to her, \"Woman, why are you weeping? Whom are you seeking?\" She, supposing that he is the gardener, says to him, \"Sir, if you are the one who carried him away, tell me where you have laid him, and I will take him away.\"",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Jesus says to her, \"Mary.\" Turning, she says to him in Hebrew, \"Rabbouni\"—which means Teacher.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Jesus says to her, \"Do not cling to me, for I have not yet ascended to the Father. But go to my brothers and tell them: 'I am ascending to my Father and your Father, and my God and your God.'\"",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Mary the Magdalene comes announcing to the disciples, \"I have seen the Lord,\" and that he had said these things to her.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "When it was evening on that day, the first day of the week, and the doors having been locked where the disciples were because of fear of the Jewish authorities, Jesus came and stood in their midst and says to them, \"Peace to you.\"",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "And having said this, he showed them his hands and his side. So the disciples rejoiced when they saw the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Jesus said to them again, \"Peace to you. Just as the Father has sent me, so I am sending you.\"",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "And having said this, he breathed on them and says to them, \"Receive the Holy Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "If you forgive the sins of any, they have been forgiven them. If you retain the sins of any, they have been retained.\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Now Thomas, one of the twelve, who is called the Twin, was not with them when Jesus came.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "So the other disciples were saying to him, \"We have seen the Lord.\" But he said to them, \"Unless I see in his hands the mark of the nails, and put my finger into the mark of the nails, and put my hand into his side, I will never believe.\"",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "And after eight days, his disciples were inside again, and Thomas was with them. Jesus comes, the doors having been locked, and stood in their midst and said, \"Peace to you.\"",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "Then he says to Thomas, \"Bring your finger here and see my hands, and bring your hand and put it into my side, and do not become unbelieving but believing.\"",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Thomas answered and said to him, \"My Lord and my God!\"",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Jesus says to him, \"Because you have seen me, you have believed? Blessed are those who have not seen and yet have believed.\"",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "Now Jesus did many other signs in the presence of the disciples, which are not written in this book.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "But these have been written so that you may believe that Jesus is the Christ, the Son of God, and so that by believing you may have life in his name.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The first day of the week\" (v. 1, 19)**: The Greek τῇ μιᾷ τῶν σαββάτων is literally \"on the one of the sabbaths,\" a Semitic idiom for the first day of the week (Sunday). I've rendered it idiomatically in English.\n\n**\"The other disciple whom Jesus loved\" (v. 2)**: The verb φιλέω here denotes affectionate friendship, distinct from ἀγαπάω (though John uses both). I've rendered it as \"loved\" to match English conventions, though \"held dear\" captures the warmth of φιλέω.\n\n**\"We do not know\" (v. 2)**: Mary uses the plural \"we,\" though she apparently came alone. This may reflect her speaking for the larger community of disciples, or it may be a colloquial use of the plural.\n\n**\"Observes\" vs. \"sees\" (various verses)**: I've distinguished between βλέπω (simple seeing) and θεωρέω (observing, examining closely). In verse 6, Peter \"observes\" (θεωρεῖ) the cloths, suggesting careful examination. In verse 8, the beloved disciple \"saw\" (εἶδεν, from ὁράω) and believed—a perception that goes beyond physical sight.\n\n**\"Do not cling to me\" (v. 17)**: The Greek μή μου ἅπτου is a present imperative with negative particle, typically meaning \"stop doing something already in progress.\" Mary is already touching or holding Jesus, and he tells her to stop. The verb ἅπτομαι can mean simply \"touch,\" but the present tense suggests a continuing action—she is holding on to him. \"Cling\" captures this better than the traditional \"touch.\"\n\n**\"I have not yet ascended\" (v. 17)**: The Greek ἀναβέβηκα is perfect tense, emphasizing the completed state. Jesus hasn't yet completed his ascension to the Father, which explains why Mary should not cling to him—this is not the final reunion but a transitional moment.\n\n**\"The Jewish authorities\" (v. 19)**: The Greek τῶν Ἰουδαίων literally means \"the Jews,\" but in John's Gospel this phrase typically refers to the religious leadership hostile to Jesus, not to Jewish people generally (since Jesus and all his disciples were themselves Jewish). Given the historical misuse of this phrase to fuel antisemitism, \"the Jewish authorities\" clarifies John's meaning for modern readers without distorting the text.\n\n**\"The Twin\" (v. 24)**: Δίδυμος is the Greek word for twin. The Aramaic \"Thomas\" (תאומא) also means twin, so this is actually a translation within the text: \"Thomas, who is called 'the Twin' (in Greek).\"\n\n**\"You have believed?\" (v. 29)**: I've rendered this as a question following the most natural reading of the Greek syntax. Jesus is gently challenging Thomas: his belief came through seeing. The blessing that follows honors those who believe without such evidence.\n\n**\"So that you may believe\" (v. 31)**: Some manuscripts read the aorist subjunctive πιστεύσητε (come to believe), others the present subjunctive πιστεύητε (continue believing). The SBLGNT follows the present, suggesting the text addresses those already within the community, encouraging ongoing faith. Either way, the purpose of the Gospel is clearly evangelistic and pastoral."
    },
    {
      "chapter": 21,
      "verses": [
        {
          "verse": 1,
          "text": "After these things, Jesus revealed himself again to the disciples at the Sea of Tiberias. This is how he revealed himself:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Simon Peter, Thomas called the Twin, Nathanael from Cana in Galilee, the sons of Zebedee, and two others of his disciples were together.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "Simon Peter said to them, \"I'm going fishing.\" They said to him, \"We're coming with you too.\" They went out and got into the boat, and that night they caught nothing.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Just as dawn was breaking, Jesus stood on the shore—though the disciples did not know that it was Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "So Jesus said to them, \"Children, you don't have any fish to eat, do you?\" They answered him, \"No.\"",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "He said to them, \"Cast the net on the right side of the boat, and you will find some.\" So they cast it, and they no longer had strength to haul it in because of the multitude of fish.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Then that disciple whom Jesus loved said to Peter, \"It is the Lord!\" When Simon Peter heard that it was the Lord, he wrapped his outer garment around himself—for he was stripped down—and threw himself into the sea.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "The other disciples came in the small boat, dragging the net full of fish, for they were not far from the land, only about two hundred cubits.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "When they climbed out onto the land, they saw a charcoal fire laid there, with fish laid on it, and bread.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Jesus said to them, \"Bring some of the fish you have just caught.\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Simon Peter went up and dragged the net onto the land, full of large fish—one hundred fifty-three of them. And even though there were so many, the net was not torn.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Jesus said to them, \"Come, have breakfast.\" None of the disciples dared to question him, \"Who are you?\"—knowing that it was the Lord.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Jesus came and took the bread and gave it to them, and the fish likewise.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "This was now the third time Jesus revealed himself to the disciples after being raised from the dead.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "When they had finished breakfast, Jesus said to Simon Peter, \"Simon son of John, do you love me more than these?\" He said to him, \"Yes, Lord, you know that I love you.\" He said to him, \"Feed my lambs.\"",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "He said to him a second time, \"Simon son of John, do you love me?\" He said to him, \"Yes, Lord, you know that I love you.\" He said to him, \"Shepherd my sheep.\"",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "He said to him the third time, \"Simon son of John, do you love me?\" Peter was grieved that he said to him the third time, \"Do you love me?\" And he said to him, \"Lord, you know all things; you understand that I love me.\" Jesus said to him, \"Feed my sheep.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Truly, truly I tell you: when you were younger, you fastened your own belt and walked wherever you wished. But when you grow old, you will stretch out your hands, and another will fasten your belt and carry you where you do not wish.\"",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "Now he said this to indicate by what kind of death he would glorify God. And having said this, he said to him, \"Follow me.\"",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Peter turned and saw the disciple whom Jesus loved following—the one who had reclined against his chest at the supper and had said, \"Lord, who is the one betraying you?\"",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "Seeing him, Peter said to Jesus, \"Lord, what about this man?\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Jesus said to him, \"If I want him to remain until I come, what is that to you? You follow me.\"",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "So this word went out among the brothers that that disciple would not die. Yet Jesus did not say to him that he would not die, but rather, \"If I want him to remain until I come, what is that to you?\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "This is the disciple who is bearing witness about these things and who wrote these things, and we know that his witness is true.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "But there are also many other things that Jesus did, which if they were written down one by one, I do not think the world itself could contain the books that would be written.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Children\" (v. 5)**: The Greek παιδία is a term of affection—not \"boys\" or diminutive in a condescending sense, but warm and familial. Jesus addresses them as a parent or teacher might address beloved young people.\n\n**\"Fish to eat\" (v. 5)**: The Greek προσφάγιον specifically means something eaten with bread—typically fish. The question is not merely \"do you have fish?\" but \"do you have any food/fish?\"—reflecting the post-fishing expectation of having something to eat. This is more colloquial than \"have you caught anything?\"\n\n**\"Stripped down\" (v. 7)**: The Greek γυμνός doesn't mean completely naked but rather minimally clothed for work—likely wearing only an undergarment. Peter puts on his outer garment (ἐπενδύτην) before jumping into the water, which would have been the culturally appropriate thing to do before greeting the Lord.\n\n**\"Two hundred cubits\" (v. 8)**: About 100 yards or 90 meters—a short distance from shore.\n\n**\"Charcoal fire\" (v. 9)**: The Greek ἀνθρακιάν is specific—a charcoal fire, not just any fire. This is the only other place in the New Testament besides John 18:18 where this word appears (where Peter was warming himself and denying Jesus). The echo would have been clear to the original audience.\n\n**Love terminology (vv. 15-17)**: The Greek alternates between ἀγαπάω (vv. 15-16, Jesus's question) and φιλέω (Peter's response in all three, and Jesus's third question). Much has been made of this distinction, but in Koine Greek and especially in Johannine usage, these terms substantially overlap and can be near-synonyms. The variation may be stylistic rather than indicating different types of love. I've rendered both as \"love\" to avoid imposing a modern distinction the Greek may not support. The grief Peter experiences (v. 17) comes from being asked three times—echoing his three denials—not necessarily from a shift in vocabulary.\n\n**\"You understand\" (v. 17)**: Peter shifts from οἶδας (intuitive knowledge) to γινώσκεις (experiential knowledge)—\"you understand\" captures both the progression and the emphasis: Jesus knows Peter's heart from direct insight.\n\n**\"Follow me\" (vv. 19, 22)**: The present imperative ἀκολούθει carries the sense of continuing, ongoing action—\"keep following me\" or \"be my follower\"—but the simpler \"follow me\" preserves the directness and echo of the initial call.\n\n**\"Brothers\" (v. 23)**: The Greek ἀδελφούς refers to the community of believers, both male and female. While the grammatical form is masculine plural (which includes mixed groups), \"brothers\" here functions as a community designation rather than gender-specific language.\n\n**\"We know\" (v. 24)**: The shift to first-person plural indicates the Johannine community authenticating the beloved disciple's testimony. This is an editorial note from the community, not the beloved disciple's own voice."
    }
  ]
}
