{
  "book": "Jude",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "From Jude, a slave of Jesus Christ and a brother of James, to those who have been called, who are loved in God the Father and kept for Jesus Christ:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "May mercy, peace, and love be lavished upon you.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Beloved, while I was making every effort to write to you about our shared salvation, I felt compelled to write and urge you to contend for the faith that was once for all delivered to the holy ones.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "For certain people have slipped in unnoticed—individuals who were long ago designated for this condemnation. They are ungodly people who pervert the grace of our God into a license for debauchery and deny our only Master and Lord, Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "I want to remind you, although you are fully aware of all this, that Jesus, having once saved a people out of the land of Egypt, afterward destroyed those who did not believe.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "And the angels who did not stay within their own domain of authority but abandoned their proper dwelling place, he has kept in eternal chains under murky darkness for the judgment of the great day.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Likewise, Sodom and Gomorrah and the surrounding cities, which indulged in sexual immorality and pursued unnatural flesh in the same way as these angels, stand as an example by undergoing the punishment of eternal fire.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "In the same way, these people, fueled by their dreams, defile the flesh, reject lordship, and slander angelic majesties.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Yet even Michael the archangel, when he was disputing with the devil and arguing about the body of Moses, did not dare to bring a slanderous judgment against him, but said, \"May the Lord rebuke you!\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "But these people slander whatever they do not understand, and whatever they do know instinctively, like irrational animals, by these very things they are destroyed.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Woe to them! For they have walked in the way of Cain, they have abandoned themselves to the error of Balaam for the sake of profit, and they have perished in Korah’s rebellion.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "These people are hidden reefs at your love-feasts, feasting with you without fear, shepherding only themselves. They are waterless clouds carried along by winds; fruitless trees in late autumn, twice dead and uprooted;",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "wild waves of the sea, foaming up their own shame; wandering stars, for whom the murky gloom of darkness has been reserved forever.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Enoch, the seventh from Adam, also prophesied about these people, saying: \"Look! The Lord came with myriads of his holy ones",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "to execute judgment against everyone and to convict all the ungodly concerning all their ungodly deeds which they have committed in such an ungodly way, and concerning all the harsh things that ungodly sinners have spoken against him.\"",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "These people are grumblers and fault-finders who follow their own desires; their mouths speak arrogant bombsat, and they flatter people to gain an advantage.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "But you, beloved, must remember the words previously spoken by the apostles of our Lord Jesus Christ.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "They said to you, \"In the last time there will be mockers following their own ungodly desires.\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "These are the people who cause divisions—merely natural people, devoid of the Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "But you, beloved, building yourselves up on your most holy faith and praying in the Holy Spirit,",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "keep yourselves in the love of God as you wait for the mercy of our Lord Jesus Christ, which leads to eternal life.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Have mercy on those who are wavering;",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "save others by snatching them out of the fire; and to others show mercy mixed with fear, hating even the tunic stained by the flesh.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Now to him who is able to keep you from stumbling and to make you stand before his glory blameless and with great joy—",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "to the only God our Savior, through Jesus Christ our Lord, be glory, majesty, power, and authority, before all time and now and for all eternity. Amen.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Slave\" (v. 1)**: The Greek *doulos* is often softened to \"servant,\" but in the first century, it denoted a person owned by a master. Used as a title for Jude, it signals total subjection to the messianic King, echoing the \"Slave of Yahweh\" motif from the Hebrew Scriptures.\n\n**\"Kept\" (v. 1, 6, 13, 21)**: The author uses a \"keeping\" motif (*tēreō*) throughout the letter. Believers are \"kept\" by/for Jesus (v. 1); fallen angels are \"kept\" in chains (v. 6); darkness is \"kept\" for the false teachers (v. 13); and believers are commanded to \"keep\" themselves in God's love (v. 21).\n\n**\"Jesus... saved a people out of Egypt\" (v. 5)**: While many later manuscripts read \"the Lord,\" the earliest and best manuscripts (including the SBLGNT basis) read *Iēsous* (Jesus). This reflects an early Christian \"High Christology\" where the pre-existent Jesus is identified with the Yahweh of the Exodus.\n\n**\"Domain of authority\" (v. 6)**: The Greek *archē* refers to the status or sphere of influence assigned to the angels. This, along with the \"unnatural flesh\" in v. 7, alludes to the tradition found in the Book of Enoch regarding the \"Watchers\" who crossed the boundary between the heavenly and earthly realms.\n\n**\"Angelic majesties\" (v. 8)**: The Greek *doxas* (literally \"glories\") refers to celestial or angelic beings. The intruders are criticized for showing less respect to supernatural powers than even the archangel Michael did.\n\n**\"Hidden reefs\" (v. 12)**: *Spilades* can mean \"spots/blemishes\" (as in 2 Peter 2:13), but in a nautical context, it refers to jagged rocks just beneath the surface of the water. This fits the subsequent imagery of clouds, trees, and waves, suggesting these people are a hidden danger that can shipwreck the community's fellowship.\n\n**\"Shepherding only themselves\" (v. 12)**: A biting irony. While they should be shepherds of the flock, they use the community solely to \"feed\" or \"pasture\" themselves (*poimainontes*).\n\n**\"Wandering stars\" (v. 13)**: In the ancient world, \"planets\" (*planētai*) were \"wandering stars.\" In the apocalyptic tradition Jude cites, stars often represent angels; \"wandering\" implies they have left their ordained course (rebellion).\n\n**\"Merely natural people\" (v. 19)**: The Greek *psychikoi* refers to those governed by the *psychē* (the natural soul/instincts) as opposed to the *pneuma* (the Spirit). They operate on a purely horizontal, animalistic level despite their claims to higher spiritual knowledge.\n\n**\"Tunic stained by the flesh\" (v. 23)**: The *chitōn* was the garment worn closest to the body. The imagery suggests that the corruption of these individuals is so pervasive that even their \"undergarments\" are contaminated, requiring extreme caution from those attempting to rescue them."
    }
  ]
}