{
  "book": "Matthew",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "The record of the origin of Jesus the Messiah, son of David, son of Abraham.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Abraham fathered Isaac, Isaac fathered Jacob, Jacob fathered Judah and his brothers,",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "Judah fathered Perez and Zerah by Tamar, Perez fathered Hezron, Hezron fathered Ram,",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Ram fathered Amminadab, Amminadab fathered Nahshon, Nahshon fathered Salmon,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Salmon fathered Boaz by Rahab, Boaz fathered Obed by Ruth, Obed fathered Jesse,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "and Jesse fathered David the king. David fathered Solomon by the wife of Uriah,",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Solomon fathered Rehoboam, Rehoboam fathered Abijah, Abijah fathered Asaph,",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Asaph fathered Jehoshaphat, Jehoshaphat fathered Joram, Joram fathered Uzziah,",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Uzziah fathered Jotham, Jotham fathered Ahaz, Ahaz fathered Hezekiah,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Hezekiah fathered Manasseh, Manasseh fathered Amos, Amos fathered Josiah,",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "and Josiah fathered Jeconiah and his brothers at the time of the deportation to Babylon.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "After the deportation to Babylon, Jeconiah fathered Shealtiel, Shealtiel fathered Zerubbabel,",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Zerubbabel fathered Abiud, Abiud fathered Eliakim, Eliakim fathered Azor,",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Azor fathered Zadok, Zadok fathered Achim, Achim fathered Eliud,",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Eliud fathered Eleazar, Eleazar fathered Matthan, Matthan fathered Jacob,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "and Jacob fathered Joseph the husband of Mary, from whom was born Jesus, the one called the Messiah.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "So all the generations from Abraham to David are fourteen generations, from David to the deportation to Babylon fourteen generations, and from the deportation to Babylon to the Messiah fourteen generations.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Now the origin of Jesus the Messiah came about this way: When his mother Mary had been betrothed to Joseph, before they came together she was found to be carrying a child from the Holy Spirit.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "But Joseph her husband, being a righteous man and not wanting to expose her to public disgrace, resolved to divorce her quietly.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "While he was considering these things, look—an angel of the Lord appeared to him in a dream, saying, \"Joseph, son of David, do not be afraid to take Mary as your wife, for what has been conceived in her is from the Holy Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "She will bear a son, and you shall call his name Jesus, for he will save his people from their sins.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "All this took place so that what was spoken by the Lord through the prophet might be fulfilled:",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "\"Look, the virgin will conceive and bear a son, and they will call his name Emmanuel\"—which translated means, \"God with us.\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "When Joseph rose from sleep, he did as the angel of the Lord commanded him and took his wife into his home,",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "but he did not know her until she bore a son. And he called his name Jesus.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Record of the origin\" (v. 1)**: The Greek βίβλος γενέσεως deliberately echoes Genesis 2:4 and 5:1 in the Septuagint. The word γένεσις means origin, beginning, or coming-into-being—not merely \"genealogy.\" Matthew signals that this is a new Genesis narrative. The same word recurs in v. 18, creating a frame: v. 1 introduces the record of Jesus's origin through his lineage, v. 18 introduces the story of his actual origin.\n\n**\"Messiah\" (vv. 1, 16, 17, 18)**: Greek χριστός translates Hebrew *mashiach* (anointed one). First-century readers understood this as a title denoting the expected Davidic king, not a personal name. Using \"Messiah\" rather than \"Christ\" recovers this.\n\n**\"The wife of Uriah\" (v. 6)**: The Greek pointedly does not name Bathsheba, calling her only τῆς τοῦ Οὐρίου—\"the [wife] of Uriah.\" This keeps David's adultery and murder in view.\n\n**\"Asaph\" and \"Amos\" (vv. 7-8, 10)**: The critical text reads Ἀσάφ and Ἀμώς rather than the expected \"Asa\" and \"Amon.\" These appear to be the names of the famous psalm-writer and prophet. Whether this reflects scribal error or Matthew's intentional wordplay linking the royal line to prophetic/musical figures remains debated; the translation follows the earliest manuscripts.\n\n**\"Betrothed\" (v. 18)**: Jewish betrothal was legally binding—the woman was already her husband's wife (hence ἀνήρ for Joseph in v. 19), though they had not yet cohabited. Ending a betrothal required formal divorce.\n\n**\"Did not know her\" (v. 25)**: This Semitic idiom for sexual relations (from Hebrew *yada*) is preserved here because it echoes the language of Genesis and carries a certain gravity that \"did not have relations with her\" lacks.\n\n**Verse 16's structural break**: Throughout the genealogy, the verb ἐγέννησεν (fathered) is active. At v. 16, the pattern breaks: Joseph is not said to have fathered Jesus. Instead, the passive ἐγεννήθη (was born) appears with a feminine relative pronoun (ἐξ ἧς) clearly referring to Mary. The grammar itself makes a theological claim about Jesus's conception."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "After Jesus was born in Bethlehem of Judea during the days of King Herod, suddenly magi from the east arrived in Jerusalem,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "asking, \"Where is the one who has been born king of the Jews? For we saw his star at its rising and have come to pay him homage.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "When King Herod heard this, he was deeply disturbed, and all Jerusalem with him.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Gathering together all the chief priests and scribes of the people, he inquired of them where the Messiah was to be born.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "They told him, \"In Bethlehem of Judea, for so it stands written through the prophet:",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "*And you, Bethlehem, land of Judah, are by no means least among the rulers of Judah; for from you will come forth a ruler who will shepherd my people Israel.*\"",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Then Herod secretly summoned the magi and determined from them precisely when the star had appeared.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Sending them to Bethlehem, he said, \"Go and search carefully for the child. When you find him, report back to me so that I too may come and pay him homage.\"",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "After hearing the king, they went on their way, and suddenly the star they had seen at its rising went ahead of them until it came and stood over the place where the child was.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "When they saw the star, they were overwhelmed with joy.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Coming into the house, they saw the child with Mary his mother, and falling down they paid him homage. Then, opening their treasure chests, they presented him with gifts: gold, frankincense, and myrrh.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And having been warned in a dream not to return to Herod, they departed for their own country by another road.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "After they had departed, suddenly an angel of the Lord appears to Joseph in a dream, saying, \"Rise, take the child and his mother, and flee to Egypt. Remain there until I tell you, for Herod is about to search for the child to destroy him.\"",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "So he rose, took the child and his mother by night, and withdrew to Egypt.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "He remained there until the death of Herod, so that what was spoken by the Lord through the prophet might be fulfilled: *Out of Egypt I called my son.*",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Then Herod, seeing that he had been outwitted by the magi, flew into a violent rage. He sent and killed all the boys in Bethlehem and in all its surrounding region who were two years old and under, according to the time he had determined precisely from the magi.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "Then what was spoken through Jeremiah the prophet was fulfilled:",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "*A voice was heard in Ramah, weeping and bitter lamentation—Rachel weeping for her children, and she would not be comforted, because they are no more.*",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "After Herod died, suddenly an angel of the Lord appears in a dream to Joseph in Egypt,",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "saying, \"Rise, take the child and his mother, and go to the land of Israel, for those who were seeking the child's life have died.\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "So he rose, took the child and his mother, and entered the land of Israel.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But hearing that Archelaus was reigning over Judea in place of his father Herod, he was afraid to go there. And having been warned in a dream, he withdrew to the region of Galilee.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "He went and settled in a town called Nazareth, so that what was spoken through the prophets might be fulfilled: \"He will be called a Nazorean.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Magi\" (v. 1, 7, 16)**: I retain \"magi\" rather than \"wise men\" because it more accurately identifies this specific class of Persian/Babylonian priest-scholars known for astrology and dream interpretation. The term carries cultural specificity that \"wise men\" loses.\n\n**\"At its rising\" (v. 2, 9)**: The singular ἐν τῇ ἀνατολῇ likely means \"at its rising\" (an astronomical term for a star's first appearance) rather than \"in the east\" (which uses the plural ἀπὸ ἀνατολῶν in v. 1). This reading fits the context of stargazers observing celestial phenomena.\n\n**\"Pay him homage\" (v. 2, 8, 11)**: The Greek προσκυνέω can mean either political homage to royalty or religious worship. Since the magi understand Jesus as \"king of the Jews\" (a political title), \"pay homage\" better captures the ambiguity—though Matthew's readers would understand a deeper significance.\n\n**\"Overwhelmed with joy\" (v. 10)**: The Greek ἐχάρησαν χαρὰν μεγάλην σφόδρα is a cognate accusative construction (\"they rejoiced with exceedingly great joy\")—a Semitic intensification pattern. \"Overwhelmed with joy\" attempts to convey this emphatic piling up of joy-language.\n\n**\"Appears\" (v. 13, 19)**: The historic present tense (φαίνεται) creates narrative vividness. I preserve this where it occurs.\n\n**\"Those who were seeking the child's life have died\" (v. 20)**: This echoes Exodus 4:19 (LXX), where God tells Moses \"those seeking your life have died.\" Matthew signals that Jesus is a new Moses figure returning from Egypt. The plural \"those\" may allude to this text even though only Herod is in view.\n\n**\"Nazorean\" (v. 23)**: I use \"Nazorean\" (from Ναζωραῖος) rather than \"Nazarene\" to preserve the ambiguity. Matthew cites \"the prophets\" (plural, unusually), suggesting a thematic fulfillment rather than a direct quotation. Scholars propose connections to Hebrew נֵצֶר (branch, Isaiah 11:1) or נָזִיר (Nazirite, or possibly \"separated/despised one\"). The wordplay is intentional and cannot be fully captured in translation.\n\n**\"So that...might be fulfilled\" vs. \"Then...was fulfilled\" (v. 15, 17)**: Matthew uses two different fulfillment formulas: ἵνα πληρωθῇ (purpose, v. 15, 23) and τότε ἐπληρώθη (result, v. 17). The massacre fulfillment lacks the purposive ἵνα, perhaps indicating Matthew saw this not as God's purpose but as tragic correspondence."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "In those days, John the Baptizer appears, proclaiming in the wilderness of Judea",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "and saying, \"Turn back! For the kingdom of the heavens has drawn near.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "This is the one spoken of through Isaiah the prophet, who said: \"A voice crying out in the wilderness: Prepare the way of the Lord, make his paths straight.\"",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Now John himself wore clothing made of camel's hair with a leather belt around his waist, and his food was locusts and wild honey.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "Then Jerusalem and all Judea and the whole region around the Jordan kept going out to him,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "and they were being baptized by him in the Jordan River as they openly confessed their sins.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "But when he saw many of the Pharisees and Sadducees coming to his baptism, he said to them, \"Brood of vipers! Who warned you to flee from the coming wrath?",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Produce fruit worthy of your turning,",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "and do not presume to say among yourselves, 'We have Abraham as our father.' For I tell you that God is able to raise up children for Abraham from these stones.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Already the axe is laid at the root of the trees. So every tree that does not produce good fruit is cut down and thrown into the fire.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "\"I baptize you in water for turning. But the one coming after me is more powerful than I—I am not fit to carry his sandals. He will baptize you in holy spirit and fire.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "His winnowing fork is in his hand, and he will thoroughly clean his threshing floor. He will gather his grain into the storehouse, but the chaff he will burn with unquenchable fire.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then Jesus arrives from Galilee at the Jordan, coming to John to be baptized by him.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "But John kept trying to prevent him, saying, \"I need to be baptized by you, and you are coming to me?\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "But Jesus answered him, \"Permit it for now, for in this way it is fitting for us to fulfill all righteousness.\" Then he permitted him.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "When Jesus had been baptized, he immediately came up from the water—and look: the heavens were opened, and he saw the Spirit of God descending like a dove, coming upon him.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "And look: a voice from the heavens, saying, \"This is my Son, the Beloved, in whom I delight.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Turn back\" / \"turning\" (vv. 2, 8, 11)**: The Greek μετανοέω/μετάνοια literally means \"change of mind,\" but in Jewish usage it carries the full weight of the Hebrew *teshuvah*—returning to God. Modern \"repent\" often implies mere remorse or regret. \"Turn back\" captures the directional, active sense: reorienting one's life toward God.\n\n**\"Has drawn near\" (v. 2)**: The perfect tense ἤγγικεν indicates completed action with ongoing results—the kingdom has arrived at the threshold and remains there. This is more urgent than the traditional \"is at hand.\"\n\n**\"Kingdom of the heavens\" (v. 2)**: Matthew consistently uses \"heavens\" (plural) where Mark and Luke use \"God,\" reflecting Jewish reverence that avoided speaking God's name directly. I preserve Matthew's distinctive phrasing.\n\n**\"Kept going out\" / \"kept trying to prevent\" (vv. 5, 14)**: The imperfect tense in Greek indicates ongoing or repeated action. In v. 5, it shows crowds continually streaming out; in v. 14, it shows John's persistent resistance (a conative imperfect—he was attempting but not succeeding).\n\n**\"From these stones... children\" (v. 9)**: In Hebrew/Aramaic, there is wordplay between *avanim* (stones) and *banim* (sons/children). A first-century Jewish audience would catch this resonance.\n\n**\"Fit to carry his sandals\" (v. 11)**: ἱκανός means worthy or fit for a task. Carrying sandals was work too menial even for disciples—it was a slave's duty. John claims a status lower than a slave in relation to the coming one.\n\n**\"In holy spirit and fire\" (v. 11)**: I leave \"spirit\" lowercase because the phrase parallels \"water\" and \"fire\" as baptismal elements. Whether this denotes the Holy Spirit specifically or a refining spiritual force is genuinely ambiguous in the text.\n\n**\"Look\" (vv. 16, 17)**: ἰδού is a dramatic interjection demanding attention. \"Behold\" sounds archaic; \"look\" preserves the immediacy and impact.\n\n**\"The Beloved\" (v. 17)**: ὁ ἀγαπητός functions as a title, echoing both Psalm 2:7 (the messianic king) and the description of Isaac in Genesis 22 (LXX). This may signal Jesus as both royal heir and beloved son to be offered.\n\n**\"In whom I delight\" (v. 17)**: εὐδοκέω means to take pleasure or delight in. \"Delight\" is stronger and more intimate than the traditional \"well pleased\" and better echoes the language of Isaiah 42:1, the servant in whom God delights."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "Then Jesus was led up into the wilderness by the Spirit to be tested by the devil.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And after fasting forty days and forty nights, he was hungry.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "The tester approached and said to him, \"If you are God's Son, command these stones to become bread.\"",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But he answered, \"It is written: 'A person will not live on bread alone, but on every word that comes forth from the mouth of God.'\"",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Then the devil took him to the holy city and stood him on the highest point of the temple,",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "and said to him, \"If you are God's Son, throw yourself down. For it is written: 'He will command his angels concerning you,' and 'On their hands they will lift you up, so that you never strike your foot against a stone.'\"",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Jesus said to him, \"Again it is written: 'You shall not put the Lord your God to the test.'\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Again the devil took him to an exceedingly high mountain and showed him all the kingdoms of the world and their splendor,",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "and said to him, \"All these I will give you, if you will fall down and worship me.\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Then Jesus said to him, \"Be gone, Satan! For it is written: 'The Lord your God you shall worship, and him alone you shall serve.'\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then the devil left him, and look—angels came and began ministering to him.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Now when he heard that John had been handed over, he withdrew to Galilee.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "And leaving Nazareth, he went and settled in Capernaum by the sea, in the territory of Zebulun and Naphtali,",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "so that what was spoken through Isaiah the prophet might be fulfilled:",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "\"Land of Zebulun and land of Naphtali, the way to the sea, beyond the Jordan, Galilee of the nations—",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "the people sitting in darkness have seen a great light, and for those sitting in the region and shadow of death, a light has dawned for them.\"",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "From that time Jesus began to proclaim and say, \"Turn back, for the kingdom of the heavens has come near.\"",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Walking along the Sea of Galilee, he saw two brothers—Simon, the one called Peter, and Andrew his brother—casting a net into the sea, for they were fishermen.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "And he said to them, \"Come, follow me, and I will make you fishers of people.\"",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Immediately they left their nets and followed him.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Going on from there, he saw two other brothers—James the son of Zebedee and John his brother—in the boat with Zebedee their father, mending their nets. And he called them.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Immediately they left the boat and their father and followed him.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "And he went throughout all Galilee, teaching in their synagogues and proclaiming the good news of the kingdom and healing every disease and every affliction among the people.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "And the report about him spread into all Syria, and they brought to him all who were suffering—those gripped by various diseases and severe pains, those possessed by demons, epileptics, and paralytics—and he healed them.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "And large crowds followed him from Galilee and the Decapolis and Jerusalem and Judea and from beyond the Jordan.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Tested\" (v. 1, 3)**: Greek πειράζω can mean either \"test\" or \"tempt.\" The wilderness setting deliberately echoes Israel's forty-year testing in the wilderness (Deuteronomy 8:2), where the same Greek verb is used in the Septuagint. \"Test\" captures this resonance better than \"tempt,\" which in modern English implies enticement to sin. The devil is testing whether Jesus will be a faithful Son where Israel was not.\n\n**\"If you are God's Son\" (v. 3, 6)**: The Greek lacks the article (\"Son of God\" not \"the Son of God\"). The first-class conditional (Εἰ + indicative) does not express doubt but assumes the condition for argument's sake—\"given that you are...\" However, English \"if\" captures this construction adequately, as the devil is challenging Jesus to prove his identity.\n\n**\"Handed over\" (v. 12)**: Greek παραδίδωμι. Most translations render this \"arrested,\" but the verb specifically means \"handed over\" or \"delivered up\"—the same word used repeatedly for Jesus's betrayal and passion. Matthew's use of this loaded term for John foreshadows what awaits Jesus.\n\n**\"Turn back\" (v. 17)**: Greek μετανοεῖτε is typically rendered \"repent.\" While not wrong, \"repent\" in modern English often suggests feeling sorry for sins. The underlying Hebrew concept (תְּשׁוּבָה, teshuvah) means turning back—reorienting one's entire life toward God. \"Turn back\" recovers this directional, whole-life sense.\n\n**\"Kingdom of the heavens\" (v. 17)**: Matthew consistently uses this phrase (βασιλεία τῶν οὐρανῶν) rather than Mark and Luke's \"kingdom of God\"—a Jewish circumlocution avoiding direct use of God's name. Preserving \"heavens\" (plural, as in Greek) maintains Matthew's distinctive voice.\n\n**\"Epileptics\" (v. 24)**: Greek σεληνιαζομένους literally means \"moon-struck\"—ancients associated epileptic seizures with lunar phases. A literal rendering (\"those affected by the moon\") would confuse modern readers; \"epileptics\" conveys what the original audience understood.\n\n**\"Severe pains\" (v. 24)**: Greek βάσανος originally meant a touchstone for testing metals, then came to mean torture, then intense pain. \"Torments\" preserves the intensity but sounds archaic; \"severe pains\" captures the meaning accessibly."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "When he saw the crowds, he went up onto the mountain, and when he had sat down, his disciples came to him.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And opening his mouth, he began teaching them, saying:",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "\"Blessed are the destitute in spirit, for theirs is the kingdom of the heavens.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Blessed are those who mourn, for they will be comforted.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Blessed are those gentle in strength, for they will inherit the earth.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Blessed are those who hunger and thirst for justice, for they will be satisfied.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Blessed are the merciful, for they will receive mercy.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Blessed are the pure in heart, for they will see God.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Blessed are the peacemakers, for they will be called sons of God.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Blessed are those who have been persecuted on account of justice, for theirs is the kingdom of the heavens.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "\"Blessed are you when people insult you and persecute you and say every kind of evil against you falsely on my account.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "Rejoice and be overjoyed, because your reward is great in the heavens—for this is how they persecuted the prophets who came before you.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "\"You are the salt of the earth. But if the salt becomes foolish, with what will it be made salty? It is no longer good for anything except to be thrown out and trampled underfoot by people.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "\"You are the light of the world. A city situated on a hill cannot be hidden.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "Nor do people light a lamp and put it under a measuring basket, but on the lampstand, and it gives light to everyone in the house.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "In the same way, let your light shine before people, so that they may see your good works and glorify your Father who is in the heavens.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "\"Do not think that I came to abolish the Law or the Prophets. I did not come to abolish but to fulfill.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "For truly I tell you, until heaven and earth pass away, not one iota or one stroke will pass away from the Law until all things come to pass.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Therefore, whoever relaxes one of the least of these commandments and teaches others to do so will be called least in the kingdom of the heavens. But whoever practices and teaches them—this one will be called great in the kingdom of the heavens.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For I tell you that unless your righteousness far exceeds that of the scribes and Pharisees, you will never enter the kingdom of the heavens.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "\"You have heard that it was said to the ancients, 'You shall not murder,' and 'Whoever murders will be liable to judgment.'",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "But I say to you that everyone who is angry with his brother will be liable to judgment. And whoever says to his brother 'Raka!' will be liable to the Sanhedrin. And whoever says 'You fool!' will be liable to the Gehenna of fire.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "\"So if you are bringing your gift to the altar and there you remember that your brother has something against you,",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "leave your gift there before the altar and go. First be reconciled to your brother, and then come and offer your gift.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "\"Come to terms quickly with your accuser while you are still with him on the road, or your accuser may hand you over to the judge, and the judge to the officer, and you will be thrown into prison.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "Truly I tell you, you will never get out of there until you have paid the last quadrans.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "\"You have heard that it was said, 'You shall not commit adultery.'",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "But I say to you that everyone who looks at a woman in order to desire her has already committed adultery with her in his heart.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "\"If your right eye causes you to stumble, tear it out and throw it away from you. For it is better for you that one of your members should perish than for your whole body to be thrown into Gehenna.",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "And if your right hand causes you to stumble, cut it off and throw it away from you. For it is better for you that one of your members should perish than for your whole body to go into Gehenna.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "\"It was said, 'Whoever divorces his wife must give her a certificate of divorce.'",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "But I say to you that everyone who divorces his wife, except on the grounds of sexual immorality, makes her commit adultery, and whoever marries a divorced woman commits adultery.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "\"Again, you have heard that it was said to the ancients, 'You shall not swear falsely, but shall fulfill your oaths to the Lord.'",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "But I say to you, do not swear at all—not by heaven, for it is the throne of God;",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "not by the earth, for it is the footstool of his feet; not by Jerusalem, for it is the city of the great King;",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "and do not swear by your head, for you cannot make one hair white or black.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "Let your word be 'Yes, yes' or 'No, no.' Anything beyond this comes from the evil one.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "\"You have heard that it was said, 'Eye for eye and tooth for tooth.'",
          "paragraphStart": true
        },
        {
          "verse": 39,
          "text": "But I say to you, do not resist the evildoer. Rather, whoever strikes you on the right cheek, turn to him the other also.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "And if someone wants to sue you and take your tunic, let him have your cloak as well.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "And whoever conscripts you for one mile, go with him two.",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "Give to the one who asks you, and do not turn away from the one who wants to borrow from you.",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "\"You have heard that it was said, 'You shall love your neighbor' and 'You shall hate your enemy.'",
          "paragraphStart": true
        },
        {
          "verse": 44,
          "text": "But I say to you, love your enemies and pray for those who persecute you,",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "so that you may become sons of your Father who is in the heavens—for he makes his sun rise on the wicked and the good, and sends rain on the just and the unjust.",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "For if you love those who love you, what reward do you have? Do not even the tax collectors do the same?",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "And if you greet only your brothers, what more are you doing? Do not even the Gentiles do the same?",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "Therefore you shall be complete, as your heavenly Father is complete.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Destitute\" (v. 3)**: Greek πτωχός refers not to modest means but to begging poverty—those with nothing. This is stronger than \"poor\" in modern English, which can suggest merely limited resources.\n\n**\"Gentle in strength\" (v. 5)**: Greek πραεῖς (often translated \"meek\") doesn't mean weakness or passivity. It describes controlled strength—power held in check, like a war horse trained for battle but responsive to its rider. The word implies having the capacity for force but choosing restraint and gentleness instead.\n\n**\"Justice/righteousness\" (vv. 6, 10, 20)**: Greek δικαιοσύνη encompasses both personal righteousness and social justice. I use \"justice\" in vv. 6 and 10 where the hunger is for God's setting-right of the world, and \"righteousness\" in v. 20 where personal conduct is in view.\n\n**\"Becomes foolish\" (v. 13)**: Greek μωρανθῇ literally means \"become foolish.\" This likely reflects an Aramaic wordplay where תָּפֵל (tāpēl) means both \"foolish\" and \"unsalted/tasteless.\" Rather than flatten to \"loses its saltiness,\" I preserve the Greek's unusual word choice.\n\n**\"Raka\" (v. 22)**: Aramaic term of contempt (רֵיקָא) meaning \"empty one\" or \"worthless.\" Retained as a transliteration since it was already a foreign word to Greek readers.\n\n**\"Quadrans\" (v. 26)**: The smallest Roman coin, worth 1/64 of a denarius. Retaining the term preserves the precision of the original—every last fraction must be paid.\n\n**\"Causes you to stumble\" (vv. 29-30)**: Greek σκανδαλίζει derives from σκάνδαλον, the trigger of a trap. The meaning is causing someone to fall into sin, not merely offense or annoyance.\n\n**\"Conscripts\" (v. 41)**: Greek ἀγγαρεύσει is a Persian loanword for compulsory service—being forced to carry a soldier's pack. \"Forces you to go\" misses the specific context of imperial requisition.\n\n**\"Complete\" (v. 48)**: Greek τέλειος means whole, mature, or having reached one's end/purpose—not \"perfect\" in the sense of flawless. The call is to be whole in love as God is whole, not to achieve moral perfection."
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "Be careful not to practice your righteousness before others in order to be watched by them. Otherwise, you have no reward with your Father who is in the heavens.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "So when you give to the poor, do not sound a trumpet before you, as the performers do in the synagogues and in the streets so that they may be praised by others. Truly I tell you: they have been paid in full.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "But when you give to the poor, do not let your left hand know what your right hand is doing,",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "so that your giving may be in secret. And your Father, who sees what is done in secret, will repay you.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And when you pray, do not be like the performers, for they love to pray standing in the synagogues and at the corners of the main streets so that they may be seen by others. Truly I tell you: they have been paid in full.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "But when you pray, go into your inner room and shut your door and pray to your Father who is in the hidden place. And your Father, who sees what is done in secret, will repay you.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And when you pray, do not babble on like the pagans, for they think that they will be heard because of their many words.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Do not be like them, for your Father knows what you need before you ask him.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Pray, then, like this: Our Father in the heavens, let your name be held holy,",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "let your kingdom come, let your will be done, as in heaven, so also on earth.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Give us today our bread for the coming day,",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "and release us from our debts, as we also have released our debtors.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And do not bring us into the time of trial, but rescue us from the evil one.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For if you release others from their transgressions, your heavenly Father will also release you.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "But if you do not release others, neither will your Father release your transgressions.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And when you fast, do not be gloomy like the performers, for they disfigure their faces so that their fasting may be visible to others. Truly I tell you: they have been paid in full.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "But when you fast, anoint your head and wash your face,",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "so that your fasting may not be visible to others but only to your Father who is in the hidden place. And your Father, who sees what is done in secret, will repay you.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Do not store up for yourselves treasures on earth, where moth and decay destroy, and where thieves dig through and steal.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Rather, store up for yourselves treasures in heaven, where neither moth nor decay destroys, and where thieves do not dig through or steal.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For where your treasure is, there your heart will be also.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "The eye is the lamp of the body. If your eye is generous, your whole body will be full of light.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "But if your eye is stingy, your whole body will be full of darkness. If then the light within you is darkness, how great is that darkness!",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "No one can serve as a slave to two masters. For either he will hate the one and love the other, or he will be devoted to the one and despise the other. You cannot serve both God and Mammon.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "For this reason I tell you: do not be anxious about your life—what you will eat—or about your body—what you will wear. Is not life more than food, and the body more than clothing?",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "Look at the birds of the sky: they do not sow or reap or gather into barns, and yet your heavenly Father feeds them. Are you not worth far more than they?",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "And which of you by being anxious can add a single hour to the span of your life?",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "And why are you anxious about clothing? Consider the wildflowers of the field, how they grow: they do not toil or spin.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Yet I tell you that not even Solomon in all his splendor was clothed like one of these.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Now if God so clothes the grass of the field, which is here today and tomorrow is thrown into the oven, will he not much more clothe you, you of little faith?",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "So do not be anxious, saying, \"What will we eat?\" or \"What will we drink?\" or \"What will we wear?\"",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "For the pagans chase after all these things, and your heavenly Father knows that you need them all.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "But seek first the kingdom and his righteousness, and all these things will be added to you.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "So do not be anxious about tomorrow, for tomorrow will be anxious for itself. Each day has enough trouble of its own.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Performers\" (v. 2, 5, 16)**: Greek ὑποκριταί originally referred to stage actors—people playing a role for an audience. The modern \"hypocrite\" suggests someone whose private beliefs contradict their public actions. Jesus's critique is sharper: these people's religion *is* the performance; the audience is the point.\n\n**\"Paid in full\" (v. 2, 5, 16)**: The verb ἀπέχουσιν is commercial terminology—what appears on a receipt when a debt is settled. The transaction is complete; no further payment is coming.\n\n**\"Inner room\" (v. 6)**: Greek ταμεῖον refers to a storeroom or storage chamber—the innermost, most private space in an ancient house, often without windows. This contrasts maximally with the public street corners of v. 5.\n\n**\"Bread for the coming day\" (v. 11)**: The word ἐπιούσιον appears nowhere else in Greek literature and may have been coined here. Its meaning is debated, but Jerome reported that the lost Gospel of the Hebrews had the Aramaic word for \"tomorrow\" here. \"Bread for the coming day\" fits the passage's theme about not worrying about tomorrow (v. 34) and echoes the manna provision (Exodus 16), which came daily and could not be hoarded.\n\n**\"Release...debts/debtors\" (v. 12)**: Greek ὀφειλήματα/ὀφειλέταις literally means debts and debtors. The Aramaic word ḥôbâ underlying this can mean both financial debt and moral/spiritual obligation. I retained the economic language because it connects to the surrounding teaching about treasure and Mammon.\n\n**\"The evil one\" (v. 13)**: Greek τοῦ πονηροῦ could be neuter (\"evil\") or masculine (\"the evil one\"). The presence of the article and the personified language of \"testing\" suggest the masculine reading.\n\n**\"Disfigure...visible\" (v. 16)**: The Greek contains wordplay: ἀφανίζουσιν (make unsightly/unseen) and φανῶσιν (be seen/visible). They make their faces *un*-seen so that they may be *seen*. Capturing this paradox requires some interpretation; I've used \"disfigure\" and \"visible.\"\n\n**\"Generous/stingy eye\" (v. 22-23)**: Greek ἁπλοῦς (simple, single) and πονηρός (evil, bad) in reference to the eye directly invoke the Hebrew idiom: a \"good eye\" (עין טובה) means generosity, while an \"evil eye\" (עין רעה) means stinginess. This is not about physical vision but about one's disposition toward wealth and others. Translating as \"generous\" and \"stingy\" makes the connection to the surrounding context about treasure and Mammon explicit, as the original audience would have understood it.\n\n**\"Mammon\" (v. 24)**: This is the Aramaic word ממון (mamōnā) transliterated into Greek. Rather than translating it as \"money\" or \"wealth,\" I've preserved the foreign term because Jesus personifies it as a rival master demanding allegiance—giving it the weight of an alternative deity.\n\n**\"Span of your life\" (v. 27)**: Greek ἡλικία can mean either \"stature\" (height) or \"lifespan.\" The word πῆχυς (cubit, about 18 inches) creates an odd image if applied to height but works as a metaphor for a small unit of time. The context of anxiety about survival supports \"lifespan.\"\n\n**\"Wildflowers\" (v. 28)**: Greek κρίνα is traditionally \"lilies,\" but likely refers to wildflowers generally—the colorful blooms that appear briefly in Galilean fields before the grass is cut for fuel."
    },
    {
      "chapter": 7,
      "verses": [
        {
          "verse": 1,
          "text": "Do not condemn, so that you may not be condemned.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For by whatever judgment you judge, you will be judged, and by whatever measure you measure, it will be measured back to you.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Why do you see the splinter in your brother's eye, but fail to notice the beam in your own eye?",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Or how will you say to your brother, \"Let me take the splinter out of your eye,\" when look—there is a beam in your own eye?",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Performer! First take the beam out of your own eye, and then you will see clearly to take the splinter out of your brother's eye.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Do not give what is holy to the dogs, and do not throw your pearls before the pigs—otherwise they will trample them under their feet and then turn and tear you apart.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Ask, and it will be given to you. Seek, and you will find. Knock, and the door will be opened for you.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "For everyone who asks receives, and the one who seeks finds, and to the one who knocks it will be opened.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Or what person among you, if his son asks for bread—will give him a stone?",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Or if he asks for a fish—will give him a snake?",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "If you, then, though you are evil, know how to give good gifts to your children, how much more will your Father who is in the heavens give good things to those who ask him!",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "So then, whatever you want people to do for you, do the same for them—for this is the Law and the Prophets.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Enter through the narrow gate. For wide is the gate and spacious is the road that leads away to destruction, and many are those who enter through it.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "How narrow is the gate and constricted is the road that leads away to life, and few are those who find it!",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Beware of the false prophets who come to you in sheep's clothing but inwardly are ravenous wolves.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "By their fruits you will recognize them. Do people gather grapes from thornbushes, or figs from thistles?",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "In the same way, every good tree produces fine fruit, but a rotten tree produces bad fruit.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "A good tree cannot produce bad fruit, nor can a rotten tree produce fine fruit.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Every tree that does not produce fine fruit is cut down and thrown into fire.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "So then, by their fruits you will recognize them.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Not everyone who says to me, \"Lord, Lord,\" will enter into the kingdom of the heavens, but the one who does the will of my Father who is in the heavens.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "Many will say to me on that day, \"Lord, Lord, did we not prophesy in your name, and cast out demons in your name, and perform many powerful deeds in your name?\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "And then I will declare to them: \"I never knew you. Depart from me, you workers of lawlessness.\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Everyone, therefore, who hears these words of mine and does them will be like a wise man who built his house on the rock.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "And the rain came down, and the rivers rose, and the winds blew and beat against that house—and it did not fall, for it had been founded on the rock.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "And everyone who hears these words of mine and does not do them will be like a foolish man who built his house on the sand.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "And the rain came down, and the rivers rose, and the winds blew and struck against that house—and it fell, and great was its collapse.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "And it happened that when Jesus finished these words, the crowds were astonished at his teaching,",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "for he was teaching them as one who has authority, and not as their scribes.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Condemn\" (v. 1-2)**: While κρίνω can mean \"judge\" broadly, the context—with its warning about receiving the same treatment back—suggests the harsher sense of passing condemnatory judgment on others. \"Judge\" in English can sound neutral (like evaluating evidence), but Jesus is warning against a condemning posture toward others.\n\n**\"Performer\" (v. 5)**: Greek ὑποκριτής means an actor on a stage. The singular vocative here addresses someone whose correction of others is theatrical performance rather than genuine care. This connects to the same vocabulary in chapter 6.\n\n**\"Beam\" (v. 3-5)**: Greek δοκός refers to a construction timber or wooden beam—the hyperbole is intentionally absurd and humorous. A \"log\" works, but \"beam\" better captures the construction imagery.\n\n**\"How narrow\" (v. 14)**: The text reads ὅτι, which most translations render \"because\" (continuing the reason from v. 13). However, ὅτι can also introduce an exclamation (\"how!\"), and this reading better fits the rhetorical force—the narrowness itself is the point, not an explanation of why to enter.\n\n**\"Constricted\" (v. 14)**: Greek τεθλιμμένη is the perfect participle of θλίβω, \"to press, afflict\"—the same root as θλῖψις (tribulation). The road is not merely \"narrow\" (στενή describes the gate) but pressed-in, squeezed. This hints that the way to life involves pressure and difficulty.\n\n**\"Ravenous\" (v. 15)**: Greek ἅρπαγες means seizing, plundering—wolves that grab and tear prey. \"Ravenous\" captures both the aggression and the predatory intent.\n\n**\"Workers of lawlessness\" (v. 23)**: Greek οἱ ἐργαζόμενοι τὴν ἀνομίαν echoes Psalm 6:8 (LXX). The phrase suggests not occasional sin but a pattern of activity—those whose work is lawlessness. \"Lawlessness\" (ἀνομία) means living without regard for God's Torah, not just generic wrongdoing.\n\n**\"Rivers rose\" (vv. 25, 27)**: Greek ποταμοί literally means \"rivers,\" but in the Palestinian context of flash floods in wadis, the image is of seasonal torrents swelling and rushing. \"Rivers rose\" captures this better than simply \"floods came.\""
    },
    {
      "chapter": 8,
      "verses": [
        {
          "verse": 1,
          "text": "When he came down from the mountain, large crowds followed him.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And look—a man with a skin disease approached and bowed down before him, saying, \"Lord, if you are willing, you are able to make me clean.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Reaching out his hand, he touched him, saying, \"I am willing. Be cleansed.\" And immediately his skin disease was cleansed.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And Jesus says to him, \"See that you tell no one. But go, show yourself to the priest and offer the gift that Moses commanded, as evidence to them.\"",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "When he entered Capernaum, a centurion approached him, pleading with him",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "and saying, \"Lord, my servant lies paralyzed at home, suffering terrible torment.\"",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And he says to him, \"Am I to come and heal him?\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "The centurion answered, \"Lord, I am not worthy for you to come under my roof. But only speak the word, and my servant will be healed.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For I too am a man under authority, with soldiers under me, and I say to this one, 'Go,' and he goes, and to another, 'Come,' and he comes, and to my slave, 'Do this,' and he does it.\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "When Jesus heard this, he marveled and said to those following, \"Truly I tell you, in no one in Israel have I found such faith.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "I tell you that many will come from the east and the west and will recline at table with Abraham and Isaac and Jacob in the kingdom of the heavens,",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "but the heirs of the kingdom will be thrown out into the outer darkness. There will be weeping and grinding of teeth.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And Jesus said to the centurion, \"Go. Let it be done for you as you have believed.\" And the servant was healed in that hour.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "When Jesus came into Peter's house, he saw his mother-in-law lying sick with fever.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "He touched her hand, and the fever released her. She got up and began serving him.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "When evening came, they brought to him many who were demonized, and he drove out the spirits with a word and healed all who were afflicted,",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "so that what was spoken through the prophet Isaiah might be fulfilled: \"He himself took our weaknesses and bore our diseases.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "When Jesus saw the crowds around him, he gave orders to depart for the other side.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "A scribe approached and said to him, \"Teacher, I will follow you wherever you go.\"",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Jesus says to him, \"Foxes have dens, and the birds of the sky have nests, but the Son of Man has nowhere to lay his head.\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Another of the disciples said to him, \"Lord, permit me first to go and bury my father.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But Jesus says to him, \"Follow me, and let the dead bury their own dead.\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "When he got into the boat, his disciples followed him.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "And suddenly a great upheaval arose on the sea, so that the boat was being swamped by the waves—but he was sleeping.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "They came and woke him, saying, \"Lord, save us! We are perishing!\"",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "He says to them, \"Why are you afraid, you of little faith?\" Then he rose and rebuked the winds and the sea, and there was a great calm.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "The men marveled, saying, \"What sort of man is this, that even the winds and the sea obey him?\"",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "When he came to the other side, to the region of the Gadarenes, two demonized men met him, coming out of the tombs—so extremely dangerous that no one was able to pass by that road.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "And suddenly they cried out, \"What do you want with us, Son of God? Have you come here to torment us before the appointed time?\"",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Now some distance from them a large herd of pigs was feeding.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "The demons begged him, \"If you cast us out, send us into the herd of pigs.\"",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "And he said to them, \"Go.\" They came out and went into the pigs, and suddenly the whole herd rushed down the steep bank into the sea and died in the waters.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "The herdsmen fled, and going into the city, they reported everything—including what had happened to the demonized men.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "And the whole city came out to meet Jesus, and when they saw him, they begged him to leave their region.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Am I to come and heal him?\" (v. 7)**: The Greek ἐγὼ ἐλθὼν θεραπεύσω αὐτόν is typically translated as a statement (\"I will come and heal him\"), but the emphatic ἐγώ (\"I myself\") and the cultural context—a Jewish teacher entering a Gentile's home would cause ritual impurity—suggests this may be a question expressing hesitation or testing the centurion's understanding. The centurion's response (v. 8) makes better sense as answering such a question: \"You don't need to come; just speak the word.\"\n\n**\"Heirs of the kingdom\" (v. 12)**: The Greek υἱοὶ τῆς βασιλείας literally means \"sons of the kingdom\"—a Semitic idiom for those who belong to or are entitled to inherit something. \"Heirs\" captures this sense more naturally in English than the literal \"sons.\"\n\n**\"Upheaval\" (v. 24)**: Matthew uses σεισμός, the word for earthquake (from which \"seismic\" derives), rather than the typical storm vocabulary. This unusual word choice may evoke apocalyptic imagery or emphasize the cosmic scale of the disturbance. \"Upheaval\" preserves this distinctiveness better than \"storm.\"\n\n**\"Swamped\" (v. 24)**: The Greek καλύπτεσθαι means \"being covered\" or \"being hidden\"—the waves were overwhelming the boat. \"Swamped\" conveys both the water covering the boat and the sense of being overwhelmed.\n\n**\"What do you want with us?\" (v. 29)**: The Greek τί ἡμῖν καὶ σοί is literally \"What to us and to you?\"—a Hebrew/Aramaic idiom expressing distance or conflict between parties. It appears throughout the Hebrew Bible (e.g., Judges 11:12; 2 Samuel 16:10) and conveys \"What business do we have with each other?\" or \"Leave us alone!\"\n\n**\"Before the appointed time\" (v. 29)**: The phrase πρὸ καιροῦ indicates the demons recognize a scheduled time for their judgment—revealing their theological awareness that eschatological punishment awaits them."
    },
    {
      "chapter": 9,
      "verses": [
        {
          "verse": 1,
          "text": "And getting into a boat, he crossed over and came to his own city.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And look, they were bringing to him a paralyzed man lying on a mat. And Jesus, seeing their faith, said to the paralyzed man, \"Take courage, child—your sins are forgiven.\"",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "And look, some of the scribes said among themselves, \"This man blasphemes.\"",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And Jesus, knowing their thoughts, said, \"Why do you think evil in your hearts?",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For which is easier—to say, 'Your sins are forgiven,' or to say, 'Rise and walk'?",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But so that you may know that the Son of Man has authority on earth to forgive sins\"—then he says to the paralyzed man, \"Rise, pick up your mat, and go to your home.\"",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And he rose and went away to his home.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And when the crowds saw this, they were awestruck and glorified God, who had given such authority to human beings.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And as Jesus was passing on from there, he saw a man sitting at the tax booth, called Matthew, and says to him, \"Follow me.\" And getting up, he followed him.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "And it happened that as he was reclining at table in the house, look, many tax collectors and sinners came and were reclining at table with Jesus and his disciples.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And seeing this, the Pharisees said to his disciples, \"Why does your teacher eat with tax collectors and sinners?\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "But hearing this, he said, \"The healthy have no need of a physician—but the sick do.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Go and learn what this means: 'I desire mercy, not sacrifice.' For I did not come to call the righteous, but sinners.\"",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Then the disciples of John come to him, saying, \"Why do we and the Pharisees fast often, but your disciples do not fast?\"",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "And Jesus said to them, \"Can the wedding guests mourn while the bridegroom is with them? But days will come when the bridegroom is taken from them, and then they will fast.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And no one puts a patch of unshrunk cloth on an old garment, for the patch pulls away from the garment, and a worse tear results.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Nor do they put new wine into old wineskins. Otherwise, the skins burst, the wine spills out, and the skins are ruined. Rather, they put new wine into fresh wineskins, and both are preserved.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "While he was saying these things to them, look, an official came and was bowing before him, saying, \"My daughter has just now died. But come and lay your hand on her, and she will live.\"",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "And Jesus rose and followed him, along with his disciples.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "And look, a woman who had been suffering from bleeding for twelve years came up behind him and touched the fringe of his garment.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For she was saying to herself, \"If I only touch his garment, I will be healed.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But Jesus turned and saw her and said, \"Take courage, daughter—your faith has healed you.\" And the woman was healed from that hour.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "And when Jesus came to the official's house and saw the flute players and the crowd in uproar,",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "he said, \"Go away, for the girl has not died but is sleeping.\" And they laughed at him.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "But when the crowd had been put out, he went in and took her by the hand, and the girl rose.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "And the news of this went out into all that region.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "And as Jesus was passing on from there, two blind men followed him, crying out and saying, \"Have mercy on us, Son of David!\"",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "And when he came into the house, the blind men came to him, and Jesus says to them, \"Do you believe that I am able to do this?\" They say to him, \"Yes, Lord.\"",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Then he touched their eyes, saying, \"According to your faith, let it be done to you.\"",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "And their eyes were opened. And Jesus sternly warned them, saying, \"See that no one knows about this.\"",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "But they went out and spread the news about him throughout all that region.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "As they were going out, look, they brought to him a mute man who was demon-possessed.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "And when the demon had been cast out, the mute man spoke. And the crowds marveled, saying, \"Never has anything like this been seen in Israel!\"",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "But the Pharisees were saying, \"By the ruler of the demons he casts out demons.\"",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "And Jesus was traveling through all the cities and villages, teaching in their synagogues and proclaiming the good news of the kingdom, and healing every disease and every illness.",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "And seeing the crowds, he was moved with compassion for them, because they were harassed and helpless, like sheep without a shepherd.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "Then he says to his disciples, \"The harvest is plentiful, but the workers are few.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "Therefore, plead with the lord of the harvest to send out workers into his harvest.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Wedding guests\" (v. 15)**: The Greek οἱ υἱοὶ τοῦ νυμφῶνος literally means \"the sons of the bridal chamber,\" an Aramaic idiom (בני חופה) for those attending a wedding celebration. Note that Matthew uses \"mourn\" (πενθεῖν) rather than \"fast,\" linking fasting to mourning and making Jesus's point more vivid: mourning at a wedding is absurd.\n\n**\"Fringe\" (v. 20)**: The Greek κράσπεδον refers to the ritual tassels (tzitzit) commanded in Numbers 15:38-39. A first-century Jewish audience would recognize this as a mark of Torah observance—the woman reaches for Jesus's visible sign of covenant faithfulness.\n\n**\"Healed\" (vv. 21-22)**: The Greek σῴζω means both \"save\" and \"heal.\" The woman thinks \"I will be healed/saved\" (σωθήσομαι), and Jesus declares \"your faith has healed/saved you\" (σέσωκέν σε). The ambiguity is intentional—physical healing and spiritual salvation are intertwined.\n\n**\"To human beings\" (v. 8)**: The plural τοῖς ἀνθρώποις is surprising—the crowds glorify God for giving such authority not just to Jesus but \"to humans.\" This may reflect Matthew's interest in how Jesus's authority extends to his community.\n\n**\"Harassed and helpless\" (v. 36)**: The Greek ἐσκυλμένοι καὶ ἐρριμμένοι conveys being worn down and cast aside—like sheep scattered by predators or neglect. The imagery echoes prophetic critiques of Israel's failed shepherds (Ezekiel 34; Numbers 27:17).\n\n**\"Send out\" (v. 38)**: The Greek ἐκβάλῃ is the same verb used for casting out demons—it suggests urgency and force. God must thrust workers into the harvest, not merely dispatch them.\n\n**\"Sternly warned\" (v. 30)**: The Greek ἐνεβριμήθη carries strong emotional force, suggesting indignation or intensity. Jesus's secrecy commands throughout Matthew are emphatic, not casual requests."
    },
    {
      "chapter": 10,
      "verses": [
        {
          "verse": 1,
          "text": "And having summoned his twelve disciples, he gave them authority over unclean spirits, to cast them out and to heal every disease and every ailment.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Now the names of the twelve apostles are these: first, Simon who is called Peter, and Andrew his brother; James the son of Zebedee and John his brother;",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "Philip and Bartholomew; Thomas and Matthew the tax collector; James the son of Alphaeus and Thaddaeus;",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Simon the Zealot, and Judas Iscariot—the one who handed him over.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "These twelve Jesus sent out, instructing them: \"Do not go on any road leading to the Gentiles, and do not enter any town of the Samaritans.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Go rather to the lost sheep of the house of Israel.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And as you go, proclaim: 'The kingdom of the heavens has drawn near.'",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Heal the sick, raise the dead, cleanse those with skin diseases, cast out demons. Freely you received; freely give.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "\"Do not acquire gold or silver or copper for your money-belts,",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "nor a traveler's bag for the road, nor two tunics, nor sandals, nor a staff—for the worker is worthy of his food.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Whatever town or village you enter, find out who in it is worthy, and stay there until you leave.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "As you enter the house, greet it.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And if the house is worthy, let your peace come upon it; but if it is not worthy, let your peace return to you.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And whoever does not receive you or listen to your words—as you leave that house or that town, shake off the dust from your feet.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Truly I tell you, it will be more bearable for the land of Sodom and Gomorrah on the day of judgment than for that town.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "\"Look—I am sending you out as sheep in the midst of wolves. So become shrewd as serpents and innocent as doves.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "But beware of people, for they will hand you over to councils and flog you in their synagogues.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And you will be brought before governors and kings on account of me, as a witness to them and to the nations.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "But when they hand you over, do not be anxious about how to speak or what to say, for what you are to say will be given to you in that hour.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For it is not you who are speaking, but the Spirit of your Father speaking through you.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "\"Brother will hand over brother to death, and a father his child, and children will rise up against parents and have them put to death.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "And you will be hated by all because of my name. But the one who endures to the end—this one will be saved.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "When they persecute you in one town, flee to the next. For truly I tell you, you will not finish going through the towns of Israel before the Son of Man comes.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "\"A disciple is not above the teacher, nor a slave above his master.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "It is enough for the disciple to become like his teacher, and the slave like his master. If they have called the master of the house Beelzebul, how much more the members of his household!",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "\"So do not fear them. For nothing is concealed that will not be revealed, and nothing hidden that will not be made known.",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "What I tell you in the darkness, speak in the light; and what you hear whispered in your ear, proclaim from the housetops.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "And do not fear those who kill the body but cannot kill the soul. Rather, fear the one who is able to destroy both soul and body in Gehenna.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "\"Are not two sparrows sold for a single assarion? Yet not one of them will fall to the ground apart from your Father.",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "And even the hairs of your head are all numbered.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "So do not fear—you are worth more than many sparrows.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "\"Everyone therefore who acknowledges me before others, I also will acknowledge before my Father who is in the heavens.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "But whoever denies me before others, I also will deny before my Father who is in the heavens.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "\"Do not think that I came to bring peace upon the earth. I did not come to bring peace, but a sword.",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "For I came to set a man against his father, and a daughter against her mother, and a daughter-in-law against her mother-in-law.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "And a person's enemies will be the members of his own household.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "\"Whoever loves father or mother more than me is not worthy of me, and whoever loves son or daughter more than me is not worthy of me.",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "And whoever does not take up his cross and follow after me is not worthy of me.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "Whoever finds his life will lose it, and whoever loses his life for my sake will find it.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "\"Whoever receives you receives me, and whoever receives me receives the one who sent me.",
          "paragraphStart": true
        },
        {
          "verse": 41,
          "text": "Whoever receives a prophet because he is a prophet will receive a prophet's reward, and whoever receives a righteous person because he is righteous will receive a righteous person's reward.",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "And whoever gives even a cup of cold water to one of these little ones because he is a disciple—truly I tell you, that person will certainly not lose their reward.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Simon the Zealot\" (v. 4)**: The Greek Καναναῖος is not \"Canaanite\" but a transliteration of the Aramaic word for \"zealot\" (קנאי). This describes either Simon's temperament or his association with the Zealot movement. \"Zealot\" captures this better than the misleading \"Cananaean.\"\n\n**\"Handed him over\" (v. 4)**: The verb παραδίδωμι means \"hand over, deliver up.\" While often translated \"betray,\" the Greek word itself is neutral—the same verb describes what councils will do to the disciples (v. 17, 19, 21). \"Handed over\" preserves this connection and lets the context convey the treachery.\n\n**\"Has drawn near\" (v. 7)**: The perfect tense ἤγγικεν indicates completed action with ongoing results—the kingdom has come near and remains near. This is stronger than simply \"is coming.\"\n\n**\"Money-belts\" (v. 9)**: The ζώνη was the belt or sash where travelers kept coins. \"Money-belts\" makes explicit what would have been obvious to ancient readers.\n\n**\"Let your peace come upon it... return to you\" (v. 13)**: This reflects the Semitic understanding of שָׁלוֹם (shalom) as something substantial that can rest on a household or return to its source—not merely a verbal greeting.\n\n**\"Beelzebul\" (v. 25)**: There is deliberate wordplay here: Jesus is called the οἰκοδεσπότης (\"master of the house\"), and Beelzebul likely means \"lord of the house\" (Baal-zebul) in Aramaic. The contrast between the true master of the house and this demonic title is intentional. The disciples are the οἰκιακοί (\"household members\").\n\n**\"Gehenna\" (v. 28)**: Retained rather than \"hell\" because Gehenna refers specifically to the Valley of Hinnom outside Jerusalem, a place associated with judgment. It carries different connotations than the generic English \"hell.\"\n\n**\"Assarion\" (v. 29)**: This was a Roman copper coin worth 1/16 of a denarius—a trivial amount. Retaining the term emphasizes how cheap sparrows were while avoiding awkward modern currency equivalents.\n\n**\"Acknowledges me\" (v. 32)**: The unusual Greek construction ὁμολογήσει ἐν ἐμοί (\"confess in me\") reflects a Semitic idiom meaning to acknowledge loyalty or solidarity with someone. This is more than mere verbal confession—it involves public identification with Jesus.\n\n**\"Life/soul\" (v. 39)**: The Greek ψυχή can mean either \"life\" or \"soul.\" In this paradoxical saying, \"life\" captures the point better: the one who grasps after their life (seeking to preserve it) will lose it, while the one who loses their life for Jesus's sake will find it."
    },
    {
      "chapter": 11,
      "verses": [
        {
          "verse": 1,
          "text": "And it happened that when Jesus finished giving instructions to his twelve disciples, he went on from there to teach and proclaim in their towns.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Now John, having heard in prison about the works of the Messiah, sent word through his disciples",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "and asked him, \"Are you the Coming One, or should we expect someone else?\"",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Jesus answered them, \"Go and report to John what you are hearing and seeing:",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "The blind are receiving their sight and the lame are walking, lepers are being cleansed and the deaf are hearing, the dead are being raised and the poor are receiving good news.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And blessed is anyone who does not stumble because of me.\"",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "As they were leaving, Jesus began to speak to the crowds about John: \"What did you go out into the wilderness to see? A reed swaying in the wind?",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Then what did you go out to see? A man dressed in soft clothing? Look, those who wear soft clothes are in the palaces of kings.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Then what did you go out to see? A prophet? Yes, I tell you, and more than a prophet.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "This is the one about whom it is written: 'Look, I am sending my messenger ahead of you, who will prepare your way before you.'",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Truly I tell you, among those born of women no one greater than John the Baptizer has arisen. Yet the least in the kingdom of the heavens is greater than he.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "From the days of John the Baptizer until now, the kingdom of the heavens is being forcefully entered, and the forceful are seizing it.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For all the Prophets and the Law prophesied until John.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And if you are willing to accept it, he is Elijah who is about to come.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Let the one who has ears, hear.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "\"But to what shall I compare this generation? It is like children sitting in the marketplaces who call out to the others,",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "saying, 'We played the flute for you and you did not dance; we sang a dirge and you did not beat your chests.'",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For John came neither eating nor drinking, and they say, 'He has a demon.'",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "The Son of Man came eating and drinking, and they say, 'Look, a glutton and a drunk, a friend of tax collectors and sinners!' Yet wisdom is vindicated by her deeds.\"",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Then he began to denounce the towns in which most of his mighty works had been done, because they did not repent:",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "\"Woe to you, Chorazin! Woe to you, Bethsaida! For if the mighty works done in you had been done in Tyre and Sidon, they would have repented long ago in sackcloth and ashes.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But I tell you, it will be more bearable for Tyre and Sidon on the day of judgment than for you.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "And you, Capernaum—will you be exalted to heaven? You will descend to Hades. For if the mighty works done in you had been done in Sodom, it would have remained until this day.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "But I tell you that it will be more bearable for the land of Sodom on the day of judgment than for you.\"",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "At that time Jesus declared, \"I praise you, Father, Lord of heaven and earth, because you have hidden these things from the wise and intelligent and revealed them to infants.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "Yes, Father, for this was your good pleasure.\"",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "\"All things have been entrusted to me by my Father, and no one fully knows the Son except the Father, nor does anyone fully know the Father except the Son—and anyone to whom the Son chooses to reveal him.\"",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "\"Come to me, all you who are weary and burdened, and I will give you rest.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "Take my yoke upon you and learn from me, for I am gentle and lowly in heart, and you will find rest for your souls.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "For my yoke is easy and my burden is light.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The Coming One\" (v. 3)**: ὁ ἐρχόμενος functions as a messianic title—\"the one who is coming\" in a pregnant sense, referring to the expected deliverer. John's question is not \"Are you coming?\" but \"Are you *the* Coming One?\"—that is, the awaited figure.\n\n**\"Stumble because of me\" (v. 6)**: σκανδαλισθῇ refers to being caused to fall or trip—here metaphorically, to find Jesus an obstacle to faith, to take offense at him. The image is of a stumbling block.\n\n**\"Kingdom of the heavens\" (vv. 11, 12)**: Matthew consistently uses the plural τῶν οὐρανῶν, reflecting the Hebrew שָׁמַיִם (shamayim), which is grammatically plural. I preserve this Matthean distinctive.\n\n**\"Is being forcefully entered... the forceful are seizing it\" (v. 12)**: This notoriously difficult verse hinges on whether βιάζεται is passive (\"suffers violence\") or middle (\"advances forcefully\"). Either reading, combined with \"the forceful seize it\" (ἁρπάζουσιν), could be positive (eager seekers pressing in) or negative (violent opposition). My rendering preserves the ambiguity while leaning toward the middle voice—the kingdom is being entered with force by those who urgently press into it.\n\n**\"Beat your chests\" (v. 17)**: ἐκόψασθε (from κόπτω) means to strike or beat oneself as a sign of mourning—more specific than simply \"mourn.\"\n\n**\"Fully knows\" (v. 27)**: ἐπιγινώσκει is the intensive form of γινώσκω, indicating complete, intimate knowledge—not mere acquaintance but thorough recognition.\n\n**\"Infants\" (v. 25)**: νηπίοις specifically means infants or very young children, emphasizing the stark contrast with \"the wise and intelligent\" (σοφῶν καὶ συνετῶν). \"Little children\" softens this contrast.\n\n**\"Lowly in heart\" (v. 29)**: ταπεινός means low, humble, of low status—not merely \"humble\" in the modern sense of modest self-assessment, but genuinely lowly, unassuming in disposition."
    },
    {
      "chapter": 12,
      "verses": [
        {
          "verse": 1,
          "text": "At that time Jesus walked through the grain fields on the Sabbath. His disciples grew hungry and began to pluck heads of grain and eat them.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "But the Pharisees, seeing this, said to him, \"Look! Your disciples are doing what is not permitted on the Sabbath.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "He said to them, \"Have you not read what David did when he and those with him were hungry—",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "how he entered the house of God and they ate the bread of the Presence, which was not permitted for him to eat, nor for those with him, but only for the priests?",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Or have you not read in the Law that on the Sabbath the priests in the temple profane the Sabbath and yet are guiltless?",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But I tell you: something greater than the temple is here.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "If you had understood what this means—'I desire mercy and not sacrifice'—you would not have condemned the innocent.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For the Son of Man is lord of the Sabbath.\"",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Moving on from there, he went into their synagogue.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "And there was a man with a withered hand. They questioned him, asking, \"Is it permitted to heal on the Sabbath?\"—so that they might bring charges against him.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "He said to them, \"What person among you who has one sheep, if it falls into a pit on the Sabbath, will not take hold of it and lift it out?",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "How much more valuable, then, is a human being than a sheep! So it is permitted to do good on the Sabbath.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then he said to the man, \"Stretch out your hand.\" He stretched it out, and it was restored to full health like the other.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "But the Pharisees went out and plotted against him, how they might destroy him.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "Jesus, knowing this, withdrew from there. Many followed him, and he healed them all,",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "and he warned them not to make him known—",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "so that what was spoken through Isaiah the prophet might be fulfilled:",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "\"Look, my servant whom I have chosen, my beloved in whom my soul delights. I will put my Spirit upon him, and he will proclaim justice to the nations.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "He will not quarrel nor cry out, nor will anyone hear his voice in the streets.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "A bruised reed he will not break, and a smoldering wick he will not extinguish, until he brings justice to victory.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "And in his name the nations will hope.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Then they brought to him a demon-possessed man who was blind and mute, and he healed him so that the mute man both spoke and saw.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "All the crowds were astonished and kept saying, \"This couldn't be the Son of David, could it?\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "But when the Pharisees heard this, they said, \"This man does not cast out demons except by Beelzebul, the ruler of demons.\"",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Knowing their thoughts, he said to them, \"Every kingdom divided against itself is brought to ruin, and every city or household divided against itself will not stand.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "If Satan casts out Satan, he is divided against himself—how then will his kingdom stand?",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "And if I cast out demons by Beelzebul, by whom do your own sons cast them out? For this reason, they will be your judges.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "But if I cast out demons by the Spirit of God, then the kingdom of God has arrived upon you.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Or how can anyone enter the strong man's house and plunder his possessions unless he first binds the strong man? Then he can plunder his house.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "\"The one who is not with me is against me, and the one who does not gather with me scatters.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "For this reason I tell you: every sin and blasphemy will be forgiven people, but blasphemy against the Spirit will not be forgiven.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Whoever speaks a word against the Son of Man, it will be forgiven him. But whoever speaks against the Holy Spirit, it will not be forgiven him—neither in this age nor in the age to come.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "\"Either make the tree good and its fruit good, or make the tree rotten and its fruit rotten—for the tree is known by its fruit.",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "Brood of vipers! How can you speak good things when you are evil? For from the overflow of the heart the mouth speaks.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "The good person brings forth good things from a good treasury, and the evil person brings forth evil things from an evil treasury.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "But I tell you that for every worthless word that people speak, they will render an account on the day of judgment.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "For by your words you will be vindicated, and by your words you will be condemned.\"",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "Then some of the scribes and Pharisees answered him, saying, \"Teacher, we want to see a sign from you.\"",
          "paragraphStart": true
        },
        {
          "verse": 39,
          "text": "But he answered them, \"An evil and unfaithful generation demands a sign, and no sign will be given to it except the sign of Jonah the prophet.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "For just as Jonah was in the belly of the great sea creature three days and three nights, so the Son of Man will be in the heart of the earth three days and three nights.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "The men of Nineveh will rise up at the judgment with this generation and condemn it, because they repented at the proclamation of Jonah—and look, something greater than Jonah is here.",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "The queen of the South will rise up at the judgment with this generation and condemn it, because she came from the ends of the earth to hear the wisdom of Solomon—and look, something greater than Solomon is here.",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "\"When an unclean spirit goes out of a person, it wanders through waterless places seeking rest and finds none.",
          "paragraphStart": true
        },
        {
          "verse": 44,
          "text": "Then it says, 'I will return to my house from which I came.' And arriving, it finds it unoccupied, swept clean, and put in order.",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "Then it goes and brings along with itself seven other spirits more evil than itself, and they enter and settle there. And the final condition of that person becomes worse than the first. So it will be also with this evil generation.\"",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "While he was still speaking to the crowds, his mother and brothers stood outside, wanting to speak with him.",
          "paragraphStart": true
        },
        {
          "verse": 47,
          "text": "Someone said to him, \"Look, your mother and your brothers are standing outside, wanting to speak with you.\"",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "But he answered the one who told him, \"Who is my mother, and who are my brothers?\"",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "And stretching out his hand toward his disciples, he said, \"Look—my mother and my brothers!",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "For whoever does the will of my Father who is in the heavens—that person is my brother and sister and mother.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Something greater\" (vv. 6, 41, 42)**: The Greek μεῖζον and πλεῖον are neuter, not masculine. While Jesus is clearly the referent, the neuter form broadens the claim—it is not merely that a greater person is here, but that a greater reality, a greater order of things, has arrived. This preserves an important ambiguity in the original.\n\n**\"Bread of the Presence\" (v. 4)**: The Greek ἄρτους τῆς προθέσεως translates the Hebrew לֶחֶם הַפָּנִים, literally \"bread of the face/presence.\" This was the bread set before YHWH's presence in the tabernacle/temple.\n\n**\"Arrived upon you\" (v. 28)**: The verb ἔφθασεν carries a sense of arrival, of having reached or come upon. The kingdom has not merely \"come near\" but has arrived—an important distinction for the eschatological claim being made.\n\n**\"Unfaithful generation\" (v. 39)**: The Greek μοιχαλίς means \"adulterous,\" but this draws on the prophetic tradition where Israel's unfaithfulness to YHWH is depicted as marital infidelity (Hosea, Jeremiah, Ezekiel). \"Unfaithful\" captures this covenantal dimension better than the narrowly sexual connotation of \"adulterous\" in modern English.\n\n**\"Great sea creature\" (v. 40)**: The Greek κῆτος refers to a large sea creature or sea monster, not specifically a whale. The LXX of Jonah 2:1 uses the same term.\n\n**\"Worthless word\" (v. 36)**: The Greek ἀργόν (from ἀ-εργος, \"not working\") means idle, useless, or ineffective—words that accomplish nothing good. \"Careless\" in some translations suggests mere thoughtlessness, but the Greek emphasizes the word's lack of productive value.\n\n**\"This couldn't be the Son of David, could it?\" (v. 23)**: The particle μήτι in a question expects a negative answer but with an undertone of hope or wonder. The crowd is tentatively entertaining the possibility while not quite daring to affirm it.\n\n**\"Brood of vipers\" (v. 34)**: γεννήματα ἐχιδνῶν—literally \"offspring of vipers.\" This echoes John the Baptist's language (Matt 3:7) and implies they have inherited a poisonous nature from their spiritual parentage.\n\n**\"Treasury\" (v. 35)**: The Greek θησαυρός means a storehouse or treasury—a place where valuables are accumulated. The heart is portrayed as a repository from which one draws forth what has been stored there."
    },
    {
      "chapter": 13,
      "verses": [
        {
          "verse": 1,
          "text": "On that day Jesus went out of the house and sat beside the sea.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And such large crowds gathered around him that he got into a boat and sat down, while the whole crowd stood on the shore.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And he spoke many things to them in parables, saying: \"Look! A sower went out to sow.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And as he sowed, some seeds fell along the path, and the birds came and devoured them.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Other seeds fell on rocky ground where they did not have much soil, and they sprang up immediately because they had no depth of soil.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But when the sun rose they were scorched, and because they had no root they withered.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Other seeds fell among the thorns, and the thorns grew up and choked them.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But other seeds fell on the good soil and kept yielding fruit—some a hundredfold, some sixty, some thirty.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "The one who has ears, let him hear.\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And the disciples came and said to him, \"Why do you speak to them in parables?\"",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "He answered them, \"Because to you it has been given to know the mysteries of the kingdom of the heavens, but to them it has not been given.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For whoever has, more will be given to him and he will have abundance; but whoever does not have, even what he has will be taken from him.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "This is why I speak to them in parables: because seeing they do not see, and hearing they do not hear, nor do they understand.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And in them the prophecy of Isaiah is being fulfilled that says: 'You will hear and hear but never understand, and you will look and look but never perceive.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For the heart of this people has grown dull, and with their ears they hear with difficulty, and they have shut their eyes— lest they see with their eyes and hear with their ears and understand with their heart and turn back, and I would heal them.'",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But blessed are your eyes because they see, and your ears because they hear.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "For truly I tell you, many prophets and righteous ones longed to see what you see and did not see it, and to hear what you hear and did not hear it.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "\"So you, hear the parable of the sower.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "When anyone hears the word of the kingdom and does not understand it, the evil one comes and snatches away what was sown in his heart. This is what was sown along the path.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "What was sown on rocky ground—this is the one who hears the word and immediately receives it with joy,",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "but has no root in himself and lasts only a short time. When affliction or persecution arises because of the word, immediately he falls away.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "What was sown among thorns—this is the one who hears the word, but the anxiety of this age and the seduction of wealth choke the word, and it becomes fruitless.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "But what was sown on the good soil—this is the one who hears the word and understands it, who indeed bears fruit and produces: one a hundredfold, another sixty, another thirty.\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "He set another parable before them, saying: \"The kingdom of the heavens may be compared to a man who sowed good seed in his field.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "But while people were sleeping, his enemy came and sowed darnel among the wheat and went away.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "When the plants sprouted and produced grain, then the darnel also appeared.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "The servants of the master of the house came and said to him, 'Master, did you not sow good seed in your field? Where then did the darnel come from?'",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "He said to them, 'An enemy has done this.' The servants said to him, 'Then do you want us to go and gather it?'",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "But he said, 'No, lest in gathering the darnel you uproot the wheat along with it.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Let both grow together until the harvest, and at harvest time I will tell the reapers: First gather the darnel and bind it in bundles to burn it, but gather the wheat into my barn.'\"",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "He set another parable before them, saying: \"The kingdom of the heavens is like a mustard seed that a man took and sowed in his field.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "It is the smallest of all the seeds, but when it has grown it is larger than the garden plants and becomes a tree, so that the birds of the sky come and nest in its branches.\"",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "He told them another parable: \"The kingdom of the heavens is like leaven that a woman took and hid in three measures of flour until the whole batch was leavened.\"",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "All these things Jesus spoke to the crowds in parables, and without a parable he said nothing to them,",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "so that what was spoken through the prophet might be fulfilled: \"I will open my mouth in parables; I will pour forth things hidden since the foundation.\"",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "Then he left the crowds and went into the house. And his disciples came to him, saying, \"Explain to us the parable of the darnel of the field.\"",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "He answered: \"The one who sows the good seed is the Son of Man.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "The field is the world. The good seed—these are the sons of the kingdom. The darnel are the sons of the evil one,",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "and the enemy who sowed them is the devil. The harvest is the completion of the age, and the reapers are angels.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "Just as the darnel is gathered and burned with fire, so it will be at the completion of the age.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "The Son of Man will send his angels, and they will gather out of his kingdom all causes of stumbling and those who practice lawlessness,",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "and they will throw them into the furnace of fire. There will be weeping and gnashing of teeth.",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "Then the righteous will shine forth like the sun in the kingdom of their Father. The one who has ears, let him hear.",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "\"The kingdom of the heavens is like treasure hidden in a field that a man found and hid again. And in his joy he goes and sells everything he has and buys that field.",
          "paragraphStart": true
        },
        {
          "verse": 45,
          "text": "\"Again, the kingdom of the heavens is like a merchant seeking fine pearls.",
          "paragraphStart": true
        },
        {
          "verse": 46,
          "text": "Finding one pearl of great value, he went and sold everything he had and bought it.",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "\"Again, the kingdom of the heavens is like a dragnet cast into the sea that gathered fish of every kind.",
          "paragraphStart": true
        },
        {
          "verse": 48,
          "text": "When it was full, they hauled it up onto the shore, and sitting down they sorted the good into containers but threw out the worthless.",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "So it will be at the completion of the age. The angels will go out and separate the wicked from among the righteous",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "and throw them into the furnace of fire. There will be weeping and gnashing of teeth.\"",
          "paragraphStart": false
        },
        {
          "verse": 51,
          "text": "\"Have you understood all these things?\" They said to him, \"Yes.\"",
          "paragraphStart": true
        },
        {
          "verse": 52,
          "text": "And he said to them, \"Therefore every scribe who has been trained for the kingdom of the heavens is like a master of a household who brings out of his storeroom things new and old.\"",
          "paragraphStart": false
        },
        {
          "verse": 53,
          "text": "And when Jesus had finished these parables, he departed from there.",
          "paragraphStart": true
        },
        {
          "verse": 54,
          "text": "Coming to his hometown, he taught them in their synagogue, so that they were astonished and said, \"Where did this man get this wisdom and these powers?",
          "paragraphStart": false
        },
        {
          "verse": 55,
          "text": "Is this not the craftsman's son? Is not his mother called Mary, and his brothers James and Joseph and Simon and Judas?",
          "paragraphStart": false
        },
        {
          "verse": 56,
          "text": "And are not all his sisters here with us? Where then did he get all these things?\"",
          "paragraphStart": false
        },
        {
          "verse": 57,
          "text": "And they took offense at him. But Jesus said to them, \"A prophet is not without honor except in his hometown and in his own house.\"",
          "paragraphStart": false
        },
        {
          "verse": 58,
          "text": "And he did not do many mighty works there because of their unbelief.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Darnel\" (vv. 25-40)**: The Greek ζιζάνια refers specifically to *Lolium temulentum*, a weed virtually indistinguishable from wheat until the heads appear. The traditional \"tares\" is archaic and meaningless to modern readers; \"weeds\" is too generic and misses the parable's point about deceptive resemblance. \"Darnel\" preserves the specific agricultural reality that makes the parable work.\n\n**\"Kingdom of the heavens\"**: Matthew consistently uses βασιλεία τῶν οὐρανῶν (plural \"heavens\") where other gospels say \"kingdom of God\"—reflecting Jewish circumlocution avoiding the divine name. I preserve the plural to maintain Matthew's distinctive voice.\n\n**\"Completion of the age\" (vv. 39, 40, 49)**: συντέλεια αἰῶνος is better than \"end of the world\" or \"end of the age.\" The Greek implies consummation or bringing to completion, not mere termination, and αἰών refers to an age or epoch, not the physical world (κόσμος).\n\n**\"Seduction of wealth\" (v. 22)**: ἀπάτη τοῦ πλούτου suggests wealth's deceptive allure—it promises what it cannot deliver. \"Deceitfulness\" is accurate but passive; \"seduction\" captures the active, enticing quality of the deception.\n\n**\"Kept yielding\" (v. 8)**: The imperfect ἐδίδου suggests ongoing, continuous production rather than a single harvest event.\n\n**\"Pour forth\" (v. 35)**: ἐρεύξομαι literally means \"belch forth\" or \"utter with full voice\"—a vivid word for prophetic proclamation. \"Pour forth\" captures the abundance implied without the unfortunate connotations of \"belch\" in English.\n\n**\"Lasts only a short time\" (v. 21)**: πρόσκαιρος means \"lasting for a season, temporary.\" \"He is temporary\" sounds odd in English; this rendering clarifies the meaning while preserving the sense that the person's commitment has no endurance.\n\n**\"Craftsman's son\" (v. 55)**: τέκτων encompasses woodworking, construction, and general skilled craftsmanship. \"Carpenter\" is traditional but potentially too narrow; \"craftsman\" better reflects the range of work such a tradesman would perform.\n\n**\"Causes of stumbling\" (v. 41)**: σκάνδαλα originally referred to the trigger of a trap—something that causes someone to fall. The English \"scandals\" has drifted toward mere embarrassment or impropriety."
    },
    {
      "chapter": 14,
      "verses": [
        {
          "verse": 1,
          "text": "At that time, Herod the tetrarch heard the report about Jesus,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "and he said to his servants, \"This is John the Baptizer—he has been raised from the dead, and that is why these powers are at work in him.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For Herod had arrested John, bound him, and put him away in prison on account of Herodias, the wife of his brother Philip.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "John had been telling him, \"It is not lawful for you to have her.\"",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And though Herod wanted to kill him, he feared the crowd, because they regarded him as a prophet.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But when Herod's birthday celebration came, the daughter of Herodias danced before the guests and pleased Herod,",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "so that he promised with an oath to give her whatever she might ask.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Having been coached by her mother, she said, \"Give me here on a platter the head of John the Baptizer.\"",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "The king was grieved, but because of his oaths and his dinner guests, he commanded it to be given.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "He sent and had John beheaded in the prison.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "His head was brought on a platter and given to the girl, and she carried it to her mother.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "John's disciples came, took the body, and buried him. Then they went and reported it to Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "When Jesus heard this, he withdrew from there by boat to a desolate place by himself. But the crowds heard of it and followed him on foot from the towns.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "When he came ashore, he saw a great crowd, and his gut was wrenched with compassion for them, and he healed their sick.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "When evening came, the disciples approached him, saying, \"This place is desolate and the hour has already grown late. Send the crowds away so they can go into the villages and buy food for themselves.\"",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "But Jesus said to them, \"They have no need to go away. You give them something to eat.\"",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "They said to him, \"We have nothing here except five loaves and two fish.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "He said, \"Bring them here to me.\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "After ordering the crowds to recline on the grass, he took the five loaves and the two fish, and looking up to heaven, he said the blessing. Then, breaking the loaves, he gave them to the disciples, and the disciples gave them to the crowds.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Everyone ate and was satisfied, and they gathered up what remained of the broken pieces—twelve baskets full.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Those who had eaten were about five thousand men, not counting women and children.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Immediately he compelled the disciples to get into the boat and go ahead of him to the other side, while he dismissed the crowds.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "After sending the crowds away, he went up on the mountain by himself to pray. When evening came, he was there alone.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "The boat was already many stadia from land, being battered by the waves, for the wind was against them.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "In the fourth watch of the night, he came to them, walking on the sea.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "When the disciples saw him walking on the sea, they were terrified, saying, \"It is a ghost!\" and they cried out in fear.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "But immediately Jesus spoke to them, saying, \"Take courage—I am—do not be afraid.\"",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Peter answered him, \"Lord, if it is you, command me to come to you on the water.\"",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "He said, \"Come.\" And Peter stepped down from the boat and walked on the water and came toward Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "But when he saw the wind, he was afraid, and beginning to sink, he cried out, \"Lord, save me!\"",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Immediately Jesus stretched out his hand and took hold of him, saying to him, \"You of little faith—why did you waver?\"",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "When they got into the boat, the wind ceased.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "And those in the boat bowed down before him, saying, \"Truly you are God's Son.\"",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "When they had crossed over, they came to land at Gennesaret.",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "When the men of that place recognized him, they sent word throughout that whole surrounding region, and people brought to him all who were sick.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "They kept begging him to let them only touch the tassel of his cloak—and as many as touched it were healed completely.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Tetrarch\" (v. 1) / \"king\" (v. 9)**: Herod Antipas was technically a tetrarch (ruler of a quarter), not a king—a title Rome denied him. Matthew preserves this distinction in verse 1 but uses \"king\" (βασιλεύς) in verse 9, perhaps reflecting popular usage or the irony of his pretensions.\n\n**\"His gut was wrenched with compassion\" (v. 14)**: The Greek ἐσπλαγχνίσθη derives from σπλάγχνα (intestines, inward parts). This is visceral, gut-level compassion—not mere sympathy but a physical response. Most translations flatten this to \"had compassion,\" losing the bodily force.\n\n**\"I am\" (v. 27)**: The Greek ἐγώ εἰμι can mean simply \"It is I\" (self-identification), but it also carries divine resonance from the LXX's rendering of God's self-revelation (Exodus 3:14). In a theophany-like scene where Jesus walks on water and calms the storm, the ambiguity seems deliberate. I preserve both senses with the bare \"I am.\"\n\n**\"Waver\" (v. 31)**: The Greek διστάζω comes from δίς (twice)—to be of two minds, to hesitate between two positions. \"Doubt\" in modern English suggests intellectual uncertainty; the Greek implies divided attention or split commitment. Peter wasn't questioning Jesus's identity—he was looking at both Jesus and the wind.\n\n**\"Tassel\" (v. 36)**: The κράσπεδον is the tzitzit—the fringed tassels that observant Jewish men wore on their garments as commanded in Numbers 15:38-39. This detail shows Jesus wearing the visible markers of Jewish observance and connects to the woman with the hemorrhage (Matt 9:20).\n\n**\"Healed completely\" (v. 36)**: The Greek διεσώθησαν (from διασῴζω) is intensive—saved through, brought safely through, thoroughly healed. The prefix διά- intensifies the basic verb σῴζω (save/heal)."
    },
    {
      "chapter": 15,
      "verses": [
        {
          "verse": 1,
          "text": "Then Pharisees and scribes from Jerusalem come to Jesus, saying,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "\"Why do your disciples violate the tradition of the elders? For they do not wash their hands when they eat bread.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "But answering he said to them, \"Why do you also violate the commandment of God for the sake of your tradition?",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "For God said, 'Honor your father and your mother,' and, 'The one who speaks evil of father or mother must surely die.'",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But you say, 'Whoever says to father or mother, \"Whatever you might have benefited from me is a gift to God\"—",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "he certainly will not honor his father.' And so you have nullified the word of God for the sake of your tradition.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Performers! Isaiah prophesied rightly about you when he said:",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "'This people honors me with their lips, but their heart holds far from me.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "In vain they worship me, teaching as doctrines the commandments of human beings.'\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And calling the crowd to him, he said to them, \"Listen and understand:",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "It is not what enters the mouth that defiles a person, but what comes out of the mouth—this is what defiles a person.\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Then the disciples came and said to him, \"Do you know that the Pharisees were scandalized when they heard this saying?\"",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "But answering he said, \"Every plant that my heavenly Father did not plant will be uprooted.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Leave them alone. They are blind guides of the blind. And if a blind person guides a blind person, both will fall into a pit.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Then Peter answered and said to him, \"Explain this parable to us.\"",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "And he said, \"Are you also still without understanding?",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "Do you not grasp that everything entering the mouth passes into the stomach and is expelled into the latrine?",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "But the things that come out of the mouth come from the heart, and these defile the person.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "For out of the heart come evil intentions, murders, adulteries, sexual immoralities, thefts, false testimonies, slanders.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "These are what defile a person, but eating with unwashed hands does not defile a person.\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "And leaving from there, Jesus withdrew to the region of Tyre and Sidon.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "And look—a Canaanite woman from that region came out and was crying out, saying, \"Have mercy on me, Lord, Son of David! My daughter is severely tormented by a demon.\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "But he did not answer her a word. And his disciples came and kept urging him, saying, \"Send her away, because she keeps crying out behind us.\"",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "But answering he said, \"I was sent only to the lost sheep of the house of Israel.\"",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "But she came and knelt before him, saying, \"Lord, help me!\"",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "But answering he said, \"It is not right to take the children's bread and throw it to the little dogs.\"",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "But she said, \"Yes, Lord—yet even the little dogs eat from the crumbs that fall from their masters' table.\"",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "Then Jesus answered and said to her, \"O woman, great is your faith! Let it be done for you as you wish.\" And her daughter was healed from that hour.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "And moving on from there, Jesus came alongside the Sea of Galilee, and going up on the mountain, he sat down there.",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "And great crowds came to him, bringing with them the mute, blind, lame, maimed, and many others, and they laid them at his feet, and he healed them—",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "so that the crowd was amazed as they saw the mute speaking, the maimed restored, the lame walking, and the blind seeing. And they glorified the God of Israel.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Then Jesus called his disciples to him and said, \"I have compassion on the crowd, because they have already remained with me three days and have nothing to eat. I am not willing to send them away hungry, lest they collapse on the way.\"",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "And the disciples said to him, \"Where in this desolate place could we get enough loaves to satisfy such a large crowd?\"",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "And Jesus said to them, \"How many loaves do you have?\" And they said, \"Seven, and a few small fish.\"",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "And commanding the crowd to recline on the ground,",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "he took the seven loaves and the fish, and after giving thanks he broke them and kept giving them to the disciples, and the disciples to the crowds.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "And they all ate and were satisfied, and they picked up the leftover fragments—seven large baskets full.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "Now those who ate were four thousand men, besides women and children.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "And after dismissing the crowds, he got into the boat and came to the region of Magadan.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Violate\" (vv. 2, 3)**: The Greek παραβαίνω appears in both the Pharisees' accusation (v. 2) and Jesus's counter-question (v. 3). Preserving the same English word shows Jesus deliberately turning their language back on them—they accuse his disciples of violating tradition; he accuses them of violating God's commandment.\n\n**\"Performers\" (v. 7)**: Greek ὑποκριταί—theatrical actors. Jesus's charge is not that they privately believe differently than they publicly act, but that their religion is a performance for an audience.\n\n**\"Nullified\" (v. 6)**: Greek ἠκυρώσατε is legal/commercial terminology for voiding a contract or rendering something invalid. Their tradition doesn't just set aside God's word—it actively cancels it.\n\n**\"Defiles\" (vv. 11, 18, 20)**: Greek κοινοῖ literally means \"makes common\" (as opposed to holy). In Jewish purity discourse, this refers to ritual contamination that excludes one from sacred participation. \"Defile\" captures the religious weight better than \"make unclean.\"\n\n**\"Scandalized\" (v. 12)**: Greek ἐσκανδαλίσθησαν—caused to stumble over an obstacle (σκάνδαλον). More than mere offense; it implies being tripped up in their faith or caused to fall away.\n\n**\"Little dogs\" (vv. 26-27)**: Greek κυνάρια is a diminutive—not wild scavenging dogs (a common Jewish insult for Gentiles) but household pets. The woman brilliantly accepts Jesus's metaphor while noting that even household dogs receive something from the family table.\n\n**\"Large baskets\" (v. 37)**: Greek σπυρίδας refers to large woven baskets, distinct from the κόφινοι (\"small baskets\") in the feeding of the five thousand (14:20). The distinction may carry symbolic significance—κόφινοι were characteristically Jewish traveling baskets, while σπυρίδες were more general.\n\n**\"The God of Israel\" (v. 31)**: This unusual phrase (rather than simply \"God\") suggests the crowd includes Gentiles who recognize Israel's God through Jesus's healing works—fitting the geographic and narrative context following the Canaanite woman episode."
    },
    {
      "chapter": 16,
      "verses": [
        {
          "verse": 1,
          "text": "The Pharisees and Sadducees approached, and testing him, they asked him to display a sign from heaven for them.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He answered them, \"When evening comes, you say, 'Fair weather—for the sky is red.'",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "And in the morning, 'Stormy weather today—for the sky is red and threatening.' You know how to read the face of the sky, but you cannot read the signs of the times.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "An evil and unfaithful generation demands a sign, yet no sign will be given to it except the sign of Jonah.\" And leaving them behind, he departed.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "When the disciples crossed to the other side, they had forgotten to bring bread.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Jesus said to them, \"Watch out—beware of the leaven of the Pharisees and Sadducees.\"",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "They discussed this among themselves, saying, \"It is because we did not bring bread.\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But Jesus, knowing this, said, \"Why are you discussing among yourselves, you of little faith, that you have no bread?",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Do you still not understand? Do you not remember the five loaves for the five thousand, and how many baskets you collected?",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Or the seven loaves for the four thousand, and how many large baskets you collected?",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "How can you not understand that I was not speaking to you about bread? Beware of the leaven of the Pharisees and Sadducees.\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Then they understood that he had not told them to beware of the leaven in bread, but of the teaching of the Pharisees and Sadducees.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "When Jesus came into the region of Caesarea Philippi, he asked his disciples, \"Who do people say the Son of Man is?\"",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "They said, \"Some say John the Baptizer, others Elijah, and others Jeremiah or one of the prophets.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "He said to them, \"But you—who do you say I am?\"",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Simon Peter answered, \"You are the Messiah, the Son of the living God.\"",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Jesus answered him, \"Blessed are you, Simon son of Jonah, because flesh and blood did not reveal this to you, but my Father who is in the heavens.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "And I tell you that you are Peter, and on this rock I will build my assembly, and the gates of the realm of the dead will not overpower it.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "I will give you the keys of the kingdom of the heavens, and whatever you bind on earth will have been bound in heaven, and whatever you loose on earth will have been loosed in heaven.\"",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Then he strictly ordered the disciples to tell no one that he is the Messiah.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "From that time Jesus began to show his disciples that he must go to Jerusalem and suffer many things from the elders and chief priests and scribes, and be killed, and be raised on the third day.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "Peter took him aside and began to rebuke him, saying, \"God forbid, Lord! This will never happen to you.\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "But turning, he said to Peter, \"Get behind me, Satan! You are a stumbling block to me, because you are not thinking God's thoughts but human thoughts.\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Then Jesus said to his disciples, \"If anyone wants to come after me, let him renounce himself and take up his cross and follow me.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "For whoever wants to save his life will lose it, but whoever loses his life for my sake will find it.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "For what will a person gain if he acquires the whole world but forfeits his life? Or what will a person give in exchange for his life?",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "For the Son of Man is going to come in the glory of his Father with his angels, and then he will repay each person according to what they have done.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Truly I tell you, there are some standing here who will certainly not taste death until they see the Son of Man coming in his kingdom.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Unfaithful generation\" (v. 4)**: The Greek μοιχαλίς literally means \"adulterous,\" but this is prophetic covenant language (as in Hosea, Jeremiah, Ezekiel) describing Israel's spiritual unfaithfulness to God, her \"husband.\" \"Adulterous\" in modern English sounds merely sexual; \"unfaithful\" captures the covenantal betrayal.\n\n**\"Assembly\" (v. 18)**: Greek ἐκκλησία meant a called-out assembly or gathering—the term used in the Septuagint for Israel's congregation. \"Church\" carries too much institutional baggage for a first-century audience to have understood.\n\n**\"Gates of the realm of the dead\" (v. 18)**: Greek πύλαι ᾅδου. \"Hades\" was the Greek term for the underworld/realm of the dead, equivalent to Hebrew Sheol. \"Hell\" in modern English implies a place of punishment, which is not what ᾅδης denotes. The \"gates\" of Hades represent death's power to hold the dead.\n\n**\"Will have been bound/loosed\" (v. 19)**: The Greek construction (ἔσται δεδεμένον/λελυμένον) uses a future form of \"to be\" with a perfect passive participle. This suggests not simply \"will be bound\" but \"will be in a state of already having been bound\"—Peter's earthly decisions ratify heavenly realities rather than determining them.\n\n**\"God forbid\" (v. 22)**: Greek Ἵλεώς σοι is an exclamation invoking divine mercy to prevent something—literally \"May [God be] gracious to you!\" The sense is \"May God prevent this!\" rather than the flat \"Never!\" of some translations.\n\n**\"Renounce himself\" (v. 24)**: Greek ἀπαρνέομαι means to disown or utterly deny—the same verb used for Peter's denial of Jesus. \"Deny himself\" in modern English sounds like mere self-discipline; this is total self-renunciation.\n\n**\"Life\" (vv. 25-26)**: Greek ψυχή can mean \"soul\" or \"life\" or \"self.\" In this context about saving and losing, \"life\" captures the whole-person stakes better than \"soul,\" which modern readers tend to limit to an immaterial component."
    },
    {
      "chapter": 17,
      "verses": [
        {
          "verse": 1,
          "text": "And after six days, Jesus takes Peter and James and John his brother, and leads them up onto a high mountain by themselves.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And he was transformed before them, and his face shone like the sun, and his garments became white as light.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And suddenly Moses and Elijah appeared to them, conversing with him.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Peter spoke up and said to Jesus, \"Lord, it is good for us to be here. If you wish, I will make three shelters here—one for you, one for Moses, and one for Elijah.\"",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "While he was still speaking, suddenly a luminous cloud overshadowed them, and suddenly a voice from the cloud said, \"This is my Son, the Beloved, in whom I delight. Listen to him!\"",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "When the disciples heard this, they fell face down and were utterly terrified.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "But Jesus came and touched them and said, \"Rise, and do not be afraid.\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And lifting their eyes, they saw no one except Jesus alone.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "As they were coming down from the mountain, Jesus commanded them, \"Tell no one the vision until the Son of Man has been raised from the dead.\"",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "And the disciples asked him, \"Why then do the scribes say that Elijah must come first?\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "He answered, \"Elijah is indeed coming and will restore all things.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "But I tell you that Elijah has already come, and they did not recognize him but did to him whatever they pleased. So too the Son of Man is about to suffer at their hands.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then the disciples understood that he was speaking to them about John the Baptist.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "When they came to the crowd, a man approached him, falling on his knees before him",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "and saying, \"Lord, have mercy on my son, because he is moonstruck and suffers terribly—for he often falls into fire and often into water.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "I brought him to your disciples, and they were unable to heal him.\"",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Jesus answered, \"O faithless and twisted generation! How long will I be with you? How long must I bear with you? Bring him here to me.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And Jesus rebuked it, and the demon came out of him, and the boy was healed from that hour.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Then the disciples came to Jesus privately and said, \"Why were we unable to cast it out?\"",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "He said to them, \"Because of your meager faith. For truly I tell you, if you have faith like a mustard seed, you will say to this mountain, 'Move from here to there,' and it will move, and nothing will be impossible for you.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "While they were gathering in Galilee, Jesus said to them, \"The Son of Man is about to be handed over into human hands,",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "and they will kill him, and on the third day he will be raised.\" And they were deeply grieved.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "When they came to Capernaum, those who collected the two-drachma tax approached Peter and said, \"Does your teacher not pay the two-drachma tax?\"",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "He said, \"Yes.\" And when he came into the house, Jesus spoke first, saying, \"What do you think, Simon? From whom do earthly kings collect tolls and taxes—from their own sons or from others?\"",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "When he said, \"From others,\" Jesus said to him, \"Then the sons are exempt.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "But so that we do not give them offense, go to the sea and cast a hook, and take the first fish that comes up. When you open its mouth, you will find a four-drachma coin. Take that and give it to them for me and for you.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Transformed\" (v. 2)**: The Greek μετεμορφώθη gives us our word \"metamorphosis.\" The traditional \"transfigured\" is somewhat opaque in modern English; \"transformed\" captures the sense of a fundamental change in visible form.\n\n**\"Suddenly\" (vv. 3, 5)**: Greek ἰδού is typically rendered \"behold,\" but this is archaic. The word functions as an attention marker signaling something unexpected or dramatic. \"Suddenly\" preserves this narrative function.\n\n**\"The Beloved\" (v. 5)**: Rendering ὁ ἀγαπητός as a title rather than merely an adjective (\"my beloved son\") captures the weight of this designation, which echoes the Servant in Isaiah and the binding of Isaac.\n\n**\"Listen to him\" (v. 5)**: This echoes Deuteronomy 18:15, where Moses promises a prophet like himself whom Israel must \"listen to\"—an allusion the original audience would recognize.\n\n**\"Moonstruck\" (v. 15)**: The Greek σεληνιάζεται literally means \"affected by the moon\" (from σελήνη, moon). While this referred to what we would call epileptic symptoms, rendering it simply as \"epileptic\" loses the ancient understanding. \"Moonstruck\" preserves the actual Greek term while remaining comprehensible.\n\n**\"Meager faith\" (v. 20)**: Greek ὀλιγοπιστία means literally \"little-faith\" or \"scant-faith.\" \"Meager\" captures both the smallness and the inadequacy better than \"little,\" which sounds merely quantitative.\n\n**\"Two-drachma tax\" / \"four-drachma coin\" (vv. 24, 27)**: The δίδραχμα was the temple tax (half-shekel) owed annually by every adult Jewish male. The στατήρ found in the fish was worth four drachmas—exactly enough for two people (Jesus and Peter). Retaining the monetary terms preserves the precise narrative logic.\n\n**Verse 21 omitted**: Following the critical text, verse 21 (\"But this kind does not go out except by prayer and fasting\") is absent from the earliest manuscripts and appears to be a later addition."
    },
    {
      "chapter": 18,
      "verses": [
        {
          "verse": 1,
          "text": "At that hour the disciples came to Jesus, saying, \"Who then is greatest in the kingdom of the heavens?\"",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And calling a child over, he set the child in their midst",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "and said, \"Truly I tell you, unless you turn and become like children, you will never enter the kingdom of the heavens.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "So whoever humbles himself like this child—this one is the greatest in the kingdom of the heavens.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And whoever receives one such child in my name receives me.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "\"But whoever causes one of these little ones who believe in me to stumble—it would be better for him to have a heavy millstone hung around his neck and to be drowned in the open sea.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Woe to the world because of stumbling blocks! For it is inevitable that stumbling blocks come, but woe to the person through whom the stumbling block comes.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "\"If your hand or your foot causes you to stumble, cut it off and throw it away from you. It is better for you to enter into life maimed or lame than to have two hands or two feet and be thrown into the eternal fire.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "And if your eye causes you to stumble, tear it out and throw it away from you. It is better for you to enter into life one-eyed than to have two eyes and be thrown into the Gehenna of fire.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "\"See that you do not look down on one of these little ones. For I tell you that their angels in the heavens continually see the face of my Father who is in the heavens.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "\"What do you think? If a man has a hundred sheep and one of them wanders off, will he not leave the ninety-nine on the hills and go searching for the one that wandered?",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "And if he finds it, truly I tell you, he rejoices over it more than over the ninety-nine that did not wander.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "In the same way, it is not the will of your Father who is in the heavens that one of these little ones should perish.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "\"If your brother sins against you, go and correct him between you and him alone. If he listens to you, you have won back your brother.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "But if he does not listen, take with you one or two others, so that by the testimony of two or three witnesses every matter may be established.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "If he refuses to listen to them, tell it to the assembly. And if he refuses to listen even to the assembly, let him be to you as a Gentile and a tax collector.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "\"Truly I tell you, whatever you bind on earth will have been bound in heaven, and whatever you loose on earth will have been loosed in heaven.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "Again, truly I tell you, if two of you agree on earth about any matter you ask for, it will be done for you by my Father who is in the heavens.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For where two or three are gathered in my name, there I am in their midst.\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Then Peter came to him and said, \"Lord, how many times will my brother sin against me and I must forgive him? Up to seven times?\"",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "Jesus said to him, \"I do not say to you up to seven times, but up to seventy-seven times.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "\"For this reason the kingdom of the heavens may be compared to a king who decided to settle accounts with his slaves.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "When he began settling, one debtor was brought before him who owed ten thousand talents.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Since he had no way to repay, the master ordered him to be sold, along with his wife and children and everything he owned, and payment to be made.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "So the slave fell down and was bowing before him, saying, 'Be patient with me and I will repay you everything.'",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "And the master of that slave, moved in his gut with compassion, released him and forgave him the debt.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "\"But that slave went out and found one of his fellow slaves who owed him a hundred denarii, and grabbing him by the throat, he was choking him, saying, 'Pay back what you owe!'",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "So his fellow slave fell down and begged him, saying, 'Be patient with me and I will repay you.'",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "But he refused. Instead he went and threw him into prison until he could repay what was owed.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "\"When his fellow slaves saw what had happened, they were deeply grieved, and they went and reported to their master everything that had taken place.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "Then his master summoned him and said to him, 'Wicked slave! I forgave you that entire debt because you begged me.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "Should you not also have shown mercy to your fellow slave, just as I showed mercy to you?'",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "And in anger his master handed him over to the torturers until he could repay all that was owed.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "So also my heavenly Father will do to you, if each of you does not forgive your brother from your heart.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Causes to stumble\" (vv. 6–9)**: The Greek σκανδαλίζω derives from σκάνδαλον, the trigger-stick of a trap. The word means to ensnare, trip up, or cause to fall into sin—not merely to offend or shock as modern \"scandalize\" suggests. \"Cause to stumble\" captures the original metaphor of tripping someone on their path.\n\n**\"Heavy millstone\" (v. 6)**: Greek μύλος ὀνικός literally means \"a millstone turned by a donkey\"—a large commercial millstone as opposed to the small hand-mills used domestically. The point is the massive weight.\n\n**\"Gehenna\" (v. 9)**: I have retained \"Gehenna\" rather than translating as \"hell\" because it refers specifically to the Valley of Hinnom (גֵּי בֶן־הִנֹּם) south of Jerusalem, associated with child sacrifice to Molech and later with fiery judgment. First-century Jewish listeners would have understood this specific geographical and theological reference.\n\n**\"Assembly\" (v. 17)**: Greek ἐκκλησία here cannot mean \"church\" in the later institutional sense. In its Jewish context, it echoes the Hebrew קָהָל—the gathered community of God's people. \"Assembly\" preserves this without anachronism.\n\n**\"Will have been bound/loosed\" (v. 18)**: The Greek uses future + perfect passive (ἔσται δεδεμένα/λελυμένα), suggesting the heavenly reality precedes or validates the earthly action. This reflects rabbinic authority language about declaring things forbidden or permitted.\n\n**\"Seventy-seven times\" (v. 22)**: The Greek ἑβδομηκοντάκις ἑπτά could mean either \"seventy times seven\" (490) or \"seventy-seven.\" The phrase deliberately echoes Lamech's boast of vengeance in Genesis 4:24 (LXX), inverting revenge into unlimited forgiveness.\n\n**\"Ten thousand talents\" (v. 24)**: μύριοι (ten thousand) was the largest number Greeks had a single word for; τάλαντον was the largest unit of currency. This astronomical sum—perhaps equivalent to 200,000 years of a laborer's wages—is intentionally absurd and unpayable, heightening the contrast with the hundred denarii (roughly 100 days' wages) in verse 28.\n\n**\"Moved in his gut with compassion\" (v. 27)**: Greek σπλαγχνίζομαι refers to being moved in one's σπλάγχνα—the bowels or internal organs understood as the seat of deep emotion. This is visceral, gut-level compassion, not merely cognitive sympathy.\n\n**\"Torturers\" (v. 34)**: Greek βασανισταί refers specifically to those who extract payment through torture, not merely jailers. The word does not soften the severity of the judgment.\n\n**Verse 11**: This verse is absent from the earliest manuscripts and is not included in the critical text. It appears to be a later scribal addition from Luke 19:10."
    },
    {
      "chapter": 19,
      "verses": [
        {
          "verse": 1,
          "text": "And it happened that when Jesus finished these sayings, he departed from Galilee and came to the region of Judea beyond the Jordan.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Large crowds followed him, and he healed them there.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Some Pharisees came to him, testing him, and said, \"Is it lawful for a man to divorce his wife for any cause?\"",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "He answered, \"Have you not read that the one who created them from the beginning made them male and female,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "and said, 'For this reason a man will leave his father and mother and be bonded to his wife, and the two will become one flesh'?",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "So they are no longer two, but one flesh. Therefore what God has yoked together, let no person separate.\"",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "They said to him, \"Then why did Moses command giving a certificate of divorce and sending her away?\"",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "He said to them, \"Moses permitted you to divorce your wives because of your hardness of heart, but from the beginning it was not so.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And I say to you: whoever divorces his wife—not for sexual unfaithfulness—and marries another commits adultery, and the one who marries a divorced woman commits adultery.\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "The disciples said to him, \"If this is the situation between a man and his wife, it is not advantageous to marry.\"",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "But he said to them, \"Not everyone can accept this teaching, but only those to whom it has been given.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For there are eunuchs who were born that way from their mother's womb, and there are eunuchs who were made eunuchs by others, and there are eunuchs who have made themselves eunuchs for the sake of the kingdom of the heavens. Let the one who can accept this accept it.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then children were brought to him so that he might lay his hands on them and pray. But the disciples rebuked them.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Jesus said, \"Let the children come and do not prevent them from coming to me, for the kingdom of the heavens belongs to such as these.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And after laying his hands on them, he went on from there.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And look—someone came up to him and said, \"Teacher, what good thing must I do to obtain eternal life?\"",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "He said to him, \"Why do you ask me about what is good? One alone is good. But if you want to enter into life, keep the commandments.\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "He said to him, \"Which ones?\" Jesus said, \"You shall not murder, you shall not commit adultery, you shall not steal, you shall not bear false witness,",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "honor your father and mother, and love your neighbor as yourself.\"",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "The young man said to him, \"All these I have kept. What am I still lacking?\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Jesus said to him, \"If you want to be complete, go, sell your possessions and give to the destitute, and you will have treasure in the heavens—then come, follow me.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "When the young man heard this, he went away grieving, for he had many estates.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Jesus said to his disciples, \"Truly I tell you, it will be hard for a rich person to enter the kingdom of the heavens.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Again I tell you, it is easier for a camel to pass through the eye of a needle than for a rich person to enter the kingdom of God.\"",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "When the disciples heard this, they were utterly astonished and said, \"Who then can be saved?\"",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Jesus looked directly at them and said, \"With humans this is impossible, but with God all things are possible.\"",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Then Peter responded, \"Look, we have left everything and followed you. What then will there be for us?\"",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "Jesus said to them, \"Truly I tell you, in the renewal of all things, when the Son of Man sits on his glorious throne, you who have followed me will also sit on twelve thrones, judging the twelve tribes of Israel.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "And everyone who has left houses or brothers or sisters or father or mother or children or fields for the sake of my name will receive a hundredfold and will inherit eternal life.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "But many who are first will be last, and the last will be first.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"For any cause\" (v. 3)**: The phrase κατὰ πᾶσαν αἰτίαν reflects a specific first-century rabbinic debate. The school of Hillel interpreted Deuteronomy 24:1 (\"something indecent\") to permit divorce \"for any cause,\" while Shammai restricted it to sexual misconduct. The Pharisees are testing which side Jesus takes.\n\n**\"Bonded\" (v. 5)**: The Greek κολληθήσεται means to be glued or cemented together—a stronger image than simply \"joined\" or \"united.\"\n\n**\"Yoked together\" (v. 6)**: The verb συνέζευξεν derives from ζεῦγος (yoke), evoking the image of two animals joined under a single yoke, pulling together as one.\n\n**\"Sexual unfaithfulness\" (v. 9)**: The Greek πορνεία is broader than \"adultery\" (μοιχεία) and can include various sexual transgressions. \"Fornication\" is archaic; \"sexual immorality\" is vague. Some scholars argue it refers specifically to marriages within prohibited degrees of kinship, but \"sexual unfaithfulness\" captures the marital context while preserving some breadth.\n\n**\"Accept\" (vv. 11-12)**: The verb χωρέω literally means \"to make room for\" or \"to have space for.\" Jesus uses it twice, creating a wordplay: not everyone has room for this teaching, but let the one who can make room, make room.\n\n**\"Complete\" (v. 21)**: The Greek τέλειος means whole, mature, or having reached one's purpose—not merely \"morally perfect\" in the modern sense. The young man asks what he lacks (ὑστερῶ); Jesus tells him how to become complete.\n\n**\"Destitute\" (v. 21)**: The Greek πτωχοῖς refers not merely to those with less money but to those reduced to begging—the desperately poor.\n\n**\"Estates\" (v. 22)**: The Greek κτήματα specifically refers to landed property, not just possessions generally. This young man was a landowner.\n\n**\"Renewal of all things\" (v. 28)**: The Greek παλιγγενεσία (literally \"re-genesis\" or \"new birth\") was used in Stoic philosophy for cosmic renewal. Here it refers to the eschatological restoration—what Jewish expectation called the world to come. \"Regeneration\" is too individualistic in modern English."
    },
    {
      "chapter": 20,
      "verses": [
        {
          "verse": 1,
          "text": "\"For the kingdom of the heavens is like a landowner who went out at dawn to hire workers for his vineyard.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "After agreeing with the workers on a denarius for the day, he sent them into his vineyard.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And going out about the third hour, he saw others standing idle in the marketplace.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "He said to them, 'You go into the vineyard too, and I will give you whatever is fair.'",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "So they went. Going out again about the sixth hour and the ninth hour, he did the same.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "About the eleventh hour he went out and found others standing around, and he says to them, 'Why have you been standing here idle all day?'",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "They say to him, 'Because no one hired us.' He says to them, 'You go into the vineyard too.'",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "\"When evening came, the master of the vineyard says to his manager, 'Call the workers and pay them their wages, beginning from the last to the first.'",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "When those hired about the eleventh hour came, they received a denarius each.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And when the first came, they expected to receive more—but they also received a denarius each.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Upon receiving it, they began grumbling against the landowner,",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "saying, 'These last ones worked a single hour, and you have made them equal to us who bore the burden of the day and the scorching heat!'",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "\"But he answered one of them, 'Friend, I am not treating you unjustly. Did you not agree with me on a denarius?",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Take what is yours and go. I choose to give to this last one the same as to you.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Am I not free to do what I wish with what is mine? Or is your eye evil because I am generous?'",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "\"So the last will be first and the first will be last.\"",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "As Jesus was going up to Jerusalem, he took the twelve disciples aside privately, and on the road he said to them,",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "\"Look, we are going up to Jerusalem, and the Son of Man will be handed over to the chief priests and scribes. They will condemn him to death",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "and hand him over to the Gentiles to be mocked and flogged and crucified—and on the third day he will be raised.\"",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Then the mother of Zebedee's sons approached him with her sons, kneeling before him and asking something of him.",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "He said to her, \"What do you want?\" She says to him, \"Grant that these two sons of mine may sit, one at your right hand and one at your left, in your kingdom.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But Jesus answered, \"You do not know what you are asking. Are you able to drink the cup I am about to drink?\" They say to him, \"We are able.\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "He says to them, \"My cup you will indeed drink. But to sit at my right and at my left is not mine to give; rather, it is for those for whom it has been prepared by my Father.\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "When the ten heard this, they became indignant at the two brothers.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "But Jesus called them to himself and said, \"You know that the rulers of the nations lord it over them, and their great ones wield authority over them.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "It shall not be so among you. Rather, whoever wants to become great among you must be your servant,",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "and whoever wants to be first among you must be your slave—",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "just as the Son of Man did not come to be served but to serve, and to give his life as a ransom in place of many.\"",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "As they were leaving Jericho, a large crowd followed him.",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "And look—two blind men sitting beside the road heard that Jesus was passing by and cried out, \"Lord, have mercy on us, Son of David!\"",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "The crowd rebuked them, telling them to be silent. But they cried out all the louder, \"Lord, have mercy on us, Son of David!\"",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Jesus stopped and called to them and said, \"What do you want me to do for you?\"",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "They say to him, \"Lord, that our eyes may be opened.\"",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Moved with compassion, Jesus touched their eyes, and immediately they received their sight and followed him.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Is your eye evil\" (v. 15)**: The Greek ὁ ὀφθαλμός σου πονηρός preserves a Semitic idiom (עין רעה) referring to envy and stinginess—the opposite of the \"good eye\" that signifies generosity. Most translations render this as \"envious,\" which captures the sense but loses the idiom. I retained the literal phrase because the context makes the meaning clear: \"Is your eye evil because I am generous?\"\n\n**\"Friend\" (v. 13)**: The Greek ἑταῖρε is not the warm term φίλος but a more formal, even cool address. In Matthew, Jesus uses it for the man without wedding garments (22:12) and for Judas at his betrayal (26:50). It carries a note of distance, perhaps disappointment—closer to \"my man\" than \"dear friend.\"\n\n**\"Lord it over... wield authority over\" (v. 25)**: Both verbs (κατακυριεύουσιν, κατεξουσιάζουσιν) carry the intensive prefix κατα-, suggesting dominance and oppression rather than mere leadership. \"Wield authority\" captures the forceful exercise of power better than simple \"exercise authority.\"\n\n**\"In place of many\" (v. 28)**: The preposition ἀντί carries substitutionary force—\"instead of,\" \"in exchange for.\" While \"for many\" is not wrong, \"in place of many\" makes the substitutionary nature of λύτρον (ransom) more explicit.\n\n**\"Moved with compassion\" (v. 34)**: The verb σπλαγχνίζομαι derives from σπλάγχνα (intestines/gut), denoting visceral, deep-seated compassion—not mere pity but something felt in the core of one's being.\n\n**Historic present tense**: The Greek frequently shifts to present tense in narrative (λέγει, \"he says\") for vividness. I preserved this in most dialogue introductions to maintain the text's immediacy."
    },
    {
      "chapter": 21,
      "verses": [
        {
          "verse": 1,
          "text": "And when they drew near to Jerusalem and came to Bethphage at the Mount of Olives, then Jesus sent two disciples,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "saying to them, \"Go into the village opposite you, and immediately you will find a donkey tied up, and a colt with her. Untie them and bring them to me.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And if anyone says anything to you, say, 'The Lord has need of them.' And he will send them at once.\"",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Now this took place so that what was spoken through the prophet might be fulfilled:",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "\"Tell the daughter of Zion: Look—your king is coming to you, gentle and mounted on a donkey, on a colt, the offspring of a beast of burden.\"",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "The disciples went and did just as Jesus instructed them.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "They brought the donkey and the colt and placed their cloaks on them, and he sat on the cloaks.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Most of the crowd spread their own cloaks on the road, while others were cutting branches from the trees and spreading them on the road.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And the crowds going ahead of him and those following kept crying out: \"Hosanna to the Son of David! Blessed is the one who comes in the name of the Lord! Hosanna in the highest heavens!\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And when he entered Jerusalem, the whole city was shaken, saying, \"Who is this?\"",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "And the crowds kept saying, \"This is the prophet Jesus, from Nazareth of Galilee.\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And Jesus entered the temple and drove out all those selling and buying in the temple, and he overturned the tables of the money changers and the seats of those selling doves.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "And he says to them, \"It is written, 'My house shall be called a house of prayer,' but you are making it a den of bandits.\"",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And blind and lame people came to him in the temple, and he healed them.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "But when the chief priests and the scribes saw the wonders he performed and the children crying out in the temple, \"Hosanna to the Son of David,\" they were indignant",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "and said to him, \"Do you hear what these are saying?\" Jesus says to them, \"Yes. Have you never read, 'Out of the mouths of infants and nursing babies you have fashioned praise'?\"",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "And leaving them behind, he went out of the city to Bethany and spent the night there.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Early in the morning, returning to the city, he grew hungry.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "And seeing a fig tree by the road, he went up to it and found nothing on it except leaves only. And he says to it, \"May fruit never come from you again.\" And the fig tree withered at once.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "When the disciples saw this, they were astonished, saying, \"How did the fig tree wither so suddenly?\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Jesus answered them, \"Truly I tell you, if you have faith and do not waver, not only will you do what was done to the fig tree, but even if you say to this mountain, 'Be lifted up and thrown into the sea,' it will happen.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "And whatever you ask in prayer, believing, you will receive.\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "When he came into the temple, the chief priests and the elders of the people approached him while he was teaching, saying, \"By what authority are you doing these things? And who gave you this authority?\"",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Jesus answered them, \"I too will ask you one question; if you tell me the answer, I will tell you by what authority I do these things.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "The baptism of John—where did it come from? From heaven, or from human origin?\" They deliberated among themselves: \"If we say, 'From heaven,' he will say to us, 'Then why did you not believe him?'",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "But if we say, 'From human origin,' we fear the crowd—for they all regard John as a prophet.\"",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "So they answered Jesus, \"We do not know.\" He said to them, \"Neither will I tell you by what authority I do these things.\"",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "\"But what do you think? A man had two sons. He went to the first and said, 'Son, go work in the vineyard today.'",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "He answered, 'I will not'—but later, having a change of heart, he went.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "The father went to the second and said the same. He answered, 'I will, sir'—but did not go.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Which of the two did the will of the father?\" They say, \"The first.\" Jesus says to them, \"Truly I tell you, the tax collectors and the prostitutes are going into the kingdom of God ahead of you.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "For John came to you walking in the way of righteousness, and you did not believe him. But the tax collectors and the prostitutes believed him. And you, even after seeing this, did not have a change of heart afterward so as to believe him.\"",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "\"Hear another parable. There was a landowner who planted a vineyard. He put a fence around it, dug a winepress in it, and built a watchtower. Then he leased it to tenant farmers and went abroad.",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "When the season for fruit drew near, he sent his slaves to the tenant farmers to collect his produce.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "But the tenant farmers seized his slaves: one they beat, one they killed, one they stoned.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "Again he sent other slaves, more than the first group, and they did the same to them.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "Finally he sent his son to them, thinking, 'They will respect my son.'",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "But the tenant farmers, seeing the son, said among themselves, 'This is the heir. Come, let us kill him and seize his inheritance!'",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "And they grabbed him, threw him out of the vineyard, and killed him.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "When the owner of the vineyard comes, what will he do to those tenant farmers?\"",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "They say to him, \"Those wretches—he will bring them to a wretched end, and he will lease the vineyard to other tenant farmers who will render to him the produce at the proper times.\"",
          "paragraphStart": true
        },
        {
          "verse": 42,
          "text": "Jesus says to them, \"Have you never read in the Scriptures: 'The stone the builders rejected— this has become the cornerstone. This came from the Lord, and it is marvelous in our eyes'?",
          "paragraphStart": true
        },
        {
          "verse": 43,
          "text": "For this reason I tell you, the kingdom of God will be taken from you and given to a nation that produces its fruit.",
          "paragraphStart": true
        },
        {
          "verse": 44,
          "text": "And whoever falls on this stone will be shattered; and whomever it falls upon, it will scatter like chaff.\"",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "When the chief priests and the Pharisees heard his parables, they recognized that he was speaking about them.",
          "paragraphStart": true
        },
        {
          "verse": 46,
          "text": "And though they sought to arrest him, they feared the crowds, since they regarded him as a prophet.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The Lord has need of them\" (v. 3)**: The Greek κύριος carries productive ambiguity—it could mean simply \"the owner\" or the more theologically loaded \"the Lord.\" Matthew's readers would hear both senses simultaneously.\n\n**\"He sat on the cloaks\" (v. 7)**: The Greek αὐτῶν (them) is plural and grammatically ambiguous, leading to occasional confusion about whether Jesus rode both animals. In context, it refers to the cloaks placed on the animals. I have made this explicit.\n\n**\"Shaken\" (v. 10)**: ἐσείσθη shares its root with \"seismic\"—this is earthquake language. The city is not merely curious but deeply disturbed.\n\n**\"Den of bandits\" (v. 13)**: The Greek λῃσταί refers to violent robbers or brigands, not petty thieves. Jesus quotes Jeremiah 7:11, where the prophet condemned those who made the temple a refuge while practicing injustice. The charge is about violent exploitation, not mere dishonesty.\n\n**\"Fashioned praise\" (v. 16)**: κατηρτίσω means to prepare, complete, or fashion—God has actively prepared praise from children's mouths, not merely permitted it.\n\n**\"Do not waver\" (v. 21)**: διακριθῆτε means to be divided within oneself, to be torn between two minds. This captures the internal conflict better than simple \"doubt.\"\n\n**\"Having a change of heart\" (vv. 29, 32)**: μεταμεληθείς and μετεμελήθητε indicate regret leading to changed behavior—distinct from μετανοέω (repentance). The parallel between the son's \"change of heart\" and what the leaders refused creates a verbal link in Greek that I have preserved.\n\n**\"Those wretches—he will bring them to a wretched end\" (v. 41)**: Κακοὺς κακῶς ἀπολέσει is a figura etymologica (wordplay using cognates): literally \"evil ones evilly he will destroy.\" The translation attempts to preserve this rhetorical punch.\n\n**\"A nation\" (v. 43)**: ἔθνει is singular, not plural \"nations\" (ἔθνη). This is theologically significant—the kingdom passes to a single people (the church), not generically to Gentiles.\n\n**\"Scatter like chaff\" (v. 44)**: λικμήσει refers to the winnowing process—being scattered to the wind like crushed grain husks. This evokes complete destruction and dispersal."
    },
    {
      "chapter": 22,
      "verses": [
        {
          "verse": 1,
          "text": "And responding, Jesus again spoke to them in parables, saying:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "\"The kingdom of the heavens may be compared to a king who prepared a wedding celebration for his son.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "He sent his slaves to call those who had been invited to the wedding, but they refused to come.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Again he sent other slaves, saying, 'Tell those who have been invited: Look, I have prepared my feast—my oxen and fattened cattle have been slaughtered, and everything is ready. Come to the wedding celebration.'",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But they paid no attention and went off—one to his own field, another to his business.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "The rest seized his slaves, mistreated them violently, and killed them.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "The king was enraged, and sending his armies, he destroyed those murderers and burned their city.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Then he says to his slaves, 'The wedding feast is ready, but those who were invited were not worthy.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "So go to the places where the roads lead out, and invite to the wedding celebration as many as you find.'",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And those slaves went out into the roads and gathered everyone they found, both wicked and good, and the wedding hall was filled with guests reclining at table.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "\"But when the king came in to observe those reclining at table, he saw there a man not wearing wedding clothing.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "And he says to him, 'Comrade, how did you get in here without wedding clothing?' And he was silenced.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then the king said to the attendants, 'Bind his feet and hands and throw him out into the outer darkness. There will be weeping and grinding of teeth.'",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For many are called, but few are chosen.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Then the Pharisees went and plotted together how they might trap him with a statement.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "They send their disciples to him along with the Herodians, saying, \"Teacher, we know that you are truthful and teach the way of God in truth, and you defer to no one, for you do not regard people's standing.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "So tell us what you think: Is it permitted to pay the census tax to Caesar, or not?\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "But Jesus, knowing their malice, said, \"Why are you testing me, you performers?",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "Show me the coin used for the tax.\" And they brought him a denarius.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "And he says to them, \"Whose image is this, and whose inscription?\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "They say to him, \"Caesar's.\" Then he says to them, \"So give back to Caesar what belongs to Caesar, and to God what belongs to God.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "And when they heard this, they were amazed, and leaving him, they went away.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "On that day Sadducees came to him—those who say there is no resurrection—and they questioned him,",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "saying, \"Teacher, Moses said, 'If someone dies without having children, his brother shall marry his widow and raise up offspring for his brother.'",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Now there were seven brothers among us. The first married and died, and having no offspring, left his wife to his brother.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Likewise the second, and the third, down through the seventh.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Last of all, the woman died.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "In the resurrection, then, whose wife of the seven will she be? For they all had her.\"",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Jesus answered them, \"You are deceived, knowing neither the scriptures nor the power of God.",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "For in the resurrection they neither marry nor are given in marriage, but are like angels of God in heaven.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "But concerning the resurrection of the dead, have you not read what was spoken to you by God, saying,",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "'I am the God of Abraham and the God of Isaac and the God of Jacob'? He is not God of the dead but of the living.\"",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "And when the crowds heard this, they were astounded at his teaching.",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "Now when the Pharisees heard that he had silenced the Sadducees, they gathered together.",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "And one of them, an expert in the law, tested him with a question:",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "\"Teacher, which commandment in the law is greatest?\"",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "He said to him, \"'You shall love the Lord your God with your whole heart and with your whole soul and with your whole mind.'",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "This is the greatest and first commandment.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "And a second is like it: 'You shall love your neighbor as yourself.'",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "On these two commandments hang the whole law and the prophets.\"",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "Now while the Pharisees were gathered together, Jesus questioned them,",
          "paragraphStart": true
        },
        {
          "verse": 42,
          "text": "saying, \"What do you think about the Messiah? Whose son is he?\" They say to him, \"David's.\"",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "He says to them, \"How then does David, speaking by the Spirit, call him Lord, saying,",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "'The Lord said to my Lord: Sit at my right hand until I place your enemies beneath your feet'?",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "If then David calls him Lord, how is he his son?\"",
          "paragraphStart": false
        },
        {
          "verse": 46,
          "text": "And no one was able to answer him a word, nor did anyone dare to question him any longer from that day on.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Wedding celebration\" (vv. 2-10)**: The Greek γάμους is plural, referring not to a single ceremony but to the multi-day festivities typical of ancient weddings. \"Wedding celebration\" or \"wedding feast\" captures this better than simply \"wedding.\"\n\n**\"Comrade\" (v. 12)**: The Greek Ἑταῖρε appears three times in Matthew (here, 20:13, 26:50), always in contexts of rebuke or tension. It's not the warm φίλος (\"friend\") but a more distant address—something like \"my good man\" or \"companion.\" It signals relationship while creating distance. \"Comrade\" captures this ambivalent tone.\n\n**\"Was silenced\" (v. 12)**: The verb ἐφιμώθη (also used in v. 34 of the Sadducees) means \"was muzzled\"—rendered speechless, as if gagged. The passive voice suggests he had no defense to offer.\n\n**\"Performers\" (v. 18)**: As noted in the guidelines, ὑποκριταί refers to stage actors. The Pharisees and Herodians are performing a role—feigning sincerity while plotting entrapment.\n\n**\"Do not regard people's standing\" (v. 16)**: The Greek οὐ γὰρ βλέπεις εἰς πρόσωπον ἀνθρώπων (\"you do not look at the face of people\") is a Semitic idiom for showing no partiality based on status. The flatterers are (ironically) speaking truth—Jesus genuinely shows no favoritism.\n\n**\"Give back\" (v. 21)**: The verb Ἀπόδοτε (from ἀποδίδωμι) means \"render back, return, repay\"—not merely \"give.\" It implies returning what is already owed or what already belongs to someone.\n\n**\"You are deceived\" (v. 29)**: Πλανᾶσθε means \"you are wandering, going astray, being led into error.\" This is stronger than simply \"you are wrong\"—it suggests they've been led off the path.\n\n**\"Messiah\" (v. 42)**: The Greek τοῦ χριστοῦ (\"the Christ\") is the Greek translation of the Hebrew \"Messiah\" (anointed one). Using \"Messiah\" here clarifies that Jesus is asking about the expected Davidic deliverer, not making a Christian confession.\n\n**\"Beneath your feet\" (v. 44)**: The SBLGNT has ὑποκάτω (\"beneath\") rather than ὑποπόδιον (\"footstool\"). This follows the reading of important early manuscripts."
    },
    {
      "chapter": 23,
      "verses": [
        {
          "verse": 1,
          "text": "Then Jesus spoke to the crowds and to his disciples,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "saying: \"The scribes and the Pharisees have seated themselves on Moses's seat.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "So everything they tell you, do and observe—but do not act according to their deeds, for they speak but do not act.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "They tie up heavy loads and place them on people's shoulders, yet they themselves are unwilling to lift a finger to move them.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "All their deeds they do to be watched by people: they widen their phylacteries and lengthen their tassels,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "and they love the place of honor at banquets and the front seats in the synagogues",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "and the greetings in the marketplaces and being called 'Rabbi' by people.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "\"But you—do not be called 'Rabbi,' for one is your teacher, and you are all brothers.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "And do not call anyone on earth your 'Father,' for one is your Father—the heavenly one.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Nor be called 'instructors,' for one is your instructor—the Messiah.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "The greatest among you will be your servant.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Whoever exalts himself will be humbled, and whoever humbles himself will be exalted.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "\"Woe to you, scribes and Pharisees, performers! For you lock up the kingdom of the heavens in front of people; you yourselves do not enter, nor do you allow those entering to go in.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "\"Woe to you, scribes and Pharisees, performers! For you cross sea and dry land to make one convert, and when he becomes one, you make him twice as much a child of Gehenna as yourselves.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "\"Woe to you, blind guides, who say, 'Whoever swears by the sanctuary—it means nothing; but whoever swears by the gold of the sanctuary is bound.'",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "Fools and blind! Which is greater—the gold, or the sanctuary that consecrates the gold?",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And, 'Whoever swears by the altar—it means nothing; but whoever swears by the gift upon it is bound.'",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Blind ones! Which is greater—the gift, or the altar that consecrates the gift?",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "So the one who swears by the altar swears by it and by everything upon it;",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "and the one who swears by the sanctuary swears by it and by the one dwelling in it;",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "and the one who swears by heaven swears by the throne of God and by the one seated upon it.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "\"Woe to you, scribes and Pharisees, performers! For you tithe mint and dill and cumin, but have neglected the weightier matters of the Law—justice and mercy and faithfulness. These you should have done without neglecting the others.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "Blind guides! Straining out the gnat but swallowing the camel.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "\"Woe to you, scribes and Pharisees, performers! For you clean the outside of the cup and dish, but inside they are full of greed and self-indulgence.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "Blind Pharisee! First clean the inside of the cup and dish, so that the outside may become clean as well.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "\"Woe to you, scribes and Pharisees, performers! For you are like whitewashed tombs, which on the outside appear beautiful, but inside are full of dead bones and every kind of uncleanness.",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "So you also—on the outside you appear righteous to people, but inside you are full of pretense and lawlessness.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "\"Woe to you, scribes and Pharisees, performers! For you build the tombs of the prophets and decorate the monuments of the righteous,",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "and you say, 'If we had lived in the days of our fathers, we would not have been their partners in shedding the blood of the prophets.'",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "So you testify against yourselves that you are sons of those who murdered the prophets.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Fill up, then, the measure of your fathers!",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "Serpents! Brood of vipers! How will you escape the judgment of Gehenna?",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "\"Therefore—look!—I am sending to you prophets and sages and scribes. Some of them you will kill and crucify, and some of them you will flog in your synagogues and pursue from city to city,",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "so that upon you may come all the righteous blood poured out on the earth, from the blood of righteous Abel to the blood of Zechariah son of Barachiah, whom you murdered between the sanctuary and the altar.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "Truly I tell you, all these things will come upon this generation.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "\"Jerusalem, Jerusalem—she who kills the prophets and stones those sent to her! How often I wanted to gather your children the way a hen gathers her chicks under her wings, and you were unwilling!",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "Look—your house is left to you desolate.",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "For I tell you, you will certainly not see me from now until you say, 'Blessed is the one who comes in the name of the Lord.'\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Performers\" (vv. 13, 15, 23, 25, 27, 29)**: Greek ὑποκριταί originally meant stage actors—people playing a role for an audience. The modern English \"hypocrite\" suggests inward duplicity, but Jesus's critique is that their religion *is* the performance. The noun ὑποκρίσεως in v. 28 becomes \"pretense\" to maintain this theatrical sense.\n\n**\"Seated themselves on Moses's seat\" (v. 2)**: The aorist ἐκάθισαν suggests they have taken this position of authority, perhaps with a note of presumption. Some synagogues had a literal stone seat for the authoritative Torah teacher.\n\n**\"Phylacteries\" and \"tassels\" (v. 5)**: φυλακτήρια are the tefillin—small leather boxes containing Scripture worn during prayer. κράσπεδα are the tzitzit—ritual fringes commanded in Numbers 15:38-39. Widening and lengthening these made one's piety more publicly visible.\n\n**\"Instructors\" (v. 10)**: Greek καθηγηταί is distinct from διδάσκαλος (teacher) in v. 8—it suggests a master-guide or authoritative leader. The three prohibited titles (Rabbi, Father, Instructor) represent escalating claims to spiritual authority.\n\n**\"Sanctuary\" (vv. 16-21, 35)**: Greek ναός refers to the sanctuary proper—the inner sacred building—distinct from ἱερόν (the entire temple complex). This precision matters for the oath-swearing logic: swearing by the sanctuary implicitly invokes God who dwells there.\n\n**\"Gehenna\" (vv. 15, 33)**: The Valley of Hinnom outside Jerusalem, associated with child sacrifice in Israel's past and later used as a metaphor for divine judgment. Preserving the term rather than translating \"hell\" avoids importing later theological concepts.\n\n**\"Gnat...camel\" (v. 24)**: In the underlying Aramaic, these words likely formed a pun: *qalma* (gnat) and *gamla* (camel). The absurdist image is deliberate—meticulously filtering out the smallest impurity while gulping down the largest unclean animal.\n\n**\"Weightier matters\" (v. 23)**: τὰ βαρύτερα—literally \"the heavier things.\" This echoes rabbinic discussions about which commandments carry more weight. Note the contrast with the \"heavy burdens\" (φορτία βαρέα) they impose on others in v. 4.\n\n**\"Whitewashed tombs\" (v. 27)**: Tombs were whitewashed before Passover so pilgrims could see and avoid them, preventing ritual defilement from corpse-impurity. The image is devastating: what makes them visible is itself evidence of the death within.\n\n**\"Fill up the measure\" (v. 32)**: πληρώσατε is imperative—a grim permission or prophetic irony: \"Go ahead, complete what your fathers started.\"\n\n**Verse 14 omitted**: Following the critical text (SBLGNT/NA28), which recognizes this verse as a scribal addition from the parallel in Mark 12:40/Luke 20:47."
    },
    {
      "chapter": 24,
      "verses": [
        {
          "verse": 1,
          "text": "And Jesus, going out from the temple, was departing, and his disciples came to him to point out to him the buildings of the temple.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "But he responded and said to them, \"Do you not see all these things? Truly I tell you, not one stone will be left here upon another that will not be torn down.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And as he was sitting on the Mount of Olives, the disciples came to him privately, saying, \"Tell us, when will these things be? And what will be the sign of your arrival and of the completion of the age?\"",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "And Jesus answered them, \"Watch out that no one leads you astray.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "For many will come in my name, saying, 'I am the Messiah,' and will lead many astray.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And you will hear of wars and reports of wars. See that you are not alarmed, for this must happen, but the end is not yet.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For nation will rise against nation and kingdom against kingdom, and there will be famines and earthquakes in various places.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But all these things are the beginning of labor pains.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "\"Then they will hand you over to affliction and will kill you, and you will be hated by all the nations because of my name.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "And then many will fall away, and will betray one another and hate one another.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And many false prophets will arise and lead many astray.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And because lawlessness will be multiplied, the love of most will grow cold.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "But the one who endures to the end—this one will be saved.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And this good news of the kingdom will be proclaimed in the whole inhabited world as a testimony to all the nations, and then the end will come.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "\"So when you see the abomination of desolation—spoken of through Daniel the prophet—standing in the holy place (let the reader understand),",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "then let those in Judea flee to the mountains.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "The one on the rooftop must not go down to retrieve things from his house,",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "and the one in the field must not turn back to get his cloak.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "But woe to those who are pregnant and to those who are nursing in those days.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "And pray that your flight may not happen in winter or on a Sabbath.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For then there will be great affliction, such as has not occurred from the beginning of the world until now, and never will occur again.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "And if those days had not been cut short, no flesh would be saved. But for the sake of the chosen ones, those days will be cut short.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "\"Then if anyone says to you, 'Look, here is the Messiah!' or 'Here he is!'—do not believe it.",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "For false messiahs and false prophets will arise and will produce great signs and wonders, so as to lead astray, if possible, even the chosen ones.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Look—I have told you beforehand.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "So if they say to you, 'Look, he is in the wilderness,' do not go out. 'Look, he is in the inner rooms'—do not believe it.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "For just as lightning comes forth from the east and flashes as far as the west, so will be the arrival of the Son of Man.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Wherever the corpse is, there the vultures will gather.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "\"Immediately after the affliction of those days, the sun will be darkened, and the moon will not give its light, and the stars will fall from heaven, and the powers of the heavens will be shaken.",
          "paragraphStart": true
        },
        {
          "verse": 30,
          "text": "And then the sign of the Son of Man will appear in heaven, and then all the tribes of the earth will mourn, and they will see the Son of Man coming on the clouds of heaven with power and great glory.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "And he will send out his angels with a great trumpet blast, and they will gather together his chosen ones from the four winds, from one end of the heavens to the other.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "\"Now learn the lesson from the fig tree: when its branch has already become tender and it puts forth its leaves, you know that summer is near.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "So also you—when you see all these things, know that it is near, at the very doors.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Truly I tell you that this generation will certainly not pass away until all these things have happened.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "Heaven and earth will pass away, but my words will never pass away.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "\"But concerning that day and hour, no one knows—not the angels of the heavens, nor the Son—except the Father alone.",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "For just as the days of Noah were, so will be the arrival of the Son of Man.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "For as in those days before the flood they were eating and drinking, marrying and giving in marriage, until the day when Noah entered the ark,",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "and they knew nothing until the flood came and swept them all away—so will be the arrival of the Son of Man.",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "Then two men will be in the field: one is taken and one is left.",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "Two women will be grinding at the mill: one is taken and one is left.",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "\"Keep watch, therefore, because you do not know on what day your Lord is coming.",
          "paragraphStart": true
        },
        {
          "verse": 43,
          "text": "But know this: if the master of the house had known in what watch of the night the thief was coming, he would have stayed awake and would not have let his house be broken into.",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "For this reason, you also must be ready, because the Son of Man is coming at an hour you do not expect.",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "\"Who then is the faithful and prudent servant whom the master has put in charge of his household to give them their food at the proper time?",
          "paragraphStart": true
        },
        {
          "verse": 46,
          "text": "Blessed is that servant whom his master, when he comes, finds doing so.",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "Truly I tell you, he will put him in charge of all his possessions.",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "But if that wicked servant says in his heart, 'My master is delayed,'",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "and begins to beat his fellow servants, and eats and drinks with drunkards,",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "the master of that servant will come on a day he does not expect and at an hour he does not know,",
          "paragraphStart": false
        },
        {
          "verse": 51,
          "text": "and will cut him in two and assign his portion with the performers. There will be weeping and gnashing of teeth.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Arrival\" (v. 3, 27, 37, 39)**: The Greek παρουσία literally means \"presence\" or \"being present,\" and in Hellenistic usage it was the technical term for a royal visit or the arrival of a king. \"Coming\" flattens this into mere motion; \"arrival\" better captures the sense of an awaited, momentous appearing.\n\n**\"Completion of the age\" (v. 3)**: συντελείας τοῦ αἰῶνος refers not to the end of the physical world but to the consummation or fulfillment of the present age—a Jewish apocalyptic concept of the turning of the ages.\n\n**\"Labor pains\" (v. 8)**: ὠδίνων specifically means birth pangs. This connects to the Jewish concept of the \"birth pangs of the Messiah\"—the travail preceding the messianic age. The metaphor is lost with generic \"sorrows\" or \"troubles.\"\n\n**\"Fall away\" (v. 10)**: σκανδαλισθήσονται derives from σκάνδαλον, a trap-trigger. The sense is being caused to stumble or being ensnared—a loss of faith under pressure, not mere offense.\n\n**\"The many\" (v. 12)**: τῶν πολλῶν could mean \"most people\" but \"the many\" preserves the construction and echoes the repetition of πολλοί throughout this section.\n\n**\"Inner rooms\" (v. 26)**: ταμείοις refers to the innermost, most private chambers of a house—storerooms or hidden spaces. The point is that the Messiah's arrival cannot be secret or localized.\n\n**\"Vultures\" (v. 28)**: ἀετοί can mean eagles or vultures. Context (gathering around a corpse) strongly suggests vultures. This appears to be a proverbial saying about the obviousness and inevitability of what is coming.\n\n**\"Cut him in two\" (v. 51)**: διχοτομήσει literally means to cut in two, to bisect. Some translations soften this to \"punish severely,\" but the Greek is graphic—likely describing execution or referencing the punishment of dismemberment.\n\n**\"Performers\" (v. 51)**: ὑποκριτῶν—as noted in the guidelines, these are play-actors, those whose piety is theatrical. The wicked servant's fate is with those whose religion was performance rather than substance."
    },
    {
      "chapter": 25,
      "verses": [
        {
          "verse": 1,
          "text": "Then the kingdom of the heavens will be compared to ten young women who took their torches and went out to meet the bridegroom.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Five of them were foolish and five were wise.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For the foolish ones, when they took their torches, did not take oil with them.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But the wise ones took oil in flasks along with their torches.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "While the bridegroom was delayed, they all grew drowsy and fell asleep.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But in the middle of the night a cry rang out: \"Look! The bridegroom! Come out to meet him!\"",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Then all those young women rose and trimmed their torches.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "The foolish ones said to the wise, \"Give us some of your oil, because our torches are going out.\"",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "But the wise ones answered, saying, \"No—there may not be enough for both us and you. Go instead to the merchants and buy some for yourselves.\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "But while they were going away to buy, the bridegroom arrived, and those who were ready went in with him to the wedding feast, and the door was shut.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Later the rest of the young women also came, saying, \"Lord, lord, open up for us!\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "But he answered and said, \"Truly I tell you, I do not know you.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Therefore keep watch, because you do not know the day or the hour.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For it is like a man going on a journey who called his own slaves and entrusted his property to them.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "To one he gave five talents, to another two, and to another one—to each according to his own ability—and he went away. Immediately",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "the one who had received the five talents went and put them to work and gained five more.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "Likewise the one with the two gained two more.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "But the one who had received the one talent went away, dug a hole in the ground, and hid his master's money.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Now after a long time the master of those slaves comes and settles accounts with them.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "The one who had received the five talents came forward and brought five more talents, saying, \"Master, you entrusted five talents to me. Look—I have gained five more talents.\"",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "His master said to him, \"Well done, good and trustworthy slave! You were trustworthy over a little; I will put you in charge of much. Enter into the joy of your master.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "The one with the two talents also came forward and said, \"Master, you entrusted two talents to me. Look—I have gained two more talents.\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "His master said to him, \"Well done, good and trustworthy slave! You were trustworthy over a little; I will put you in charge of much. Enter into the joy of your master.\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Then the one who had received the one talent also came forward and said, \"Master, I knew you to be a hard man, harvesting where you did not sow and gathering where you did not scatter seed.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "And being afraid, I went away and hid your talent in the ground. Look—you have what is yours.\"",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "But his master answered and said to him, \"Wicked and lazy slave! You knew that I harvest where I did not sow and gather where I did not scatter?",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Then you ought to have deposited my money with the bankers, and when I came I would have received back what was mine with interest.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Therefore take the talent from him and give it to the one who has the ten talents.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "For to everyone who has, more will be given and they will have abundance. But from the one who does not have, even what they have will be taken from them.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "And throw the worthless slave into the outer darkness. There will be weeping and grinding of teeth.\"",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "When the Son of Man comes in his glory, and all the angels with him, then he will sit on his glorious throne.",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "All the nations will be gathered before him, and he will separate them from one another, just as the shepherd separates the sheep from the goats.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "He will place the sheep on his right and the goats on his left.",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Then the king will say to those on his right, \"Come, you who are blessed by my Father, inherit the kingdom prepared for you from the foundation of the world.",
          "paragraphStart": true
        },
        {
          "verse": 35,
          "text": "For I was hungry and you gave me something to eat. I was thirsty and you gave me something to drink. I was a stranger and you took me in.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "I was naked and you clothed me. I was sick and you looked after me. I was in prison and you came to me.\"",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "Then the righteous will answer him, saying, \"Lord, when did we see you hungry and feed you, or thirsty and give you drink?",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "When did we see you a stranger and take you in, or naked and clothe you?",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "When did we see you sick or in prison and come to you?\"",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "And the king will answer and say to them, \"Truly I tell you, inasmuch as you did it for one of the least of these brothers of mine, you did it for me.\"",
          "paragraphStart": true
        },
        {
          "verse": 41,
          "text": "Then he will also say to those on his left, \"Depart from me, you who are cursed, into the eternal fire prepared for the devil and his angels.",
          "paragraphStart": true
        },
        {
          "verse": 42,
          "text": "For I was hungry and you did not give me anything to eat. I was thirsty and you did not give me anything to drink.",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "I was a stranger and you did not take me in. I was naked and you did not clothe me. I was sick and in prison and you did not look after me.\"",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "Then they too will answer, saying, \"Lord, when did we see you hungry or thirsty or a stranger or naked or sick or in prison and not serve you?\"",
          "paragraphStart": true
        },
        {
          "verse": 45,
          "text": "Then he will answer them, saying, \"Truly I tell you, inasmuch as you did not do it for one of the least of these, neither did you do it for me.\"",
          "paragraphStart": true
        },
        {
          "verse": 46,
          "text": "And these will go away into eternal punishment, but the righteous into eternal life.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Young women\" (v. 1, 7, 11)**: Greek παρθένοι specifically denotes unmarried young women (virgins). In the context of a wedding procession, these are attendants awaiting the bridegroom—likely young women from the bride's household. \"Virgins\" in modern English carries connotations that distract from the narrative function.\n\n**\"Torches\" (v. 1, 3, 4, 7, 8)**: Greek λαμπάδας can mean lamps or torches. In the context of a nighttime wedding procession, these were likely torches carried by the attendants to light the bridegroom's way. The detail about oil and the torches \"going out\" (σβέννυνται, v. 8) fits torches that needed continual oil.\n\n**\"Trimmed\" (v. 7)**: Greek ἐκόσμησαν means to arrange, put in order, or prepare. For torches, this would involve adjusting the wick and adding oil—\"trimmed\" captures this practical action.\n\n**\"Talents\" (v. 15ff)**: A talent was an enormous sum—roughly 6,000 denarii, or about twenty years' wages for a laborer. The word has become so familiar that its shocking scale is lost, but I retain it as the most recognizable term. The master entrusts staggering wealth.\n\n**\"Trustworthy\" (v. 21, 23)**: Greek πιστός can mean \"faithful\" or \"trustworthy.\" In the context of financial stewardship, \"trustworthy\" better captures the semantic field—the slave proved reliable with what was entrusted to him.\n\n**\"Settles accounts\" (v. 19)**: Greek συναίρει λόγον is commercial terminology for balancing the books—a reckoning of debts and assets.\n\n**\"Lazy\" (v. 26)**: Greek ὀκνηρός means hesitant, shrinking back, slothful. Combined with πονηρός (wicked), it characterizes the slave as both morally culpable and practically useless.\n\n**\"Grinding of teeth\" (v. 30)**: Greek βρυγμός denotes grinding or gnashing—an expression of anguish or rage, not merely chattering from cold.\n\n**\"Goats\" (v. 32, 33)**: Verse 32 uses ἐρίφων (mature male goats), verse 33 uses ἐρίφια (young goats). The distinction may simply be stylistic variation, but sheep and goats were commonly herded together in Palestine and separated at night.\n\n**\"Took me in\" (v. 35, 38, 43)**: Greek συνηγάγετε literally means \"gathered me in\"—offering hospitality and shelter to a stranger. This is more active than merely \"welcoming.\"\n\n**\"Looked after\" (v. 36, 43)**: Greek ἐπεσκέψασθε means to visit with care and concern, to look after someone's welfare—not merely a social call but attentive care for the sick.\n\n**\"The least of these brothers of mine\" (v. 40)**: The Greek τῶν ἐλαχίστων is superlative—the very least, the most insignificant. Note that \"brothers of mine\" appears in v. 40 but is absent in v. 45, which simply says \"the least of these.\""
    },
    {
      "chapter": 26,
      "verses": [
        {
          "verse": 1,
          "text": "When Jesus had finished all these words, he said to his disciples:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "\"You know that in two days the Passover takes place, and the Son of Man is being handed over to be crucified.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Then the chief priests and the elders of the people gathered in the courtyard of the high priest, the one called Caiaphas,",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "and they conspired to seize Jesus by deception and kill him.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But they were saying, \"Not during the festival, so that there will not be an uproar among the people.\"",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Now while Jesus was in Bethany, in the house of Simon the leper,",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "a woman came to him with an alabaster jar of very expensive perfumed oil and poured it over his head as he reclined at table.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "When the disciples saw this, they were indignant, saying, \"Why this waste?",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For this could have been sold for a large sum and given to the poor.\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "But Jesus, aware of this, said to them, \"Why are you causing trouble for this woman? She has done a beautiful deed for me.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For you always have the poor with you, but you will not always have me.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "By pouring this perfumed oil on my body, she has prepared me for burial.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Truly I tell you, wherever this good news is proclaimed in the whole world, what she has done will also be spoken of as a memorial to her.\"",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Then one of the twelve, the one called Judas Iscariot, went to the chief priests",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "and said, \"What are you willing to give me if I hand him over to you?\" And they set out for him thirty silver pieces.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "From that time he was looking for an opportunity to hand him over.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "On the first day of Unleavened Bread, the disciples came to Jesus saying, \"Where do you want us to prepare for you to eat the Passover?\"",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "He said, \"Go into the city to a certain man and say to him, 'The Teacher says: My appointed time is near. I am keeping the Passover at your house with my disciples.'\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And the disciples did as Jesus directed them, and they prepared the Passover.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "When evening came, he was reclining at table with the twelve.",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "And while they were eating, he said, \"Truly I tell you that one of you will hand me over.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "And being deeply grieved, they began to say to him, one after another, \"Surely not I, Lord?\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "He answered, \"The one who dipped his hand in the bowl with me—this one will hand me over.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "The Son of Man goes away just as it is written about him, but woe to that man through whom the Son of Man is handed over. It would have been better for that man if he had not been born.\"",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Then Judas, the one handing him over, answered and said, \"Surely not I, Rabbi?\" He said to him, \"You have said it.\"",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "While they were eating, Jesus took bread, and after blessing it, broke it and gave it to the disciples and said, \"Take, eat; this is my body.\"",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "And taking a cup and giving thanks, he gave it to them, saying, \"Drink from it, all of you,",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "for this is my blood of the covenant, which is being poured out for many for the forgiveness of sins.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "I tell you, I will certainly not drink from this fruit of the vine from now on until that day when I drink it new with you in the kingdom of my Father.\"",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "And after singing a hymn, they went out to the Mount of Olives.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "Then Jesus said to them, \"All of you will fall away because of me this night, for it is written: 'I will strike the shepherd, and the sheep of the flock will be scattered.'",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "But after I am raised, I will go ahead of you to Galilee.\"",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "Peter answered him, \"Even if all fall away because of you, I will never fall away.\"",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Jesus said to him, \"Truly I tell you that this very night, before the rooster crows, you will deny me three times.\"",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "Peter said to him, \"Even if I must die with you, I will certainly not deny you.\" And all the disciples said the same.",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "Then Jesus came with them to a place called Gethsemane, and he said to the disciples, \"Sit here while I go over there to pray.\"",
          "paragraphStart": true
        },
        {
          "verse": 37,
          "text": "And taking along Peter and the two sons of Zebedee, he began to be grieved and deeply distressed.",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "Then he said to them, \"My soul is overwhelmed with sorrow to the point of death. Stay here and keep watch with me.\"",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "And going forward a little, he fell on his face, praying and saying, \"My Father, if it is possible, let this cup pass from me. Yet not as I will, but as you will.\"",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "And he came to the disciples and found them sleeping, and he said to Peter, \"So you could not keep watch with me for one hour?",
          "paragraphStart": true
        },
        {
          "verse": 41,
          "text": "Keep watch and pray so that you do not enter into testing. The spirit is willing, but the flesh is weak.\"",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "Again, going away a second time, he prayed, saying, \"My Father, if this cannot pass unless I drink it, let your will be done.\"",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "And coming back again, he found them sleeping, for their eyes were heavy.",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "And leaving them, he went away again and prayed a third time, saying the same words once more.",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "Then he came to the disciples and said to them, \"Are you still sleeping and resting? Look—the hour has drawn near, and the Son of Man is being handed over into the hands of sinners.",
          "paragraphStart": true
        },
        {
          "verse": 46,
          "text": "Get up, let us go. Look—the one handing me over has drawn near.\"",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "And while he was still speaking, suddenly Judas, one of the twelve, arrived, and with him a large crowd with swords and clubs, from the chief priests and elders of the people.",
          "paragraphStart": true
        },
        {
          "verse": 48,
          "text": "Now the one handing him over had given them a sign, saying, \"The one I kiss—he is the one. Seize him.\"",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "And immediately coming to Jesus, he said, \"Greetings, Rabbi!\" and kissed him warmly.",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "Jesus said to him, \"Friend, do what you came for.\" Then they came forward, laid hands on Jesus, and seized him.",
          "paragraphStart": false
        },
        {
          "verse": 51,
          "text": "And suddenly one of those with Jesus stretched out his hand, drew his sword, and struck the servant of the high priest, cutting off his ear.",
          "paragraphStart": true
        },
        {
          "verse": 52,
          "text": "Then Jesus said to him, \"Return your sword to its place, for all who take up the sword will perish by the sword.",
          "paragraphStart": false
        },
        {
          "verse": 53,
          "text": "Or do you think that I cannot call upon my Father, and he will at once provide me with more than twelve legions of angels?",
          "paragraphStart": false
        },
        {
          "verse": 54,
          "text": "But how then would the scriptures be fulfilled, that it must happen this way?\"",
          "paragraphStart": false
        },
        {
          "verse": 55,
          "text": "At that hour Jesus said to the crowds, \"Have you come out with swords and clubs to arrest me as though I were a rebel? Day after day I sat in the temple teaching, and you did not seize me.",
          "paragraphStart": true
        },
        {
          "verse": 56,
          "text": "But all this has happened so that the scriptures of the prophets might be fulfilled.\" Then all the disciples abandoned him and fled.",
          "paragraphStart": false
        },
        {
          "verse": 57,
          "text": "Those who had seized Jesus led him away to Caiaphas the high priest, where the scribes and the elders had gathered.",
          "paragraphStart": true
        },
        {
          "verse": 58,
          "text": "Peter was following him at a distance, as far as the courtyard of the high priest, and going inside, he sat with the attendants to see the outcome.",
          "paragraphStart": false
        },
        {
          "verse": 59,
          "text": "Now the chief priests and the whole council were seeking false testimony against Jesus so that they might put him to death,",
          "paragraphStart": true
        },
        {
          "verse": 60,
          "text": "but they found none, though many false witnesses came forward. Finally two came forward",
          "paragraphStart": false
        },
        {
          "verse": 61,
          "text": "and said, \"This man said, 'I am able to destroy the sanctuary of God and rebuild it in three days.'\"",
          "paragraphStart": false
        },
        {
          "verse": 62,
          "text": "And the high priest stood up and said to him, \"Have you no answer? What is it that these men are testifying against you?\"",
          "paragraphStart": false
        },
        {
          "verse": 63,
          "text": "But Jesus was silent. And the high priest said to him, \"I put you under oath by the living God: tell us if you are the Christ, the Son of God.\"",
          "paragraphStart": false
        },
        {
          "verse": 64,
          "text": "Jesus said to him, \"You have said it. But I tell you, from now on you will see the Son of Man seated at the right hand of the Power and coming on the clouds of heaven.\"",
          "paragraphStart": false
        },
        {
          "verse": 65,
          "text": "Then the high priest tore his robes, saying, \"He has blasphemed! What further need do we have of witnesses? Look—now you have heard the blasphemy.",
          "paragraphStart": true
        },
        {
          "verse": 66,
          "text": "What is your verdict?\" They answered, \"He deserves death.\"",
          "paragraphStart": false
        },
        {
          "verse": 67,
          "text": "Then they spat in his face and struck him with their fists, and some slapped him,",
          "paragraphStart": true
        },
        {
          "verse": 68,
          "text": "saying, \"Prophesy to us, Christ! Who is the one who hit you?\"",
          "paragraphStart": false
        },
        {
          "verse": 69,
          "text": "Now Peter was sitting outside in the courtyard, and a servant girl came to him, saying, \"You also were with Jesus the Galilean.\"",
          "paragraphStart": true
        },
        {
          "verse": 70,
          "text": "But he denied it before all of them, saying, \"I do not know what you are talking about.\"",
          "paragraphStart": false
        },
        {
          "verse": 71,
          "text": "When he went out to the gateway, another servant girl saw him and said to those there, \"This man was with Jesus the Nazarene.\"",
          "paragraphStart": false
        },
        {
          "verse": 72,
          "text": "And again he denied it with an oath: \"I do not know the man.\"",
          "paragraphStart": false
        },
        {
          "verse": 73,
          "text": "After a little while, those standing nearby came up and said to Peter, \"Surely you are also one of them, for your speech gives you away.\"",
          "paragraphStart": false
        },
        {
          "verse": 74,
          "text": "Then he began to invoke curses on himself and to swear, \"I do not know the man!\" And immediately a rooster crowed.",
          "paragraphStart": false
        },
        {
          "verse": 75,
          "text": "And Peter remembered the word Jesus had spoken: \"Before the rooster crows, you will deny me three times.\" And going outside, he wept bitterly.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Handed over\" (vv. 2, 15, 16, 21, 23, 24, 25, 45, 46, 48)**: The Greek παραδίδωμι appears throughout this chapter like a refrain. While \"betray\" is common in English translations, the Greek term is more neutral—it means to hand over, deliver, or transfer. \"Betray\" adds moral judgment the Greek doesn't inherently carry. The repeated use of this one verb ties together Jesus's prophecy, Judas's action, and the theological reality that Jesus is being delivered into human hands according to divine purpose.\n\n**\"Lord\" vs. \"Rabbi\" (vv. 22, 25, 49)**: The disciples address Jesus as κύριε (\"Lord\"), but Judas alone uses ῥαββί (\"Rabbi\"). This subtle distinction in Matthew's Greek may signal Judas's detachment—he uses the formal address of a student to teacher rather than the disciples' confession of Jesus's lordship.\n\n**\"Beautiful deed\" (v. 10)**: The Greek καλόν means both \"good\" and \"beautiful.\" The woman's action is not merely morally good but fitting, appropriate, even aesthetically right for the moment. \"Beautiful\" captures this richer sense.\n\n**\"A certain man\" (v. 18)**: The unusual τὸν δεῖνα (\"a certain someone\" or \"so-and-so\") is left deliberately vague in the Greek. This seems to be Matthew's way of indicating that Jesus named a specific person whose identity was either unknown to readers or deliberately withheld.\n\n**\"Fall away\" (vv. 31, 33)**: The Greek σκανδαλίζω relates to a snare or stumbling block. \"Be offended\" (a common rendering) is too weak; \"fall away\" captures the sense of being caused to stumble in faith and abandon Jesus.\n\n**\"Testing\" (v. 41)**: Greek πειρασμός means trial or testing, not merely \"temptation\" in the modern sense of enticement to minor vice. Jesus warns against entering a time of severe testing that might break their faithfulness.\n\n**\"Deeply distressed\" (v. 37)**: The Greek ἀδημονεῖν suggests severe anguish, restless anxiety, and troubled distress—stronger than ordinary sadness.\n\n**\"Overwhelmed with sorrow\" (v. 38)**: Greek περίλυπος (\"surrounded by grief\") echoes the Psalms (42:5, 11; 43:5 LXX), where the psalmist asks, \"Why are you cast down, O my soul?\"\n\n**\"Friend, do what you came for\" (v. 50)**: The Greek ἐφ᾽ ὃ πάρει is notoriously difficult. It could be a question (\"Why have you come?\") or a command (\"Do what you came for\"). The latter fits better with the immediate action that follows. Ἑταῖρε (\"friend, companion\") is notably used elsewhere in Matthew for those in ambiguous or adversarial positions (20:13; 22:12).\n\n**\"Kissed him warmly\" (v. 49)**: The intensified verb κατεφίλησεν suggests an effusive or fervent kiss, adding to the grotesque irony of the betrayal.\n\n**\"Rebel\" (v. 55)**: Greek λῃστής can mean robber but also armed insurgent or revolutionary. Jesus's point is that they've come armed as if to capture a dangerous insurrectionist, not a teacher who sat openly in the temple.\n\n**\"Sanctuary\" (v. 61)**: Greek ναός refers specifically to the inner temple building, the sacred structure itself, not the broader temple complex (ἱερόν).\n\n**\"The Power\" (v. 64)**: Jesus uses \"the Power\" (τῆς δυνάμεως) as a reverential circumlocution for God, avoiding the divine name while alluding to Psalm 110:1 and Daniel 7:13."
    },
    {
      "chapter": 27,
      "verses": [
        {
          "verse": 1,
          "text": "When morning came, all the chief priests and the elders of the people held a council against Jesus in order to put him to death.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "They bound him, led him away, and handed him over to Pilate the governor.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Then Judas, the one who had handed him over, seeing that Jesus had been condemned, was seized with remorse and returned the thirty silver coins to the chief priests and elders,",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "saying, \"I have sinned by handing over innocent blood.\" But they said, \"What is that to us? That is your concern.\"",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And throwing the silver coins into the sanctuary, he withdrew. Then he went away and hanged himself.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "The chief priests took the silver coins and said, \"It is not lawful to put them into the temple treasury, since it is the price of blood.\"",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "So after holding a council, they used the coins to purchase the Potter's Field as a burial place for foreigners.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For this reason that field has been called the Field of Blood to this day.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Then what was spoken through Jeremiah the prophet was fulfilled: \"And they took the thirty silver coins, the price of the one whose price was set, the price set by the sons of Israel,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "and they gave them for the potter's field, as the Lord directed me.\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Now Jesus stood before the governor, and the governor questioned him, saying, \"Are you the King of the Jews?\" Jesus said, \"You are saying it.\"",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "And while he was being accused by the chief priests and elders, he answered nothing.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then Pilate said to him, \"Do you not hear how many things they are testifying against you?\"",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "But he did not answer him regarding even a single charge, so that the governor was greatly amazed.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Now at the festival, the governor was accustomed to release one prisoner to the crowd—whomever they wanted.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "At that time they had a notorious prisoner called Jesus Barabbas.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "So when they had gathered, Pilate said to them, \"Whom do you want me to release to you: Jesus Barabbas, or Jesus who is called the Messiah?\"",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For he knew that they had handed him over out of envy.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "While he was sitting on the judgment seat, his wife sent word to him: \"Have nothing to do with that righteous man, for I have suffered greatly today because of a dream about him.\"",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "But the chief priests and the elders persuaded the crowds to ask for Barabbas and to have Jesus destroyed.",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "The governor responded and said to them, \"Which of the two do you want me to release to you?\" They said, \"Barabbas.\"",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Pilate said to them, \"Then what should I do with Jesus who is called the Messiah?\" They all said, \"Let him be crucified!\"",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "He said, \"Why? What evil has he done?\" But they shouted all the more, \"Let him be crucified!\"",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "When Pilate saw that he was accomplishing nothing but rather that an uproar was starting, he took water and washed his hands before the crowd, saying, \"I am innocent of this man's blood. You will see to it.\"",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "And all the people answered, \"His blood be on us and on our children!\"",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Then he released Barabbas to them, and after having Jesus flogged, he handed him over to be crucified.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Then the governor's soldiers took Jesus into the praetorium and gathered the whole cohort around him.",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "They stripped him and put a scarlet military cloak on him,",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "and having woven a crown out of thorns, they placed it on his head, and a reed in his right hand. And falling on their knees before him, they mocked him, saying, \"Hail, King of the Jews!\"",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "They spit on him, took the reed, and kept striking him on the head.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "And when they had finished mocking him, they stripped off the cloak and put his own garments on him and led him away to crucify him.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "As they were going out, they found a man from Cyrene named Simon. They pressed him into service to carry his cross.",
          "paragraphStart": true
        },
        {
          "verse": 33,
          "text": "And when they came to the place called Golgotha, which means Place of a Skull,",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "they gave him wine mixed with gall to drink. But after tasting it, he refused to drink.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "When they had crucified him, they divided his garments among themselves by casting lots.",
          "paragraphStart": true
        },
        {
          "verse": 36,
          "text": "Then they sat down and kept guard over him there.",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "Above his head they placed the written charge against him: \"This is Jesus, the King of the Jews.\"",
          "paragraphStart": false
        },
        {
          "verse": 38,
          "text": "Then two bandits were crucified with him, one on his right and one on his left.",
          "paragraphStart": true
        },
        {
          "verse": 39,
          "text": "Those passing by were reviling him, shaking their heads",
          "paragraphStart": false
        },
        {
          "verse": 40,
          "text": "and saying, \"You who would destroy the sanctuary and rebuild it in three days—save yourself! If you are the Son of God, come down from the cross!\"",
          "paragraphStart": false
        },
        {
          "verse": 41,
          "text": "Likewise the chief priests, along with the scribes and elders, mocked him, saying,",
          "paragraphStart": false
        },
        {
          "verse": 42,
          "text": "\"He saved others; he cannot save himself! He is the King of Israel—let him come down now from the cross, and we will believe in him.",
          "paragraphStart": false
        },
        {
          "verse": 43,
          "text": "He has put his trust in God—let God rescue him now if he wants him. For he said, 'I am the Son of God.'\"",
          "paragraphStart": false
        },
        {
          "verse": 44,
          "text": "In the same way, the bandits who were crucified with him also kept insulting him.",
          "paragraphStart": false
        },
        {
          "verse": 45,
          "text": "From the sixth hour, darkness came over all the land until the ninth hour.",
          "paragraphStart": true
        },
        {
          "verse": 46,
          "text": "About the ninth hour, Jesus cried out with a loud voice, \"Eli, Eli, lema sabachthani?\"—that is, \"My God, my God, why have you abandoned me?\"",
          "paragraphStart": false
        },
        {
          "verse": 47,
          "text": "Some of those standing there heard this and said, \"This man is calling for Elijah.\"",
          "paragraphStart": false
        },
        {
          "verse": 48,
          "text": "Immediately one of them ran and took a sponge, filled it with sour wine, put it on a reed, and began giving him a drink.",
          "paragraphStart": false
        },
        {
          "verse": 49,
          "text": "But the others said, \"Wait—let us see if Elijah comes to save him.\"",
          "paragraphStart": false
        },
        {
          "verse": 50,
          "text": "Then Jesus cried out again with a loud voice and released his spirit.",
          "paragraphStart": true
        },
        {
          "verse": 51,
          "text": "And look—the curtain of the sanctuary was torn in two from top to bottom, the earth shook, and the rocks were split apart.",
          "paragraphStart": false
        },
        {
          "verse": 52,
          "text": "The tombs were opened, and many bodies of the holy ones who had fallen asleep were raised.",
          "paragraphStart": false
        },
        {
          "verse": 53,
          "text": "Coming out of the tombs after his resurrection, they entered the holy city and appeared to many.",
          "paragraphStart": false
        },
        {
          "verse": 54,
          "text": "When the centurion and those with him who were guarding Jesus saw the earthquake and the things that had happened, they were terrified and said, \"Truly this man was God's Son!\"",
          "paragraphStart": true
        },
        {
          "verse": 55,
          "text": "Many women were there, watching from a distance—women who had followed Jesus from Galilee, serving him.",
          "paragraphStart": true
        },
        {
          "verse": 56,
          "text": "Among them were Mary Magdalene, Mary the mother of James and Joseph, and the mother of the sons of Zebedee.",
          "paragraphStart": false
        },
        {
          "verse": 57,
          "text": "When evening came, a wealthy man from Arimathea arrived, named Joseph, who had himself become a disciple of Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 58,
          "text": "This man approached Pilate and requested the body of Jesus. Then Pilate ordered it to be released.",
          "paragraphStart": false
        },
        {
          "verse": 59,
          "text": "Joseph took the body and wrapped it in clean linen cloth,",
          "paragraphStart": false
        },
        {
          "verse": 60,
          "text": "and placed it in his own new tomb, which he had cut into the rock. After rolling a large stone against the entrance of the tomb, he departed.",
          "paragraphStart": false
        },
        {
          "verse": 61,
          "text": "Mary Magdalene and the other Mary were there, sitting opposite the tomb.",
          "paragraphStart": false
        },
        {
          "verse": 62,
          "text": "On the next day, which is after the Preparation, the chief priests and the Pharisees gathered before Pilate,",
          "paragraphStart": true
        },
        {
          "verse": 63,
          "text": "saying, \"Sir, we remember that while he was still alive, that deceiver said, 'After three days I will be raised.'",
          "paragraphStart": false
        },
        {
          "verse": 64,
          "text": "Therefore, order the tomb to be made secure until the third day, lest his disciples come and steal him and tell the people, 'He has been raised from the dead.' Then the last deception would be worse than the first.\"",
          "paragraphStart": false
        },
        {
          "verse": 65,
          "text": "Pilate said to them, \"You have a guard. Go and make it as secure as you know how.\"",
          "paragraphStart": false
        },
        {
          "verse": 66,
          "text": "So they went and made the tomb secure by sealing the stone, along with the guard.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Seized with remorse\" (v. 3)**: The Greek μεταμεληθείς is distinct from the word for repentance (μετάνοια). It denotes regret or remorse over consequences rather than genuine transformation of heart. Judas felt the weight of what he had done without experiencing true repentance.\n\n**\"That is your concern\" (v. 4) / \"You will see to it\" (v. 24)**: Both translate forms of σὺ ὄψῃ/ὄψεσθε—an idiom placing responsibility on the other party. The ironic repetition connects Judas's guilt-deflection back onto the priests with the priests' guilt-deflection onto Pilate.\n\n**\"Sanctuary\" vs. \"temple\" (vv. 5, 40, 51)**: Greek distinguishes ναός (the sanctuary proper, including the Holy Place and Holy of Holies) from ἱερόν (the entire temple complex). Judas throws the coins into the sacred sanctuary itself; the curtain that tears is the sanctuary curtain. This precision matters theologically.\n\n**\"Jesus Barabbas\" (vv. 16-17)**: Following the SBLGNT, which includes the name \"Jesus\" for Barabbas based on early manuscript evidence. This creates a stark choice between two men named \"Jesus\"—one whose name means \"son of the father\" (Bar-abba).\n\n**\"Pressed into service\" (v. 32)**: ἠγγάρευσαν is a Persian loanword (via Aramaic) for compulsory requisitioning—the legal right of Roman soldiers to conscript civilians for labor.\n\n**\"Bandits\" (vv. 38, 44)**: λῃσταί refers to brigands or insurrectionists, not petty thieves (κλέπται). This was the term Josephus used for Jewish rebels against Rome, giving the crucifixion a political dimension.\n\n**\"Released his spirit\" (v. 50)**: ἀφῆκεν τὸ πνεῦμα suggests a voluntary act of releasing or dismissing, rather than simply \"dying.\" Jesus yields his life deliberately.\n\n**\"God's Son\" (v. 54)**: The Greek θεοῦ υἱός lacks the definite article, creating ambiguity. The centurion may mean \"a divine being's son\" in pagan terms, while Matthew's readers would hear the fuller christological confession.\n\n**\"Fallen asleep\" (v. 52)**: κεκοιμημένων is the standard early Christian euphemism for death, emphasizing its temporary nature for believers."
    },
    {
      "chapter": 28,
      "verses": [
        {
          "verse": 1,
          "text": "After the Sabbath, as it was dawning toward the first day of the week, Mary Magdalene and the other Mary came to see the tomb.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And suddenly there was a great earthquake, for an angel of the Lord descended from heaven, came forward, rolled away the stone, and sat upon it.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "His appearance was like lightning, and his clothing white as snow.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "The guards shook in terror of him and became like dead men.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But the angel spoke to the women: \"You need not fear—I know you are looking for Jesus, the crucified one.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "He is not here, for he has been raised, just as he said. Come, see the place where he was lying.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Then go quickly and tell his disciples: 'He has been raised from the dead, and look—he is going ahead of you to Galilee. There you will see him.' I have told you.\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And they left the tomb quickly, with fear and great joy, and ran to bring the message to his disciples.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "And suddenly Jesus met them, saying, \"Rejoice!\" They came forward, took hold of his feet, and worshiped him.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Then Jesus said to them, \"Do not be afraid. Go, tell my brothers to go to Galilee, and there they will see me.\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "While they were on their way, some of the guard went into the city and reported to the chief priests everything that had happened.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "After assembling with the elders and deliberating together, they gave the soldiers a considerable sum of silver,",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "telling them, \"Say this: 'His disciples came at night and stole him while we were sleeping.'",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And if this reaches the governor's ears, we will persuade him and keep you out of trouble.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "So they took the silver and did as they were instructed. And this story has been spread among the Judeans to this day.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Now the eleven disciples went to Galilee, to the mountain where Jesus had directed them.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "When they saw him, they worshiped him—though some hesitated.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And Jesus came forward and spoke to them: \"All authority in heaven and on earth has been given to me.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Go, therefore, and make disciples of all the nations, baptizing them into the name of the Father and of the Son and of the Holy Spirit,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "teaching them to observe everything I have commanded you. And look—I am with you all the days until the completion of the age.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Shook\" (v. 4)**: The Greek ἐσείσθησαν shares the same root as σεισμός (\"earthquake\") in verse 2. Matthew creates deliberate wordplay: the earth quakes, and then the guards quake. The same cosmic power that moves the earth paralyzes those who oppose the resurrection.\n\n**\"You need not fear\" (v. 5)**: The Greek includes an emphatic ὑμεῖς (\"you yourselves\"), creating a contrast with the guards who rightly trembled. The angel distinguishes between those seeking Jesus and those guarding against him.\n\n**\"He has been raised\" (v. 6, 7)**: The Greek ἠγέρθη is passive voice—a theological passive indicating that God raised Jesus. This is not merely \"he rose\" (active) but \"he was raised\" by divine action.\n\n**\"Rejoice!\" (v. 9)**: The Greek Χαίρετε was a common greeting (like \"hello\"), but it literally means \"rejoice.\" In this context—the women fleeing a tomb with \"great joy\"—the literal sense resonates. Jesus's first word to them after resurrection is an invitation to joy.\n\n**\"My brothers\" (v. 10)**: Jesus calls the disciples τοῖς ἀδελφοῖς μου. This is theologically significant—after the disciples abandoned him, Jesus does not call them \"my disciples\" but \"my brothers,\" signaling restored relationship.\n\n**\"Hesitated\" (v. 17)**: The Greek ἐδίστασαν appears only here and in Matthew 14:31 (Peter on the water). It suggests wavering or being of two minds rather than outright disbelief—a more nuanced response than simple \"doubt.\"\n\n**\"Into the name\" (v. 19)**: The preposition εἰς (\"into\") rather than ἐν (\"in\") suggests incorporation—being baptized into union with and belonging to the triune God, not merely invoking a name over someone.\n\n**\"Completion of the age\" (v. 20)**: The Greek συντελείας τοῦ αἰῶνος refers to the consummation or fulfillment of the present age, not merely its termination. \"Completion\" captures this sense of purposeful culmination."
    }
  ]
}
