{
  "book": "Philemon",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul, a prisoner of Christ Jesus, and Timothy our brother, to Philemon our beloved fellow worker,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "and to Apphia our sister, and to Archippus our fellow soldier, and to the church that meets in your house:",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Grace to you and peace from God our Father and the Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "I always thank my God when I mention you in my prayers,",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "because I hear of your love and the faith you have toward the Lord Jesus and for all the holy ones.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "My prayer is that the partnership of your faith may become effective as you come to fully realize every good thing we have in Christ.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For I have derived much joy and encouragement from your love, because the hearts of the holy ones have been refreshed through you, brother.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For this reason, though I have full confidence in Christ to order you to do what is required,",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "I prefer to appeal to you on the basis of love. I do this as Paul—an old man, and now also a prisoner of Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "I appeal to you for my child, whom I fathered while in my chains: Onesimus.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Formerly he was useless to you, but now he is truly \"Useful\"—both to you and to me.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "I am sending him back to you in person, which is like sending you my very heart.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "I wanted to keep him with me so that he could serve me on your behalf during my imprisonment for the sake of the Gospel.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "But I did not want to do anything without your consent, so that your good deed might not be the result of compulsion, but of your own free will.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Perhaps this is why he was separated from you for a brief moment: so that you might receive him back in full, eternally—",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "no longer as a slave, but more than a slave, as a beloved brother. He is especially dear to me, but how much more to you, both as a human being and in the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "So, if you consider me a partner, welcome him as you would welcome me.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "And if he has wronged you in any way or owes you anything, charge that to my account.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "I, Paul, am writing this with my own hand: I will pay it back—not to mention that you owe me your very self.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Yes, brother, may I have some \"Onesimus-benefit\" from you in the Lord; refresh my heart in Christ.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Confident in your obedience, I write to you, knowing that you will do even more than I ask.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "At the same time, prepare a guest room for me, for I hope that through your prayers I will be graciously restored to you.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Epaphras, my fellow prisoner in Christ Jesus, sends his greetings,",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "as do Mark, Aristarchus, Demas, and Luke, my fellow workers.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "The grace of the Lord Jesus Christ be with your spirit.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Prisoner\" (v. 1, 9)**: The Greek *desmios* refers to one in bonds or custody. Paul emphasizes his physical incarceration to leverage his moral authority and vulnerability, contrasting his literal chains with Philemon’s social freedom.\n\n**\"Hearts\" (v. 7, 12, 20)**: The Greek *splanchna* literally refers to the internal organs or \"innards.\" In the first century, the gut—not the heart—was considered the seat of the deepest emotions, compassion, and affection. While \"heart\" is the standard English equivalent, the Greek implies a deep, visceral connection.\n\n**\"Partnership\" (v. 6)**: The Greek *koinōnia* is often translated as \"fellowship,\" but here it carries the sense of a shared enterprise or mutual participation. In v. 17, the related word *koinōnos* (\"partner\") is a business and legal term for a joint-stock holder or partner in a contract.\n\n**\"Fully realize\" (v. 6)**: The Greek *epignōsis* implies more than intellectual data; it is an experiential, deep, and thorough knowledge.\n\n**\"Old man\" (v. 9)**: The term *presbytēs* means an elderly man. While some scholars suggest it might be a scribal variant of *presbeutēs* (\"ambassador\"), the manuscript evidence supports \"old man.\" It functions as an emotional appeal to Philemon’s respect for his mentor.\n\n**\"Onesimus\" / \"Useless/Useful\" (v. 10-11, 20)**: Paul engages in a sophisticated pun. The name *Onesimos* means \"Useful\" or \"Profitable.\" In v. 11, Paul uses the words *achrēstos* (useless) and *euchrēstos* (very useful) to play on the slave’s name. In v. 20, he uses the verb *onaimēn* (\"may I have benefit/profit\"), which is the verbal root of the name Onesimus, essentially asking Philemon to \"act like an Onesimus\" to him.\n\n**\"Receive him back in full\" (v. 15)**: The Greek *apechēs* is a technical commercial term used in the papyri for \"receiving payment in full\" or \"issuing a receipt.\" It suggests that the transaction of their relationship is being permanently and fully settled.\n\n**\"As a human being\" (v. 16)**: The Greek *en sarki* (literally \"in the flesh\") refers here to the sphere of natural human relations and social reality. Paul is saying that Onesimus is Philemon's brother both in the physical, social world and in the spiritual reality of the Lord.\n\n**\"Charge that to my account\" (v. 18)**: The Greek *elloga* is a formal accounting term (to \"reckon\" or \"inscribe\" into a ledger). Paul is assuming legal liability for any financial loss Onesimus caused.\n\n**\"Graciously restored\" (v. 22)**: The verb *charisthēsomai* is the passive form of *charizomai* (\"to give as a gift\" or \"to grant\"). Paul views his potential release from prison not as a legal right, but as a \"grace-gift\" granted by God in response to the community's prayers."
    }
  ]
}