{
  "book": "Philippians",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul and Timothy, slaves of Christ Jesus, to all the holy ones in Christ Jesus who are in Philippi, together with the overseers and the assistants:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Grace to you and peace from God our Father and the Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "I give thanks to my God every time I remember you,",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "always offering my prayer with joy in every petition of mine on behalf of all of you,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "because of your active partnership in the gospel from the first day until now.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "I am convinced of this very thing: that the one who began a good work among you will bring it to completion by the Day of Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "It is only right for me to have this mindset regarding all of you, because I hold you in my heart—for both in my imprisonment and in the legal defense and confirmation of the gospel, you are all my co-partners in this grace.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For God is my witness how much I long for all of you with the deep affection of Christ Jesus himself.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And this is my prayer: that your love may overflow more and more with specialized knowledge and all perceptive insight,",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "so that you may be able to distinguish what is vital, in order that you may be pure and blameless for the Day of Christ,",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "having been filled with the fruit of righteousness that comes through Jesus Christ, to the glory and praise of God.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Now I want you to know, brothers and sisters, that my circumstances have actually resulted in the advancement of the gospel.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "As a result, it has become common knowledge throughout the whole Imperial Guard and to everyone else that my imprisonment is for the sake of Christ.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Because of my chains, most of the brothers and sisters have gained confidence in the Lord and now dare even more to speak the word of God fearlessly.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Some, to be sure, are preaching Christ out of envy and rivalry, but others out of goodwill.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "The latter do so out of love, knowing that I am appointed for the defense of the gospel;",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "the former, however, proclaim Christ out of partisan ambition, not with pure motives, thinking they can stir up trouble for me while I am in chains.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "What does it matter? Only that in every way, whether from a false pretext or in truth, Christ is being proclaimed, and in this I rejoice. Yes, and I will continue to rejoice,",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "for I know that this will turn out for my deliverance through your petitions and the provision of the Spirit of Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "This is in keeping with my eager expectation and hope that I will not be put to shame in anything, but that with all boldness—as always, so now—Christ will be exalted in my body, whether by life or by death.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For to me, to live is Christ and to die is gain.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But if I am to live on in the flesh, this means fruitful labor for me; and which I shall choose, I cannot say.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "I am hard-pressed between the two: I have the desire to depart and be with Christ, for that is very much better;",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "but to remain in the flesh is more necessary for your sake.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Since I am convinced of this, I know that I will remain and continue with all of you for your advancement and joy in the faith,",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "so that your reason for boasting may overflow in Christ Jesus because of me, through my coming to you again.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Only this: conduct yourselves as citizens in a manner worthy of the gospel of Christ, so that whether I come and see you or am absent, I may hear about your situation—that you are standing firm in one spirit, with one soul struggling side-by-side for the faith of the gospel,",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "and not being intimidated in any way by those who oppose you. This is a clear omen of destruction for them, but of salvation for you—and this is from God.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "For it has been granted to you on behalf of Christ not only to believe in him but also to suffer for him,",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "since you are engaged in the same struggle that you saw me undergo and now hear that I am still facing.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Slaves\" (v. 1)**: The Greek *douloi* refers to a person owned by another. While often softened to \"servants,\" \"slaves\" captures both the social reality of the first century and Paul's theological point: he is under the total absolute authority of his Master.\n\n**\"Overseers and assistants\" (v. 1)**: The Greek *episkopois* and *diakonois* are translated based on their functional meaning in the first century rather than their later ecclesiastical titles (bishops and deacons). \n\n**\"Active partnership\" (v. 5)**: The word *koinōnia* denotes a shared endeavor, a joint venture, or a business partnership. It implies more than \"fellowship\" in the modern sense of social gathering; it refers to their financial and participatory support of Paul’s mission.\n\n**\"Legal defense\" (v. 7, 16)**: The Greek *apologia* is a technical term for a formal courtroom defense. Paul views his imprisonment not just as a hardship, but as a legal trial for the validity of the gospel itself.\n\n**\"Deep affection\" (v. 8)**: The Greek *splangchnois* literally refers to the internal organs (the \"guts\"). In the ancient world, the seat of deep emotion was the intestines, not the heart. \"Deep affection\" conveys the intensity of this visceral emotion in modern English.\n\n**\"Distinguish what is vital\" (v. 10)**: The phrase *dokimazein ta diapheronta* can mean \"approve the things that are excellent\" or \"test the things that differ.\" In context, it suggests the ability to discern what truly matters in the life of faith.\n\n**\"Advancement\" (v. 12)**: *Prokopē* is a military term used for an army clearing away obstacles to move forward. Paul’s imprisonment, which seemed like an obstacle, actually cleared the way for the gospel’s progress.\n\n**\"Imperial Guard\" (v. 13)**: *Praitōriō* refers to the Praetorian Guard, the elite unit of the Roman army that served as the Emperor's bodyguards and patrolled the imperial palace. \n\n**\"Partisan ambition\" (v. 17)**: *Eritheia* refers to a self-seeking spirit, often associated with political canvassing or \"electioneering.\" It is the desire to advance one's own interests or group over others.\n\n**\"Deliverance\" (v. 19)**: While *sōtēria* is often translated as \"salvation,\" in the context of Paul's legal struggle and imprisonment, it likely carries the sense of \"vindication\" or \"deliverance\" from his current crisis.\n\n**\"Conduct yourselves as citizens\" (v. 27)**: The Greek *politeuesthe* specifically means to live or behave as a citizen. Philippi was a Roman colony, and its residents were proud of their Roman citizenship. Paul uses this political metaphor to tell them that their primary \"citizenship\" and its attendant obligations belong to the gospel.\n\n**\"Omen\" (v. 28)**: *Endeixis* is a sign, proof, or indicator. Given the context of the \"struggle\" (v. 30), it suggests a public sign or omen to the watchers of the contest."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "If then there is any encouragement in Christ, if any consolation from love, if any shared fellowship in the Spirit, if any deep-seated affection and compassion,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "make my joy complete: be of the same mind, maintaining the same love, united in soul, focusing on the one thing that matters.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Do nothing out of partisan ambition or empty vanity, but in true humility consider others as more important than yourselves.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Do not let each person look out only for their own interests, but let each also look out for the interests of others.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Adopt this mindset among yourselves, which was also in Christ Jesus:",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Who, though he existed in the very form of God, did not consider equality with God as something to be exploited for his own advantage.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Instead, he emptied himself by taking the form of a slave, being born in the likeness of men. And being found in outward appearance as a man,",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "he humbled himself by becoming obedient to the point of death—even death on a cross.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For this reason, God highly exalted him and graciously granted him the name that is above every name,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "so that at the name of Jesus every knee should bow—of those in the heavens, those on the earth, and those in the underworld—",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "and every tongue should acknowledge that Jesus Christ is Lord, to the glory of God the Father.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Therefore, my dear friends, just as you have always obeyed—not only in my presence, but now much more in my absence—continue to bring your own salvation to its full fruition with awe and trembling.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "For it is God who is the one energized and at work within you, producing both the desire and the internal power to act for the sake of his good purpose.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Do everything without grumbling or arguing,",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "so that you may become blameless and pure, children of God without fault in the midst of a warped and perverted generation. You shine among them like stars in the universe,",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "holding out the word of life. This will be my reason for boasting on the Day of Christ, proving that I did not run my race in vain or labor for nothing.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "But even if my life is being poured out like a drink offering upon the sacrificial service of your faith, I rejoice and share that joy with all of you.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "In the same way, you also should rejoice and share your joy with me.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Now I hope in the Lord Jesus to send Timothy to you soon, so that I may be encouraged by getting news about you.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "For I have no one else quite like him—a kindred spirit who will genuinely care for your welfare.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For everyone else is looking out for their own interests, not those of Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But you know his proven character: that like a child serving with a father, he has slaved alongside me for the sake of the good news.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Therefore, I hope to send him as soon as I see how things go with me.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "And I am confident in the Lord that I myself will be coming soon.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "I have, however, considered it necessary to send Epaphroditus back to you. He is my brother, coworker, and fellow soldier, as well as your messenger and the ministering priest to my needs.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "He has been longing for all of you and has been deeply distressed because you heard he was ill.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Indeed, he was so ill he nearly died. But God had mercy on him—and not only on him but also on me, so that I would not have one grief piled upon another.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "So I am all the more eager to send him, so that when you see him again you may rejoice and I may be less anxious.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Welcome him, then, in the Lord with all joy, and hold people like him in high honor.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "For he came close to death for the sake of the work of Christ, gambling with his very life to make up for the help you were unable to give me yourselves.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Deep-seated affection\" (v. 1)**: The Greek *splangchna* literally refers to the internal organs (the \"gut\"). In the ancient world, this was the seat of the most intense emotions and compassions, much as \"the heart\" is used in modern English. \"Deep-seated affection\" captures the visceral nature of the term.\n\n**\"Partisan ambition\" (v. 3)**: The word *eritheia* originally referred to a person working for hire, but it evolved to describe the \"self-seeking\" or \"factionalism\" found in political canvassing. It implies a divisive desire for personal or group advancement.\n\n**\"Something to be exploited\" (v. 6)**: The Greek *harpagmon* is notoriously difficult. Traditionally \"something to be grasped,\" it refers to a prize or a piece of plunder. The context here suggests that Christ already possessed equality with God (as he was in the *morphē* of God) but chose not to use that status for his own benefit or \"exploit\" it for self-gain.\n\n**\"Form... outward appearance\" (v. 6, 7, 8)**: Paul uses *morphē* (vv. 6, 7) and *schēma* (v. 8). *Morphē* refers to the essential nature or the outward expression of an inner reality (Christ was essentially God and essentially a slave). *Schēma* refers to the transitory, external appearance (he was recognized by others as a man).\n\n**\"Emptied himself\" (v. 7)**: The verb *ekenōsen* (the root of \"kenosis\") means to pour out until empty. This is a metaphorical description of Christ setting aside his divine privileges and status to take on the nature of a bondservant.\n\n**\"Bring your own salvation to its full fruition\" (v. 12)**: The verb *katergazesthe* means to work out, produce, or bring to completion. It does not imply \"earning\" salvation by works, but rather carrying out the implications of that salvation in the community's life, especially given that verse 13 clarifies it is God who provides the \"energy\" (*energōn*) to do so.\n\n**\"Awe and trembling\" (v. 12)**: While \"fear\" is the standard translation for *phobos*, in this context it refers to a profound reverence and \"awe\" before the presence and work of God, rather than terror.\n\n**\"Stars\" (v. 15)**: The Greek *phōstēres* refers to luminaries or heavenly bodies (like the sun, moon, and stars). It evokes the image of the faithful providing light in a dark world.\n\n**\"Kindred spirit\" (v. 20)**: The Greek *isopsychon* literally means \"equal-souled.\" It implies that Timothy and Paul are of the same mind and heart, sharing a unique bond of perspective.\n\n**\"Ministering priest\" / \"Sacrificial service\" (v. 17, 25, 30)**: Paul uses *leitourgos* and *leitourgia*, terms associated with public service and, specifically in a religious context, the service of a priest in a temple. He frames the Philippians' financial gift and Epaphroditus’s service as a priestly act of worship.\n\n**\"Gambling with his very life\" (v. 30)**: The Greek *paraboleusamenos* is a gambler’s term, meaning to \"expose oneself to danger\" or \"stake everything\" on a bet. Epaphroditus risked his life for the sake of the mission."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "As for what remains, my brothers and sisters, keep rejoicing in the Lord. Writing the same things to you is no burden for me, and for you it is a safeguard.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Watch out for those dogs! Watch out for those wicked workers! Watch out for “the mutilation”—those who demand cutting the body.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "For we are the true circumcision, who offer our spiritual service by the Spirit of God and find our pride in Christ Jesus, placing no confidence in the flesh—",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "even though I myself have reasons for such confidence. If anyone else thinks they have grounds for confidence in the flesh, I have more:",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "circumcised on the eighth day, of the people of Israel, of the tribe of Benjamin, a Hebrew born of Hebrews; according to the law, a Pharisee;",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "as for zeal, a persecutor of the church; as for the righteousness found in the law, I was blameless.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "But whatever things were gains to me, these I have come to consider a loss because of Christ.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "More than that, I truly consider everything to be a loss because of the surpassing value of knowing Christ Jesus my Lord. For his sake, I have suffered the loss of all things—and I consider them mere filth—so that I may gain Christ",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "and be found in him. I do not have a righteousness of my own derived from the law, but that which comes through the faithfulness of Christ—the righteousness from God that is based on faith.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "My goal is to know him and the power of his resurrection and the shared participation in his sufferings, being shaped into the very form of his death,",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "if somehow I might arrive at the resurrection out from the dead.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "It is not that I have already reached this or have already been perfected, but I press on to seize it, because I was also seized by Christ.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Brothers and sisters, I do not consider myself to have seized it yet. But one thing I do: forgetting what lies behind and straining toward what lies ahead,",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "I press on toward the finish line for the prize of God’s upward call in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Therefore, let those of us who are mature have this mindset; and if you think differently about anything, God will reveal that to you as well.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "Only let us keep in step with the standard we have already attained.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Join together in imitating me, brothers and sisters, and keep your eyes on those who live according to the pattern we set for you.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "For many live—as I have often told you, and now tell you even with tears—as enemies of Christ’s cross.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Their end is destruction; their god is their belly; their glory is in their shame; they have set their minds on earthly things.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "But our commonwealth exists in the heavens, from which we also eagerly await a Savior, the Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "He will reconfigure our body of humiliation to be like his body of glory, by the power that enables him to bring all things under his authority.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The mutilation\" (v. 2)**: The Greek *katatomē* is a biting pun on *peritomē* (circumcision). By using this term, Paul suggests that those demanding circumcision for Gentiles are not performing a sacred rite, but are merely \"mutilating\" or \"cutting up\" the flesh, similar to pagan practices forbidden in the Torah (Leviticus 21:5).\n\n**\"Spiritual service\" (v. 3)**: The verb *latreuō* refers to religious or priestly service. Paul is redefining the locus of true worship—it is not in the physical ritual of the temple or the flesh, but in the activity of the Spirit.\n\n**\"Filth\" (v. 8)**: The Greek *skubala* is a vulgar and visceral term. It refers to excrement, dung, or the kitchen scraps thrown out to dogs. The traditional \"rubbish\" or \"refuse\" is often too polite to capture the shock of Paul’s rhetorical move here, where he devalues his former status in the strongest possible terms.\n\n**\"Faithfulness of Christ\" (v. 9)**: The Greek *pistis Christou* is translated here as a subjective genitive (\"the faithfulness of Christ\") rather than the traditional objective genitive (\"faith in Christ\"). This emphasizes that the basis for justification is Christ's own fidelity to God's mission, which the believer then participates in through faith.\n\n**\"Shaped into the very form\" (v. 10)**: The participle *summorphizomenos* carries the sense of an internal transformation that results in an outward likeness. Paul is describing a process where the believer's life begins to take on the \"shape\" of Christ’s self-sacrificial death.\n\n**\"Seize... seized\" (v. 12)**: The Greek uses a wordplay with *katalambanō*. Paul is \"pursuing\" (*diōkō*) the prize because he was \"apprehended\" or \"seized\" by Christ. This likely alludes to his experience on the Damascus Road, where Christ forcibly redirected his life.\n\n**\"Keep in step\" (v. 16)**: The verb *stoicheō* means to walk in a straight line or to march in military formation. It implies a disciplined adherence to a shared standard of conduct.\n\n**\"Commonwealth\" (v. 20)**: The Greek *politeuma* refers to a colony of foreigners who maintain the laws and citizenship of their home country. Since Philippi was a Roman *colonia*, the audience would have immediately understood this: just as they were Romans living in Macedonia, they are now \"citizens of heaven\" living on earth, representing the interests of their true home.\n\n**\"Reconfigure\" (v. 21)**: The verb *metaschēmatizō* refers to changing the outward form or appearance (*schēma*). It contrasts with the \"body of humiliation\"—the mortal, frail existence of the present age."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, my brothers, whom I love and deeply long for—my joy and my victor’s wreath—stand firm in the Lord in this way, my beloved friends.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I appeal to Euodia and I appeal to Syntyche to adopt the same mindset in the Lord.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "Yes, and I ask you also, my true yoke-mate, help these women, for they contended by my side in the work of the gospel along with Clement and the rest of my co-workers, whose names are in the book of life.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Rejoice in the Lord always; again I will say it: rejoice!",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "Let your gracious yielding be recognized by everyone. The Lord is near.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Do not be anxious about anything, but in everything, by prayer and petition with thanksgiving, let your requests be made known to God.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And the peace of God, which rises above all human understanding, will garrison your hearts and your mental designs in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Finally, brothers, whatever is true, whatever is noble, whatever is just, whatever is pure, whatever is lovely, whatever is admirable—if there is any excellence and if there is anything worthy of praise—dwell on these things.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "What you learned and received and heard and saw in me, put these things into practice; and the deity of peace will be with you.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "I rejoiced in the Lord greatly that now at last you have caused your concern for me to bloom again; indeed, you were concerned all along, but you lacked the opportunity to show it.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "I am not saying this because I am in need, for I have learned to be self-sufficient in whatever circumstances I find myself.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "I know how to be brought low, and I know how to have more than enough. In any and every situation, I have been initiated into the secret of being well-fed and of going hungry, of having more than enough and of being in want.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "I have the strength for all things in the one who empowers me.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Nevertheless, you did well by becoming partners in my affliction.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "And you Philippians know well that in the early days of the gospel, when I departed from Macedonia, not a single church entered into a formal partnership with me in the matter of giving and receiving except you alone.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Even in Thessalonica, you sent help for my needs more than once.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "It is not that I am looking for the gift; rather, I am looking for the profit that is increasing to your account.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "I have been paid in full and I have more than enough; I am fully supplied, having received from Epaphroditus the things you sent—a fragrant aroma, a sacrifice that is acceptable and well-pleasing to God.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And my God will fully satisfy every need of yours according to his wealth in glory in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "To our God and Father be the glory forever and ever. Amen.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Greet every holy one in Christ Jesus. The brothers who are with me greet you.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "All the holy ones greet you, especially those of Caesar’s household.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "The grace of the Lord Jesus Christ be with your spirit.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Victor’s wreath\" (v. 1)**: The Greek *stephanos* refers to the laurel wreath given to a winning athlete or a guest of honor at a banquet, rather than the *diadēma* (royal crown) of a king. Paul views the Philippians as the proof of his successful apostolic \"race.\"\n\n**\"Gracious yielding\" (v. 5)**: The term *epieikes* describes a quality of \"sweet reasonableness\" or the willingness to yield one's legal rights for a higher good. It is the opposite of being rigorous or litigious.\n\n**\"Garrison\" (v. 7)**: The verb *phroureō* is a specific military term. Since Philippi was a Roman colony and a military outpost, the image of God’s peace acting as a protective garrison over their hearts would have been a vivid local metaphor.\n\n**\"Dwell on\" (v. 8)**: The Greek *logizesthe* is an accounting or philosophical term meaning to calculate, reckon, or give weight to. It implies a deliberate mental focus that shapes one's character.\n\n**\"Bloom again\" (v. 10)**: The verb *anathallō* is a botanical metaphor, suggesting a plant that sprouts or flourishes again after a dormant season.\n\n**\"Self-sufficient\" (v. 11)**: Paul uses the Stoic term *autarkēs*. To a Stoic, this meant being independent of all external circumstances. Paul adopts the word but redefines it; his sufficiency is not in himself, but \"in the one who empowers me\" (v. 13).\n\n**\"Initiated into the secret\" (v. 12)**: The verb *mueō* was technically used for initiation into the Greco-Roman \"mystery religions.\" Paul uses it to describe the spiritual \"secret\" of contentment that he has learned through experience.\n\n**\"Partnership / In the matter of / Paid in full\" (vv. 15-18)**: This section is dense with commercial and accounting terminology (*logos*, *dosis*, *lēmpsis*, *apechō*). Paul uses the language of a business ledger to describe their mutual support, culminating in *apechō* (v. 18), the technical term for \"payment received in full,\" indicating that their gift has settled any \"debt.\"\n\n**\"Caesar’s household\" (v. 22)**: This does not necessarily mean the Emperor's relatives, but rather the vast network of slaves, freedmen, and officials who ran the imperial administration. Its mention underscores that the gospel had penetrated the very center of Roman power while Paul was in custody."
    }
  ]
}