{
  "book": "Revelation",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "The unveiling of Jesus Christ, which God gave him to show his servants what must soon take place. He made it known through signs, sending it through his angel to his servant John,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "who testified to the word of God and the testimony of Jesus Christ—all that he saw.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Blessed is the one who reads aloud and those who hear the words of this prophecy and keep what is written in it, for the appointed time is near.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "John, to the seven assemblies in Asia: Grace to you and peace from the One Who Is and Who Was and Who Is Coming, and from the seven spirits before his throne,",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "and from Jesus Christ, the faithful witness, the firstborn from the dead, and the ruler of the kings of the earth. To him who loves us and freed us from our sins by his blood—",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "and made us a kingdom, priests to his God and Father—to him be glory and dominion into the ages of ages. Amen.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Look! He is coming with the clouds, and every eye will see him, even those who pierced him, and all the tribes of the earth will beat their chests in mourning over him. Yes, amen.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "\"I am the Alpha and the Omega,\" says the Lord God, the One Who Is and Who Was and Who Is Coming, the All-Powerful.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "I, John, your brother and fellow-participant in the tribulation and kingdom and patient endurance that are in Jesus—I found myself on the island called Patmos because of the word of God and the testimony of Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "I came to be in the Spirit on the Lord's day, and I heard behind me a great voice like a trumpet",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "saying, \"What you see, write in a scroll and send to the seven assemblies: to Ephesus, to Smyrna, to Pergamum, to Thyatira, to Sardis, to Philadelphia, and to Laodicea.\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And I turned to see the voice that was speaking with me. And when I turned, I saw seven golden lampstands,",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "and in the midst of the lampstands one like a son of man, clothed in a robe reaching to his feet and girded across his chest with a golden sash.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "His head and his hair were white as white wool, as snow, and his eyes were like a flame of fire.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "His feet were like fine bronze, as though refined in a furnace, and his voice was like the sound of many waters.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "In his right hand he held seven stars, and from his mouth came a sharp double-edged sword, and his face was like the sun shining in its full power.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "When I saw him, I fell at his feet as though dead. And he placed his right hand on me, saying, \"Do not be afraid. I am the first and the last,",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "and the living one—I was dead, and look, I am alive into the ages of ages—and I hold the keys of death and of Hades.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Write, then, what you have seen, both what is now and what is about to take place after this.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "As for the mystery of the seven stars that you saw in my right hand and the seven golden lampstands: the seven stars are the angels of the seven assemblies, and the seven lampstands are the seven assemblies.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Unveiling\" (v. 1)**: Greek ἀποκάλυψις literally means an uncovering or disclosure of something previously hidden. While \"revelation\" is standard, \"unveiling\" better preserves the concrete imagery and avoids the religious abstraction that \"revelation\" has acquired.\n\n**\"Made it known through signs\" (v. 1)**: The Greek ἐσήμανεν (from σημαίνω) means to signify or communicate through signs. This verb choice at the book's opening signals that what follows is symbolic communication—visions meant to be interpreted, not literal description.\n\n**\"Assemblies\" (vv. 4, 11, 20)**: Greek ἐκκλησία meant a gathered assembly or congregation. \"Church\" carries centuries of institutional connotation foreign to the original term, which first-century readers would have associated with civic assemblies and gathered communities.\n\n**\"The One Who Is and Who Was and Who Is Coming\" (vv. 4, 8)**: The Greek here is grammatically irregular—using nominative forms after a preposition requiring genitive. This appears intentional, treating the divine name as indeclinable, echoing the Greek rendering of the divine name (ὁ ὤν, \"the Being One\") from Exodus 3:14 in the Septuagint.\n\n**\"Freed\" (v. 5)**: The critical text reads λύσαντι (\"freed, released\"), not λούσαντι (\"washed\"). Some manuscripts have \"washed us from our sins,\" which became a familiar reading, but the better-attested text speaks of liberation rather than cleansing.\n\n**\"A kingdom\" (v. 6)**: The Greek βασιλείαν is singular—\"a kingdom,\" not \"kings.\" Christ has made believers into a collective kingdom (echoing Exodus 19:6), not individual monarchs.\n\n**\"Beat their chests in mourning\" (v. 7)**: Greek κόψονται refers to the physical gesture of striking one's chest in lamentation, not merely emotional sorrow. This preserves the concrete, embodied nature of the response.\n\n**\"One like a son of man\" (v. 13)**: The anarthrous ὅμοιον υἱὸν ἀνθρώπου directly echoes Daniel 7:13 (LXX). \"Son of man\" should be understood as the original audience would have—primarily as a reference to Daniel's heavenly figure, not as a circumlocution for \"human being.\"\n\n**\"Fine bronze\" (v. 15)**: Greek χαλκολίβανος is a rare compound word of uncertain meaning, possibly referring to a high-quality bronze alloy or bronze with a distinctive sheen. The point is brilliance and preciousness.\n\n**\"Hades\" (v. 18)**: Greek ᾅδης refers to the realm of the dead (the Greek equivalent of Hebrew Sheol), not to \"hell\" in the sense of a place of punishment. The imagery is of Christ holding authority over the entire domain of death."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "To the messenger of the assembly in Ephesus write: These things says the one who holds the seven stars in his right hand, the one who walks among the seven golden lampstands:",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I know your works—your labor and your patient endurance—and that you cannot tolerate evil people. You tested those who call themselves apostles and are not, and found them to be false.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "You have endurance; you have borne up for the sake of my name and have not grown weary.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But I have this against you: you have abandoned your first love.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Remember then from what height you have fallen. Repent, and do the works you did at first. Otherwise, I am coming to you, and I will remove your lampstand from its place—unless you repent.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But this you have: you hate the works of the Nicolaitans, which I also hate.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Let the one who has an ear hear what the Spirit says to the assemblies. To the one who conquers I will give the right to eat from the tree of life, which is in the paradise of God.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And to the messenger of the assembly in Smyrna write: These things says the First and the Last, who was dead and came to life:",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "I know your affliction and your poverty—yet you are rich—and the slander from those who claim to be Jews and are not, but are a congregation of Satan.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Do not fear any of what you are about to suffer. Look: the devil is about to throw some of you into prison so that you may be tested, and you will have affliction for ten days. Be faithful until death, and I will give you the victor's wreath of life.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Let the one who has an ear hear what the Spirit says to the assemblies. The one who conquers will never be harmed by the second death.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And to the messenger of the assembly in Pergamum write: These things says the one who has the sharp, double-edged sword:",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "I know where you dwell—where the throne of Satan is. Yet you hold fast to my name, and you did not deny your faithfulness to me even in the days when Antipas, my faithful witness, was killed among you, where Satan dwells.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "But I have a few things against you: you have some there who hold to the teaching of Balaam, who taught Balak to place a snare before the sons of Israel—to eat food sacrificed to idols and to engage in sexual immorality.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "So also you have some who hold to the teaching of the Nicolaitans in the same way.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Therefore repent! Otherwise, I am coming to you quickly, and I will wage war against them with the sword of my mouth.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Let the one who has an ear hear what the Spirit says to the assemblies. To the one who conquers I will give some of the hidden manna, and I will give him a white stone, and on the stone a new name written that no one knows except the one who receives it.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And to the messenger of the assembly in Thyatira write: These things says the Son of God, whose eyes are like a flame of fire and whose feet are like burnished bronze:",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "I know your works—your love and faithfulness and service and patient endurance—and that your latter works surpass your first.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "But I have this against you: you tolerate the woman Jezebel, who calls herself a prophetess and teaches and leads astray my servants to engage in sexual immorality and to eat food sacrificed to idols.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "I gave her time to repent, but she refuses to repent of her sexual immorality.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Look: I am throwing her onto a sickbed, and those who commit adultery with her into great tribulation, unless they repent of her practices.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "And I will strike her children dead with pestilence, and all the assemblies will know that I am the one who searches the depths of mind and heart, and I will give to each of you according to your works.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "But to the rest of you in Thyatira, all who do not hold this teaching, who have not known what they call \"the deep things of Satan\"—I am placing no other burden on you.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "Only hold fast to what you have until I come.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "And to the one who conquers and keeps my works until the end, I will give authority over the nations,",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "and he will shepherd them with an iron rod, as clay pots are shattered—",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "just as I myself have received from my Father. And I will give him the morning star.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Let the one who has an ear hear what the Spirit says to the assemblies.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Messenger\" (vv. 1, 8, 12, 18)**: Greek ἄγγελος means \"messenger\" and only later became specialized as \"angel.\" Whether these are human representatives/leaders of the churches or spiritual guardians is debated; \"messenger\" preserves the ambiguity.\n\n**\"Assembly\" (throughout)**: Greek ἐκκλησία denotes a called-out gathering or assembly. While \"church\" is traditional, it carries institutional connotations foreign to the first-century context, where these were house gatherings without buildings or formal hierarchy.\n\n**\"Victor's wreath\" (v. 10)**: Greek στέφανος refers to the wreath awarded to athletic or military victors, distinct from διάδημα (the royal crown). \"Crown\" in modern English evokes royalty rather than the image of hard-won victory.\n\n**\"Congregation of Satan\" (v. 9)**: Greek συναγωγή means \"gathering\" or \"congregation\"—the same word used for Jewish assemblies. Retaining \"congregation\" rather than the transliterated \"synagogue\" makes the contrast clearer: these people gather, but their assembly belongs to Satan.\n\n**\"Snare\" (v. 14)**: Greek σκάνδαλον originally meant the trigger-stick of a trap. \"Stumbling block\" has become so familiar that it has lost its force; \"snare\" recovers the sense of deliberate entrapment.\n\n**\"Strike dead with pestilence\" (v. 23)**: The phrase ἀποκτενῶ ἐν θανάτῳ (\"I will kill with death\") is Hebraic; \"death\" here likely echoes the LXX usage for plague or pestilence as an instrument of divine judgment.\n\n**\"Depths of mind and heart\" (v. 23)**: Greek νεφροὺς καὶ καρδίας literally \"kidneys and hearts.\" In Hebrew anthropology, kidneys were the seat of deep emotions and hidden motivations. \"Mind and heart\" conveys this to English readers.\n\n**\"The deep things of Satan\" (v. 24)**: The phrase ὡς λέγουσιν (\"as they say/call them\") indicates this was the group's own language. They likely claimed to know \"deep things\" (possibly of God); the risen Christ ironically relabels their teaching as Satanic depths."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "And to the angel of the assembly in Sardis write: These things says the one who holds the seven spirits of God and the seven stars: I know your works—that you have a reputation for being alive, yet you are dead.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Wake up, and strengthen what remains that was about to die, for I have not found your works complete before my God.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Remember therefore how you received and heard; keep it, and turn back. If then you do not wake up, I will come like a thief, and you will never know what hour I will come upon you.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But you have a few people in Sardis who have not stained their garments, and they will walk with me in white, because they are worthy.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "The one who conquers will likewise be clothed in white garments, and I will never blot out his name from the scroll of life, and I will declare his name before my Father and before his angels.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Let the one who has an ear hear what the Spirit says to the assemblies.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And to the angel of the assembly in Philadelphia write: These things says the Holy One, the True One, the one who holds the key of David, the one who opens and no one will shut, who shuts and no one opens:",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "I know your works. Look—I have set before you an opened door that no one can shut—because you have little power, yet you kept my word and did not deny my name.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Look—I will deliver some from the synagogue of Satan, those who claim to be Judeans and are not, but are lying. Look—I will make them come and bow down before your feet, and they will know that I have loved you.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Because you kept my word of patient endurance, I also will keep you from the hour of testing that is about to come upon the whole inhabited world, to test those who dwell on the earth.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "I am coming quickly. Hold fast to what you have, so that no one takes your crown.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "The one who conquers—I will make him a pillar in the temple of my God, and he will never go outside again. And I will write on him the name of my God, and the name of the city of my God—the new Jerusalem descending out of heaven from my God—and my own new name.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Let the one who has an ear hear what the Spirit says to the assemblies.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And to the angel of the assembly in Laodicea write: These things says the Amen, the faithful and true witness, the origin of God's creation:",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "I know your works—that you are neither cold nor hot. If only you were cold or hot!",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "So, because you are lukewarm—neither hot nor cold—I am about to vomit you out of my mouth.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Because you say, \"I am rich, I have grown wealthy, and I need nothing,\" and you do not know that you are the wretched one—pitiable and poor and blind and naked—",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "I counsel you to buy from me gold refined by fire so that you may be rich, and white garments so that you may clothe yourself and the shame of your nakedness not be exposed, and salve to anoint your eyes so that you may see.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Those whom I love, I rebuke and discipline. Be earnest, therefore, and turn back.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Look—I stand at the door and knock. If anyone hears my voice and opens the door, I will come in to him and dine with him, and he with me.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "The one who conquers—I will grant to him to sit with me on my throne, just as I also conquered and sat down with my Father on his throne.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Let the one who has an ear hear what the Spirit says to the assemblies.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Assembly/assemblies\"**: Greek ἐκκλησία meant a gathered community or civic assembly before it became a technical Christian term. \"Church\" carries too much institutional baggage for modern readers.\n\n**\"Reputation\" (v. 1)**: The Greek ὄνομα ἔχεις ὅτι ζῇς literally means \"you have a name that you are alive.\" Here ὄνομα functions as \"reputation\" or \"fame\"—they are known for being alive but are actually dead.\n\n**\"A few people\" (v. 4)**: The Greek ὀλίγα ὀνόματα (\"a few names\") is a Semitic idiom meaning \"a few persons.\" This usage also appears in Acts 1:15.\n\n**\"Scroll of life\" (v. 5)**: Greek βίβλος refers to a scroll, the standard writing format, not a bound book (βιβλίον could be either).\n\n**\"Conquers\" (vv. 5, 12, 21)**: Greek νικάω carries overtones of victory in combat or competition. Revelation's imagery is thoroughly martial, and \"conquers\" preserves this better than the softer \"overcomes.\"\n\n**\"Key of David\" (v. 7)**: An allusion to Isaiah 22:22, where Eliakim receives authority over the house of David. The original audience would recognize this as a claim to messianic authority.\n\n**\"Judeans\" (v. 9)**: Greek Ἰουδαῖος denotes ethnic and religious identity. \"Jews\" in modern English has shifted in connotation; \"Judeans\" better captures the first-century meaning of people claiming covenant identity.\n\n**\"The origin of God's creation\" (v. 14)**: Greek ἡ ἀρχή can mean \"beginning,\" \"origin,\" \"source,\" or \"ruler.\" Given the context and Johannine theology (cf. John 1:1-3), \"origin\" captures the sense that Christ is the source or firstcause of creation, not the first creature.\n\n**\"Vomit\" (v. 16)**: Greek ἐμέω means precisely this. Laodicea's lukewarm water supply (piped in via aqueduct, neither hot like Hierapolis's springs nor cold like Colossae's) would have made this image vivid and local.\n\n**\"My word of patient endurance\" (v. 10)**: The genitive τῆς ὑπομονῆς μου is ambiguous—either \"my message about patient endurance\" or \"the word that calls for endurance as I endured.\" The translation preserves the ambiguity.\n\n**\"Dine\" (v. 20)**: Greek δειπνέω refers to the main evening meal, a time of fellowship and intimacy, not a casual snack."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "After these things I looked, and there before me was a door standing open in heaven. And the first voice I had heard—like a trumpet speaking with me—said, \"Come up here, and I will show you what must take place after these things.\"",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "At once I came to be in the Spirit, and there before me a throne was set in heaven, with one seated on the throne.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "And the one seated there had the appearance of jasper stone and carnelian, and encircling the throne was a rainbow with the appearance of emerald.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Surrounding the throne were twenty-four thrones, and seated on the thrones were twenty-four elders, clothed in white garments, with golden victor's wreaths on their heads.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "From the throne came flashes of lightning, and rumblings, and peals of thunder. Before the throne seven torches of fire were blazing—these are the seven spirits of God.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And before the throne was something like a sea of glass, resembling crystal. In the center, around the throne, were four living creatures, covered with eyes in front and behind.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "The first living creature was like a lion, the second living creature was like an ox, the third living creature had a face like that of a human, and the fourth living creature was like an eagle in flight.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Each of the four living creatures had six wings, and all around and within they were covered with eyes. Day and night they never cease, saying: \"Holy, holy, holy— Lord God, the All-Sovereign, who was and who is and who is coming.\"",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And whenever the living creatures give glory and honor and thanksgiving to the one seated on the throne, the one who lives forever and ever,",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "the twenty-four elders fall before the one seated on the throne and worship the one who lives forever and ever. They cast their wreaths before the throne, saying:",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "\"Worthy are you, our Lord and God, to receive glory and honor and power, for you created all things, and by your will they existed and came into being.\"",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Victor's wreaths\" / \"wreaths\" (vv. 4, 10)**: The Greek στέφανος refers to the wreath awarded to victors in athletic competitions or military triumphs—not the royal crown (διάδημα). The distinction matters: these are honors bestowed for achievement, which the elders then cast before the throne, acknowledging that any victory of theirs belongs ultimately to God.\n\n**\"Rumblings\" (v. 5)**: The Greek φωναί literally means \"sounds\" or \"voices,\" but in the context of lightning and thunder, it refers to the rumbling sounds accompanying a storm theophany (compare Exodus 19:16). Many translations use \"rumblings\" here rather than the more literal \"voices.\"\n\n**\"The All-Sovereign\" (v. 8)**: The Greek παντοκράτωρ (often rendered \"Almighty\") literally means \"holder of all power\" or \"ruler over all.\" It translates Hebrew titles for God including \"Lord of Hosts\" (Yahweh Sabaoth). \"All-Sovereign\" captures both the power and the ruling authority implied.\n\n**\"Who was and who is and who is coming\" (v. 8)**: Notably, the third member is not \"who will be\" but \"who is coming\" (ὁ ἐρχόμενος)—God is not merely eternal but actively approaching, moving toward his creation. This threefold formula appears throughout Revelation.\n\n**\"Our Lord and God\" (v. 11)**: This phrase (ὁ κύριος καὶ ὁ θεὸς ἡμῶν) would have carried political weight for the original audience. The Emperor Domitian claimed the title *dominus et deus noster* (\"our lord and god\"). The acclamation pointedly reserves this title for the one on the heavenly throne.\n\n**\"They existed and came into being\" (v. 11)**: The Greek has two verbs: ἦσαν (\"they were/existed\") and ἐκτίσθησαν (\"they were created\"). Some take the first verb to mean \"they existed [in your will/purpose]\" before being created, while others see it as emphasizing that existence itself is grounded in divine will. I preserved both verbs rather than collapsing them."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "And I saw in the right hand of the One seated on the throne a scroll written on the inside and on the back, sealed with seven seals.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And I saw a mighty angel proclaiming with a loud voice: \"Who is worthy to open the scroll and to break its seals?\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And no one in heaven or on the earth or under the earth was able to open the scroll or even to look at it.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And I was weeping bitterly because no one was found worthy to open the scroll or to look at it.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Then one of the elders said to me: \"Stop weeping! Look—the Lion from the tribe of Judah, the Root of David, has conquered so as to open the scroll and its seven seals.\"",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "And I saw, in the center of the throne and of the four living creatures, and in the center of the elders, a Lamb standing as though slaughtered, having seven horns and seven eyes—which are the seven spirits of God sent out into all the earth.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "And he came and took the scroll from the right hand of the One seated on the throne.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And when he took the scroll, the four living creatures and the twenty-four elders fell down before the Lamb, each one holding a harp and golden bowls full of incense, which are the prayers of the holy ones.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "And they sing a new song, saying: \"Worthy are you to take the scroll and to open its seals, for you were slaughtered and by your blood you purchased people for God from every tribe and tongue and people and nation,",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "and you made them a kingdom and priests for our God, and they reign upon the earth.\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then I looked, and I heard the sound of many angels surrounding the throne and the living creatures and the elders—and their number was myriads upon myriads and thousands upon thousands—",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "saying with a loud voice: \"Worthy is the Lamb who was slaughtered to receive power and wealth and wisdom and might and honor and glory and blessing!\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And every creature in heaven and on earth and under the earth and upon the sea—and all that is in them—I heard saying: \"To the One seated on the throne and to the Lamb be blessing and honor and glory and dominion forever and ever!\"",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "And the four living creatures said, \"Amen!\" And the elders fell down and worshiped.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Scroll\" (v. 1)**: Greek βιβλίον in this context refers to a scroll rather than a codex (bound book). The detail that it is written on both sides (opisthograph) and sealed would be understood by first-century readers as indicating a particularly full or significant document—possibly evoking Ezekiel 2:9-10.\n\n**\"Standing as though slaughtered\" (v. 6)**: The Greek ὡς ἐσφαγμένον indicates the Lamb bears the visible marks of having been slaughtered, yet is standing—alive. This paradox (announced as Lion, appearing as slain-yet-living Lamb) is central to Revelation's theology. The verb σφάζω specifically denotes ritual slaughter, evoking sacrificial imagery.\n\n**\"Conquered\" (v. 5)**: Greek ἐνίκησεν (from νικάω) means \"has conquered\" or \"has overcome\"—language that becomes thematic throughout Revelation. \"Prevailed\" (traditional) is weaker; \"conquered\" preserves the military metaphor that John deliberately subverts: the Lion conquers by being slaughtered as a Lamb.\n\n**\"Holy ones\" (v. 8)**: Greek ἅγιοι means \"holy ones\" or \"those set apart.\" While \"saints\" is not wrong, in modern English it often connotes canonized individuals or exceptional piety, whereas the Greek refers to all God's people.\n\n**\"Purchased people for God\" (v. 9)**: The verb ἠγόρασας is marketplace language—\"bought, purchased.\" The object (\"people\") is implied but made clear by verse 10's reference to \"them.\" The preposition ἐκ (\"from every tribe...\") indicates the source from which they were purchased.\n\n**\"A kingdom and priests\" (v. 10)**: This echoes Exodus 19:6, Israel's identity now extended to those purchased from all nations. The present tense \"they reign\" (βασιλεύουσιν) in the critical text suggests a present reality, not merely a future hope.\n\n**\"Dominion\" (v. 13)**: Greek κράτος denotes sovereign power or ruling might—stronger than general \"power\" (δύναμις appears separately in v. 12). The final doxology ascribes to God and the Lamb together what belongs to God alone, a striking theological claim."
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "And I saw when the Lamb opened one of the seven seals, and I heard one of the four living creatures speaking with a voice like thunder: \"Come!\"",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And I looked, and there was a white horse, and the one sitting on it held a bow. A victor's crown was given to him, and he went out conquering and to conquer.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And when he opened the second seal, I heard the second living creature saying, \"Come!\"",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "And another horse went out, fiery red. To the one sitting on it was given authority to take peace from the earth so that people would slaughter one another, and a great sword was given to him.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And when he opened the third seal, I heard the third living creature saying, \"Come!\" And I looked, and there was a black horse, and the one sitting on it held a pair of scales in his hand.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "And I heard what seemed like a voice from among the four living creatures, saying, \"A quart of wheat for a denarius, and three quarts of barley for a denarius—but do not damage the oil and the wine.\"",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And when he opened the fourth seal, I heard the voice of the fourth living creature saying, \"Come!\"",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "And I looked, and there was a pallid horse, and the name of the one sitting on it was Death, and Hades followed close behind him. Authority was given to them over a fourth of the earth, to kill by sword and by famine and by plague and by the wild beasts of the earth.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And when he opened the fifth seal, I saw beneath the altar the souls of those who had been slaughtered because of the word of God and because of the testimony they had maintained.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "And they cried out with a loud voice, saying, \"How long, O Sovereign Master, holy and true, until you judge and avenge our blood against those who dwell on the earth?\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And a white robe was given to each of them, and they were told to rest a little while longer, until the full number was reached—both their fellow servants and their brothers and sisters who were about to be killed just as they had been.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And I saw when he opened the sixth seal: there was a great earthquake, and the sun became black as haircloth sackcloth, and the whole moon became like blood,",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "and the stars of heaven fell to the earth like a fig tree dropping its unripe figs when shaken by a great wind.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And the sky was split apart like a scroll being rolled up, and every mountain and island were moved from their places.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And the kings of the earth and the magnates and the military commanders and the wealthy and the powerful, and every slave and free person, hid themselves in the caves and among the rocks of the mountains.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "And they say to the mountains and to the rocks, \"Fall on us and hide us from the face of the one sitting on the throne and from the wrath of the Lamb,",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "for the great day of their wrath has come, and who is able to stand?\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Victor's crown\" (v. 2)**: The Greek στέφανος is the crown awarded to victors in athletic contests or military conquests, not the διάδημα (royal diadem). This distinction matters for interpreting the rider's identity.\n\n**\"Fiery red\" (v. 4)**: πυρρός derives from πῦρ (fire) and denotes a flame-colored red, suggesting both blood and fire—appropriate for the war horse.\n\n**\"Slaughter\" (v. 4, 9)**: σφάζω is visceral language used for butchering animals, including sacrificial slaughter. The same verb describes the Lamb \"as though slaughtered\" in 5:6, creating a deliberate echo: the martyrs have been slaughtered like their Lord.\n\n**\"A quart of wheat for a denarius\" (v. 6)**: A χοῖνιξ (roughly a quart) was a day's grain ration; a denarius was a day's wage. This is famine pricing—an entire day's labor for bare subsistence, with nothing left for family or other needs.\n\n**\"Pallid\" (v. 8)**: χλωρός typically means \"green\" (as in vegetation) but here describes the sickly, yellowish-green pallor of a corpse. \"Pale\" in English loses this specific connotation.\n\n**\"Plague\" (v. 8)**: The Greek θάνατος here likely renders the Hebrew דֶּבֶר (plague/pestilence), following LXX convention. The fourfold destruction (sword, famine, plague, wild beasts) echoes Ezekiel 14:21.\n\n**\"Sovereign Master\" (v. 10)**: δεσπότης emphasizes absolute authority and ownership—stronger than κύριος (Lord). The martyrs appeal to God's sovereign right to execute justice.\n\n**\"Those who dwell on the earth\" (v. 10)**: This phrase (οἱ κατοικοῦντες ἐπὶ τῆς γῆς) functions as a technical term in Revelation for humanity in its hostility to God—the earth-dwellers who align themselves against heaven.\n\n**\"Their wrath\" (v. 17)**: The SBLGNT reads αὐτῶν (their), referring to both the one on the throne and the Lamb jointly, rather than \"his wrath.\" This preserves the text's startling theology: the Lamb shares in divine wrath."
    },
    {
      "chapter": 7,
      "verses": [
        {
          "verse": 1,
          "text": "After this I saw four angels standing at the four corners of the earth, holding back the four winds of the earth so that no wind would blow on the earth or on the sea or on any tree.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And I saw another angel ascending from the rising of the sun, holding the seal of the living God, and he cried out with a great voice to the four angels who had been given authority to harm the earth and the sea,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "saying, \"Do not harm the earth or the sea or the trees until we have sealed the servants of our God on their foreheads.\"",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And I heard the number of those who were sealed: one hundred forty-four thousand, sealed from every tribe of the sons of Israel—",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "from the tribe of Judah twelve thousand sealed, from the tribe of Reuben twelve thousand, from the tribe of Gad twelve thousand,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "from the tribe of Asher twelve thousand, from the tribe of Naphtali twelve thousand, from the tribe of Manasseh twelve thousand,",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "from the tribe of Simeon twelve thousand, from the tribe of Levi twelve thousand, from the tribe of Issachar twelve thousand,",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "from the tribe of Zebulun twelve thousand, from the tribe of Joseph twelve thousand, from the tribe of Benjamin twelve thousand sealed.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "After these things I looked, and behold—a vast crowd that no one could count, from every nation and tribes and peoples and languages, standing before the throne and before the Lamb, clothed in white robes, with palm branches in their hands.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "And they cry out with a great voice, saying, \"Salvation belongs to our God, who sits upon the throne, and to the Lamb!\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And all the angels stood encircling the throne and the elders and the four living creatures, and they fell on their faces before the throne and worshiped God,",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "saying, \"Amen! Blessing and glory and wisdom and thanksgiving and honor and power and strength be to our God unto the ages of ages! Amen.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And one of the elders spoke up and said to me, \"These who are clothed in the white robes—who are they, and where have they come from?\"",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "And I said to him, \"My lord, you know.\" And he said to me, \"These are the ones coming out of the great tribulation, and they have washed their robes and made them white in the blood of the Lamb.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For this reason they are before the throne of God, and they serve him day and night in his sanctuary, and the one who sits on the throne will shelter them with his presence.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "They will hunger no more, nor will they thirst anymore, nor will the sun beat down on them, nor any scorching heat,",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "because the Lamb at the center of the throne will shepherd them and guide them to springs of living water, and God will wipe away every tear from their eyes.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Holding back\" (v. 1)**: The Greek κρατοῦντας means \"gripping, seizing, holding firmly\"—the angels are actively restraining the destructive winds.\n\n**\"Harm\" (vv. 2-3)**: The Greek ἀδικῆσαι carries the sense of \"doing wrong to, injuring, damaging.\" This is not neutral activity but harmful action—the angels are being held back from inflicting damage.\n\n**\"Spoke up\" (v. 13)**: Greek ἀπεκρίθη literally means \"answered,\" but in Semitic idiom (common in Revelation) it often introduces speech without requiring a prior question. \"Spoke up\" captures this initiatory sense.\n\n**\"The ones coming out of\" (v. 14)**: The Greek uses a present participle (οἱ ἐρχόμενοι), which I have preserved. Many translations render this as past tense (\"who have come\"), but the present form may suggest an ongoing procession—people continually arriving from the great tribulation.\n\n**\"Will shelter them with his presence\" (v. 15)**: The Greek σκηνώσει ἐπ' αὐτούς literally means \"will spread his tent over them\" or \"will tabernacle upon them.\" The verb σκηνόω is theologically loaded, evoking God's dwelling presence (the Shekinah) and the tabernacle in the wilderness. With the preposition ἐπί (\"over/upon\"), the image is of protective covering. \"Shelter them with his presence\" captures both the protective and divine-presence dimensions.\n\n**\"Springs of living water\" (v. 17)**: The phrase ἐπὶ ζωῆς πηγὰς ὑδάτων is unusual. The genitive ζωῆς (\"of life/living\") could modify either \"springs\" or \"waters.\" \"Living water\" is the more natural English rendering and connects to the Johannine theme (John 4:10-14; 7:38).\n\n**Sevenfold doxology (v. 12)**: The seven attributes—blessing, glory, wisdom, thanksgiving, honor, power, strength—each have the definite article in Greek, giving them emphasis and perhaps treating them as complete categories: *the* blessing, *the* glory, etc. I have omitted the articles for readability while preserving the sevenfold structure.\n\n**Isaiah echoes (vv. 16-17)**: These verses draw heavily on Isaiah 49:10 (\"they shall not hunger or thirst, neither scorching wind nor sun shall strike them\") and Isaiah 25:8 (\"he will wipe away tears from all faces\"). The original audience, steeped in the Septuagint, would have recognized these promises of eschatological restoration."
    },
    {
      "chapter": 8,
      "verses": [
        {
          "verse": 1,
          "text": "And when he opened the seventh seal, there was silence in heaven for about half an hour.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And I saw the seven angels who stand before God, and seven trumpets were given to them.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "And another angel came and stood at the altar, holding a golden censer, and much incense was given to him so that he might offer it with the prayers of all the holy ones upon the golden altar before the throne.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "And the smoke of the incense rose with the prayers of the holy ones from the angel's hand before God.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Then the angel took the censer and filled it with fire from the altar and hurled it onto the earth—and there came thunders and rumblings and flashes of lightning and an earthquake.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And the seven angels holding the seven trumpets prepared themselves to sound them.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "And the first sounded his trumpet, and there came hail and fire mixed with blood, and it was hurled onto the earth. A third of the earth was burned up, and a third of the trees were burned up, and all the green vegetation was burned up.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "And the second angel sounded his trumpet, and something like a great mountain ablaze with fire was hurled into the sea. A third of the sea became blood,",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "and a third of the living creatures in the sea died, and a third of the ships were destroyed.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And the third angel sounded his trumpet, and a great star fell from heaven, burning like a torch, and it fell on a third of the rivers and on the springs of water.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "The name of the star is called Wormwood. A third of the waters became wormwood, and many people died from the waters because they had been made bitter.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And the fourth angel sounded his trumpet, and a third of the sun was struck, and a third of the moon, and a third of the stars, so that a third of them was darkened and the day did not shine for a third of its hours, and the night likewise.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "And I looked, and I heard an eagle flying at the zenith, crying out with a loud voice: \"Woe! Woe! Woe to those who dwell on the earth, because of the remaining trumpet blasts from the three angels who are about to sound!\"",
          "paragraphStart": true
        }
      ],
      "notes": "**\"The seven angels\" (v. 2)**: The definite article (τοὺς ἑπτὰ ἀγγέλους) indicates a known group—likely the seven principal angels of Jewish apocalyptic tradition (cf. Tobit 12:15, 1 Enoch). These are not just \"seven angels\" but \"the seven angels.\"\n\n**\"Holy ones\" (v. 3, 4)**: Greek ἁγίων. While \"saints\" is traditional, it has accumulated associations with canonized individuals in later Christian usage. \"Holy ones\" more accurately conveys the original sense: God's consecrated people.\n\n**\"Offer it with\" (v. 3)**: The Greek δώσει ταῖς προσευχαῖς is difficult—literally \"give to the prayers.\" The sense is that the incense accompanies and enhances the prayers as they ascend. \"Offer it with\" captures this cultic action.\n\n**\"Thunders and rumblings\" (v. 5)**: The sequence βρονταὶ καὶ φωναὶ καὶ ἀστραπαί echoes the Sinai theophany (Exodus 19:16). φωναί here means \"sounds\" or \"rumblings\" rather than articulate voices—the terrifying noise of divine presence.\n\n**\"Green vegetation\" (v. 7)**: χόρτος χλωρός refers broadly to green growing things, not just lawn grass. The plague imagery echoes Exodus 9:23-25.\n\n**\"At the zenith\" (v. 13)**: μεσουρανήματι literally means \"mid-heaven\"—the point directly overhead where the sun stands at noon. This is the position of maximum visibility; everyone on earth can see and hear this messenger.\n\n**\"Eagle\" (v. 13)**: Some later manuscripts read \"angel,\" but the critical text has ἀετοῦ (eagle). The eagle as harbinger of doom appears in other prophetic texts (cf. Hosea 8:1; Habakkuk 1:8)."
    },
    {
      "chapter": 9,
      "verses": [
        {
          "verse": 1,
          "text": "And the fifth angel sounded his trumpet. I saw a star that had fallen from heaven to the earth, and the key to the shaft of the abyss was given to him.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He opened the shaft of the abyss, and smoke rose from the shaft like smoke from a great furnace, and the sun and the air were darkened by the smoke from the shaft.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Out of the smoke, locusts came onto the earth, and authority was given to them like the authority that scorpions of the earth possess.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "They were told not to harm the grass of the earth, nor any green plant, nor any tree—only those people who do not have the seal of God on their foreheads.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And it was granted to them not to kill them, but that they would be tormented for five months. Their torment is like the torment of a scorpion when it strikes a person.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "In those days people will seek death and will never find it; they will long to die, and death flees from them.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "The forms of the locusts were like horses prepared for war. On their heads were what looked like crowns of gold, and their faces were like human faces.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "They had hair like women's hair, and their teeth were like those of lions.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "They had breastplates like iron breastplates, and the sound of their wings was like the sound of many horse-drawn chariots charging into battle.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "They have tails like scorpions, with stingers, and in their tails lies their authority to harm people for five months.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "They have ruling over them as king the angel of the abyss. His name in Hebrew is Abaddon, and in Greek he bears the name Apollyon.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "The first woe has passed. Look—two woes are still coming after these things.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "And the sixth angel sounded his trumpet. I heard a single voice from the four horns of the golden altar that stands before God,",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "saying to the sixth angel who held the trumpet, \"Release the four angels who are bound at the great river Euphrates.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And the four angels were released—those who had been prepared for this very hour and day and month and year—to kill a third of humanity.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "The number of the mounted troops was two hundred million; I heard their number.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "And this is how I saw the horses in the vision and those seated on them: they had breastplates the color of fire, of hyacinth, and of sulfur. The heads of the horses were like lions' heads, and from their mouths poured fire and smoke and sulfur.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "By these three plagues a third of humanity was killed—by the fire and the smoke and the sulfur pouring from their mouths.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "For the power of the horses is in their mouths and in their tails; their tails are like serpents, having heads, and with these they inflict harm.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "The rest of humanity—those not killed by these plagues—did not repent of the works of their hands so as to stop worshiping demons and idols of gold and silver and bronze and stone and wood, which can neither see nor hear nor walk.",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "And they did not repent of their murders, nor of their sorceries, nor of their sexual immorality, nor of their thefts.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Star that had fallen\" (v. 1)**: The Greek πεπτωκότα is a perfect participle—the star had already fallen when John observed it. This is not a star in the process of falling but one whose descent is complete. The \"star\" is clearly a personal being (given a key, performing actions), likely an angelic figure.\n\n**\"Shaft of the abyss\" (v. 1, 2)**: Greek φρέαρ specifically means a well or shaft—a vertical passage. The ἄβυσσος (abyss) in Jewish apocalyptic thought is the primordial deep, the prison of demonic powers. \"Pit\" flattens the imagery of a narrow opening to a vast underworld.\n\n**\"Authority\" (vv. 3, 10, 19)**: Greek ἐξουσία appears repeatedly, emphasizing that these demonic forces operate within divinely permitted limits. This is not mere \"power\" (δύναμις) but authorized, delegated capacity.\n\n**\"Tormented\" (v. 5)**: βασανισθήσονται and βασανισμός denote torture or intense suffering—stronger than mere discomfort. The scorpion comparison emphasizes agonizing pain without death.\n\n**\"Forms\" (v. 7)**: ὁμοιώματα indicates appearances or likenesses—what they looked like, not necessarily what they were.\n\n**\"Crowns of gold\" (v. 7)**: στέφανοι are victory wreaths, not royal diadems (διαδήματα). The qualification \"like gold\" (ὅμοιοι χρυσῷ) suggests imitation rather than genuine gold—perhaps fitting for demonic pretenders.\n\n**\"Abaddon... Apollyon\" (v. 11)**: Both names mean \"Destruction\" or \"Destroyer.\" Hebrew אֲבַדּוֹן appears in Job and Proverbs as a name for the realm of the dead. The Greek Ἀπολλύων may carry a deliberate resonance with Apollo, whose locusts were associated with plague.\n\n**\"Two hundred million\" (v. 16)**: Literally \"two myriads of myriads\" (δισμυριάδες μυριάδων). This number—vastly exceeding any conceivable ancient army—signifies an innumerable, overwhelming force. First-century readers near the Euphrates frontier would think of dreaded Parthian cavalry.\n\n**\"Fire, hyacinth, sulfur\" (v. 17)**: The breastplate colors (πυρίνους, ὑακινθίνους, θειώδεις) match the three deadly emissions—red fire, blue-purple smoke, yellow sulfur. The vision is chromatically unified.\n\n**\"Sorceries\" (v. 21)**: φαρμάκων refers to magic arts involving potions and spells—the broader practice of manipulating spiritual forces through substances and incantations."
    },
    {
      "chapter": 10,
      "verses": [
        {
          "verse": 1,
          "text": "And I saw another mighty angel descending from heaven, wrapped in a cloud, with the rainbow upon his head. His face was like the sun, and his feet like pillars of fire.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "In his hand he held a little scroll that lay open. He planted his right foot on the sea and his left on the land,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "and he cried out with a loud voice, the way a lion roars. When he cried out, the seven thunders spoke with their own voices.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "When the seven thunders had spoken, I was about to write, but I heard a voice from heaven saying, \"Seal up what the seven thunders spoke, and do not write it down.\"",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "Then the angel whom I saw standing on the sea and on the land raised his right hand toward heaven",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "and swore by the one who lives forever and ever—who created heaven and all that is in it, the earth and all that is in it, the sea and all that is in it—that there would be no more delay.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Rather, in the days when the seventh angel is about to sound his trumpet, the mystery of God will be brought to completion, just as he proclaimed to his servants the prophets.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Then the voice I had heard from heaven spoke to me again, saying, \"Go, take the scroll that lies open in the hand of the angel who stands on the sea and on the land.\"",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "So I went to the angel and asked him to give me the little scroll. He said to me, \"Take it and devour it. It will turn your stomach bitter, but in your mouth it will be sweet as honey.\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "I took the little scroll from the angel's hand and devoured it. In my mouth it was sweet as honey, but when I had eaten it, my stomach turned bitter.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then I was told, \"You must prophesy again concerning many peoples and nations and languages and kings.\"",
          "paragraphStart": true
        }
      ],
      "notes": "**\"The rainbow\" (v. 1)**: The Greek has the definite article (ἡ ἶρις), suggesting this is *the* rainbow—likely connecting to the rainbow encircling God's throne in Revelation 4:3, itself an allusion to the covenant rainbow of Genesis 9.\n\n**\"Little scroll\" (vv. 2, 9, 10)**: The Greek alternates between βιβλαρίδιον (diminutive, \"little scroll\") and βιβλίον (regular, \"scroll\"). I preserve this distinction, using \"little scroll\" for the diminutive and \"scroll\" when the text uses the regular form (v. 8).\n\n**\"No more delay\" (v. 6)**: Greek χρόνος can mean either \"time\" or \"delay.\" The traditional \"time shall be no more\" suggests the end of temporal existence, but in context—an oath that God's purposes will now proceed without postponement—\"delay\" captures the meaning better. The announcement concerns the imminent completion of God's mystery, not a metaphysical statement about time itself.\n\n**\"Will be brought to completion\" (v. 7)**: The Greek aorist ἐτελέσθη speaks of a future event as if already accomplished (prophetic aorist), expressing certainty. English requires a future tense to avoid confusion.\n\n**\"Devour it... sweet as honey\" (vv. 9-10)**: This echoes Ezekiel 2:8–3:3, where the prophet is commanded to eat a scroll. First-century readers steeped in the prophetic tradition would immediately recognize this allusion—the calling of a prophet to internalize God's word before proclaiming it.\n\n**\"I was told\" (v. 11)**: The Greek has a third-person plural verb (λέγουσίν μοι, \"they say to me\") without specifying who speaks. Rather than awkwardly rendering \"they said,\" I use the English passive \"I was told,\" which preserves the ambiguity about the speaker(s) while reading naturally."
    },
    {
      "chapter": 11,
      "verses": [
        {
          "verse": 1,
          "text": "And a measuring reed like a staff was given to me, and a voice said: \"Rise and measure the sanctuary of God and the altar and those who worship there.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "But the outer courtyard of the sanctuary—cast it outside and do not measure it, because it has been given to the nations, and they will trample the holy city for forty-two months.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "\"And I will give authority to my two witnesses, and they will prophesy for one thousand two hundred sixty days, clothed in sackcloth.\"",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "These are the two olive trees and the two lampstands that stand before the Lord of the earth.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And if anyone wants to harm them, fire comes forth from their mouths and devours their enemies. And if anyone should want to harm them, in this way he must be killed.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "These have the authority to shut the sky so that no rain falls during the days of their prophesying, and they have authority over the waters to turn them into blood, and to strike the earth with every kind of plague as often as they wish.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And when they have completed their testimony, the beast that rises from the abyss will make war against them and conquer them and kill them.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "And their corpse will lie on the main street of the great city—which is called, in prophetic terms, Sodom and Egypt—where also their Lord was crucified.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And people from the nations and tribes and languages and peoples gaze at their corpse for three and a half days, and they do not allow their bodies to be placed in a tomb.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And those who dwell on the earth rejoice over them and celebrate, and they will send gifts to one another, because these two prophets tormented those who dwell on the earth.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And after the three and a half days, the breath of life from God entered into them, and they stood on their feet, and great fear fell upon those who were watching them.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "And they heard a loud voice from heaven saying to them, \"Come up here!\" And they went up into heaven in the cloud, and their enemies watched them.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And in that hour there was a great earthquake, and a tenth of the city collapsed, and seven thousand people were killed in the earthquake. And the rest became terrified and gave glory to the God of heaven.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "The second woe has passed. Look—the third woe is coming quickly.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "And the seventh angel blew his trumpet, and there were loud voices in heaven saying: \"The kingdom of the world has become the kingdom of our Lord and of his Christ, and he will reign forever and ever.\"",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "And the twenty-four elders who sit on their thrones before God fell on their faces and worshiped God,",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "saying: \"We give you thanks, Lord God, the All-Ruler, the One who is and who was, because you have taken up your great power and have begun to reign.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "The nations raged, but your wrath has come—and the time for the dead to be judged, and to give the reward to your servants the prophets and to the holy ones and to those who fear your name, both small and great, and to destroy those who are destroying the earth.\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And the sanctuary of God in heaven was opened, and the ark of his covenant appeared in his sanctuary. And there came flashes of lightning and sounds and peals of thunder and an earthquake and great hail.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Sanctuary\" (v. 1, 2, 19)**: Greek ναός refers specifically to the inner temple, the dwelling place of God—not the entire temple complex (ἱερόν). This distinction matters for the measuring symbolism.\n\n**\"Cast it outside\" (v. 2)**: The verb ἔκβαλε is stronger than simply \"leave out\"—it means to throw out or expel. The outer court is actively excluded from the measuring/protection.\n\n**\"I will give authority to\" (v. 3)**: The Greek δώσω (\"I will give\") lacks an explicit object. Context suggests \"authority\" or \"power,\" which I have supplied. Some translations supply \"I will grant\" or leave it ambiguous.\n\n**\"In prophetic terms\" (v. 8)**: Greek πνευματικῶς literally means \"spiritually\" but here indicates symbolic or prophetic speech—the city is not literally Sodom or Egypt, but shares their spiritual character. \"Prophetically\" or \"symbolically\" better captures this for modern readers than the potentially misleading \"spiritually.\"\n\n**\"Corpse/bodies\" (v. 8-9)**: The Greek shifts between singular πτῶμα (v. 8) and plural πτώματα (v. 9). This is characteristic of Revelation's style and I have preserved it.\n\n**\"Those who dwell on the earth\" (v. 10)**: This phrase (οἱ κατοικοῦντες ἐπὶ τῆς γῆς) is a technical formula throughout Revelation designating humanity in opposition to God—not merely geographical inhabitants but those whose allegiance is to the earthly realm.\n\n**\"Breath of life\" (v. 11)**: πνεῦμα ζωῆς echoes both Genesis 2:7 and Ezekiel 37 (the valley of dry bones). \"Breath\" captures the life-giving sense better than \"spirit\" here.\n\n**\"The One who is and who was\" (v. 17)**: Notably absent is the usual \"and who is to come\" (found in 1:4, 8; 4:8). The omission is theologically significant—God has now come in judgment; the future element is fulfilled.\n\n**\"Have begun to reign\" (v. 17)**: The aorist ἐβασίλευσας is best read as ingressive—marking the commencement of God's active reign over the world's kingdom, not merely a general statement of sovereignty.\n\n**\"Destroy those who are destroying\" (v. 18)**: The Greek wordplay διαφθεῖραι τοὺς διαφθείροντας creates a pointed irony: the destroyers will be destroyed. I preserved this repetition."
    },
    {
      "chapter": 12,
      "verses": [
        {
          "verse": 1,
          "text": "And a great sign appeared in heaven: a woman clothed with the sun, with the moon beneath her feet, and on her head a victor's crown of twelve stars.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "She was pregnant, and she cries out in labor, in agony to give birth.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Then another sign appeared in heaven: and look—a great fiery-red dragon, having seven heads and ten horns, and on his heads seven royal diadems.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "His tail sweeps away a third of the stars of heaven and hurled them to the earth. The dragon had taken his stand before the woman who was about to give birth, so that when she bore her child he might devour it.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And she gave birth to a son, a male, who is destined to shepherd all the nations with an iron rod. And her child was snatched away to God and to his throne.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And the woman fled into the wilderness, where she has a place prepared by God, so that she might be sustained there for one thousand two hundred sixty days.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And war broke out in heaven—Michael and his angels waging war against the dragon. And the dragon fought back, along with his angels,",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "but he did not prevail, nor was a place found for them any longer in heaven.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And the great dragon was thrown down—the ancient serpent, the one called the Slanderer and the Adversary, who leads the whole inhabited world astray—he was thrown down to the earth, and his angels were thrown down with him.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And I heard a loud voice in heaven saying: \"Now has come the salvation and the power and the kingdom of our God, and the authority of his Anointed One! For the accuser of our brothers and sisters has been thrown down—the one who accuses them before our God day and night.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "And they conquered him through the blood of the Lamb and through the word of their witness, and they did not cling to their lives even to the point of death.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Therefore rejoice, O heavens, and you who make your dwelling in them! But woe to the earth and the sea, for the devil has come down to you with great fury, knowing that his time is short.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And when the dragon saw that he had been thrown down to the earth, he pursued the woman who had given birth to the male child.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "But the woman was given the two wings of the great eagle, so that she might fly to the wilderness, to her place, where she is sustained for a time and times and half a time, away from the presence of the serpent.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And the serpent spewed water like a river from his mouth after the woman, to sweep her away in the flood.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But the earth came to the woman's aid: the earth opened its mouth and swallowed the river that the dragon had spewed from his mouth.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Then the dragon was enraged at the woman and went off to wage war against the rest of her offspring—those who keep the commandments of God and hold to the witness of Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And he stood on the sand of the sea.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Victor's crown\" vs. \"royal diadems\" (vv. 1, 3)**: Greek distinguishes between στέφανος (the wreath given to victors in athletic or military contests) and διάδημα (the royal crown of a king). The woman wears a στέφανος; the dragon wears διαδήματα. This contrast—the woman crowned as a victor, the dragon claiming royal authority—is lost when both are rendered simply as \"crown.\"\n\n**\"Fiery-red\" (v. 3)**: πυρρός specifically means flame-colored or fire-red, not simply \"red.\" The word evokes fire, which suits the dragon's nature.\n\n**\"Had taken his stand\" (v. 4)**: ἕστηκεν is perfect tense, indicating the dragon had positioned himself and remained standing—a posture of waiting and readiness.\n\n**\"Snatched away\" (v. 5)**: ἁρπάζω implies sudden, forceful seizure—a rescue from danger, not a gentle taking.\n\n**\"The Slanderer and the Adversary\" (v. 9)**: Διάβολος literally means \"one who throws across,\" hence slanderer or false accuser. Σατανᾶς is the Hebrew word for adversary or accuser. Rendering both with their meanings rather than transliterating them (\"Devil and Satan\") makes the dragon's essential activity clear: accusation.\n\n**\"Leads astray\" (v. 9)**: πλανάω means to cause to wander, to deceive, to lead off the true path—not simply \"deceive\" in the sense of lying.\n\n**\"Make your dwelling\" (v. 12)**: σκηνόω means to pitch a tent, to tabernacle—language rich with exodus and wilderness associations, fitting for Revelation's imagery.\n\n**\"A time and times and half a time\" (v. 14)**: This phrase (καιρὸν καὶ καιροὺς καὶ ἥμισυ καιροῦ) is drawn directly from Daniel 7:25 and 12:7, which the original audience would recognize. It equals the 1,260 days of verse 6.\n\n**\"He stood\" (v. 18)**: The SBLGNT reads ἐστάθη (\"he stood\"), keeping the dragon as subject. Some manuscripts read \"I stood\" (ἐστάθην), making this John's position as he receives the next vision. Either reading creates a transition to chapter 13's beast from the sea."
    },
    {
      "chapter": 13,
      "verses": [
        {
          "verse": 1,
          "text": "And I saw a beast rising from the sea, having ten horns and seven heads, with ten royal crowns on its horns, and on its heads blasphemous names.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "The beast I saw was like a leopard, its feet like a bear's, and its mouth like the mouth of a lion. And the dragon gave it his power and his throne and great authority.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "One of its heads appeared to have been slaughtered to death, but its death-wound was healed. The whole earth was astonished and followed after the beast,",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "and they worshiped the dragon because he gave authority to the beast, and they worshiped the beast, saying, \"Who is like the beast? Who can wage war against it?\"",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And it was given a mouth speaking great things and blasphemies, and it was given authority to act for forty-two months.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "It opened its mouth in blasphemies against God, to blaspheme his name and his dwelling—those who dwell in heaven.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And it was given permission to wage war against the holy ones and to conquer them, and it was given authority over every tribe and people and tongue and nation.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And all who dwell on the earth will worship it—everyone whose name has not been written from the foundation of the world in the scroll of life belonging to the Lamb who was slaughtered.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "If anyone has an ear, let them hear.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "If anyone is destined for captivity, to captivity they go. If anyone is to be killed by the sword, by the sword they must be killed. Here is the endurance and the faithfulness of the holy ones.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then I saw another beast rising from the earth. It had two horns like a lamb, but it spoke like a dragon.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "It exercises all the authority of the first beast in its presence, and it makes the earth and those who dwell in it worship the first beast, whose death-wound was healed.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "It performs great signs, even making fire come down from heaven to earth in the sight of people.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "It deceives those who dwell on the earth through the signs it was given power to perform in the presence of the beast, telling those who dwell on the earth to make an image for the beast who has the sword-wound and came to life.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And it was given power to give breath to the image of the beast, so that the image of the beast might even speak and cause all who would not worship the image of the beast to be killed.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "It also makes everyone—the small and the great, the rich and the poor, the free and the slaves—receive a brand-mark on their right hand or on their forehead,",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "so that no one can buy or sell unless they have the mark: the name of the beast or the number of its name.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Here is wisdom: let the one who has understanding calculate the number of the beast, for it is a human number, and its number is six hundred sixty-six.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Royal crowns\" (v. 1)**: Greek διαδήματα refers specifically to royal diadems—the crown of a sovereign—as distinct from στέφανος (the victor's wreath). This emphasizes the beast's claim to royal authority.\n\n**\"Slaughtered\" (vv. 3, 8)**: The Greek ἐσφαγμένην/ἐσφαγμένου is the same word used for the Lamb throughout Revelation (5:6, 12). The beast's \"slaughtered\" head that revives is a deliberate parody of Christ's death and resurrection. \"Killed\" would obscure this significant verbal link.\n\n**\"Was given\" (vv. 5, 7, 14, 15)**: The repeated divine passive (ἐδόθη) is theologically significant—the beast's authority is permitted by God, not autonomous. I preserve this passive construction throughout.\n\n**\"Who is like the beast?\" (v. 4)**: This exclamation parodies \"Who is like God?\" (found in passages like Exodus 15:11, Psalm 35:10). The Hebrew name Michael (מִיכָאֵל) itself means \"Who is like God?\" First-century readers steeped in Scripture would recognize this blasphemous inversion.\n\n**\"From the foundation of the world\" (v. 8)**: This phrase could grammatically modify either \"written\" or \"slaughtered.\" I've placed it with \"written\" based on the parallel in Rev 17:8, though the ambiguity may be intentional.\n\n**Verse 10**: This notoriously difficult verse echoes Jeremiah 15:2 and 43:11 (LXX). The point is acceptance of divine decree—the holy ones must endure their appointed suffering rather than resist by violence.\n\n**\"Brand-mark\" (vv. 16-17)**: Greek χάραγμα refers to an impressed or engraved mark—a brand on livestock, a stamp on official documents, or the imperial seal. \"Brand-mark\" captures the sense of ownership and commercial function better than simply \"mark.\"\n\n**\"A human number\" (v. 18)**: Greek ἀριθμὸς ἀνθρώπου could mean \"the number of a person\" (identifying a specific individual) or \"a human number\" (calculated by ordinary human means). The gematria value 666 almost certainly points to \"Nero Caesar\" when transliterated into Hebrew letters (נרון קסר = 50+200+6+50+100+60+200)."
    },
    {
      "chapter": 14,
      "verses": [
        {
          "verse": 1,
          "text": "And I saw, and look—the Lamb standing on Mount Zion, and with him one hundred forty-four thousand who had his name and the name of his Father written on their foreheads.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And I heard a sound from heaven like the sound of many waters and like the sound of great thunder, and the sound I heard was like harpists playing on their harps.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "And they sing what seems a new song before the throne and before the four living creatures and the elders. And no one was able to learn the song except the one hundred forty-four thousand—those who had been purchased from the earth.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "These are the ones who were not defiled with women, for they are virgins. These are the ones who follow the Lamb wherever he goes. These were purchased from among humanity as firstfruits for God and for the Lamb,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "and in their mouth no lie was found—they are unblemished.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And I saw another angel flying at the zenith of the sky, having an eternal proclamation of good news to announce to those dwelling on the earth—to every nation and tribe and tongue and people—",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "saying with a loud voice: \"Fear God and give him glory, because the hour of his judgment has come! Worship the one who made the heaven and the earth and the sea and the springs of waters!\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And another angel, a second, followed, saying: \"Fallen, fallen is Babylon the great—she who has made all the nations drink from the wine of her passionate immorality!\"",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "And another angel, a third, followed them, saying with a loud voice: \"If anyone worships the beast and its image and receives a mark on his forehead or on his hand,",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "he also will drink from the wine of God's fury, poured full-strength into the cup of his wrath, and he will be tormented with fire and sulfur before the holy angels and before the Lamb.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And the smoke of their torment rises into the ages of ages, and they have no rest day or night—those who worship the beast and its image, and whoever receives the mark of its name.\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Here is the endurance of the holy ones: those who keep the commandments of God and the faithfulness of Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "And I heard a voice from heaven saying, \"Write: Blessed are the dead who die in the Lord from now on.\" \"Yes,\" says the Spirit, \"so that they may rest from their labors, for their works follow with them.\"",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "And I saw, and look—a white cloud, and seated on the cloud one like a son of man, having on his head a golden victor's wreath and in his hand a sharp sickle.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "And another angel came out of the temple, crying with a loud voice to the one seated on the cloud: \"Send forth your sickle and reap, because the hour to reap has come—the harvest of the earth has dried!\"",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And the one seated on the cloud swung his sickle over the earth, and the earth was reaped.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "And another angel came out of the temple in heaven, himself also having a sharp sickle.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "And another angel came from the altar—the one having authority over fire—and he called with a loud voice to the one holding the sharp sickle, saying: \"Send forth your sharp sickle and cut the grape clusters from the vine of the earth, because its grapes have reached full ripeness.\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And the angel swung his sickle into the earth and cut the grapes of the vine of the earth and threw them into the great winepress of God's fury.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "And the winepress was trampled outside the city, and blood came out of the winepress up to the bridles of horses, for one thousand six hundred stadia.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Purchased\" (vv. 3, 4)**: The Greek ἀγοράζω is marketplace language—to buy, to acquire through purchase. This preserves the commercial imagery that connects to the Lamb's redemptive work and contrasts with the economic coercion of the beast's system (Rev 13:17).\n\n**\"Virgins\" (v. 4)**: Greek παρθένοι, typically used for female virgins, is applied here to the 144,000. This likely carries both literal and metaphorical dimensions—spiritual purity and fidelity to God, as opposed to the \"prostitution\" (πορνεία) associated with Babylon in verse 8.\n\n**\"Unblemished\" (v. 5)**: Greek ἄμωμοι is sacrificial terminology—animals fit for offering had to be \"without blemish.\" Combined with \"firstfruits\" (v. 4), this presents the 144,000 as a consecrated offering.\n\n**\"Zenith of the sky\" (v. 6)**: Greek μεσουράνημα refers to the midpoint of heaven—directly overhead, the position of maximum visibility. \"Mid-heaven\" is more literal but less communicative.\n\n**\"Passionate immorality\" (v. 8)**: The phrase τοῦ θυμοῦ τῆς πορνείας combines θυμός (fury, passion) with πορνεία (sexual immorality). The double meaning is likely intentional—the intoxicating passion of her immorality that also provokes divine fury.\n\n**\"Poured full-strength\" (v. 10)**: The Greek κεκερασμένου ἀκράτου is deliberately paradoxical—\"mixed unmixed.\" Wine was normally diluted with water; ἄκρατος means undiluted. God's wrath-wine is prepared at full potency.\n\n**\"The faithfulness of Jesus\" (v. 12)**: Greek πίστιν Ἰησοῦ could be \"faith in Jesus\" (objective genitive) or \"faithfulness of Jesus\" (subjective genitive). Given the context of endurance and the parallel with \"commandments of God,\" the subjective reading—maintaining the same faithfulness Jesus showed—seems more fitting.\n\n**\"Victor's wreath\" (v. 14)**: Greek στέφανος is distinguished from διάδημα (royal diadem). The στέφανος is the victor's crown awarded for athletic or military triumph, which fits the harvest-as-conquest imagery.\n\n**\"Has dried\" (v. 15)**: Greek ἐξηράνθη (from ξηραίνω, \"to dry\") indicates grain that has dried and is ready for harvest—the agricultural reality behind our abstracted \"ripe.\"\n\n**\"One thousand six hundred stadia\" (v. 20)**: Approximately 184 miles. Rather than converting to modern measurements, retaining the original unit preserves whatever symbolic significance the number may carry (possibly 4 × 4 × 100, a number of completeness)."
    },
    {
      "chapter": 15,
      "verses": [
        {
          "verse": 1,
          "text": "And I saw another sign in heaven, great and wondrous: seven angels holding seven plagues—the final ones—because in them the fury of God is brought to completion.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And I saw what appeared to be a sea of glass mingled with fire, and those who had conquered the beast and its image and the number of its name, standing on the sea of glass, holding harps of God.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "And they sing the song of Moses, the servant of God, and the song of the Lamb, saying: \"Great and wondrous are your works, Lord God, the All-Sovereign; righteous and true are your ways, King of the ages.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Who will not fear you, Lord, and glorify your name? For you alone are holy. For all the nations will come and worship before you, for your righteous judgments have been revealed.\"",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "After these things I looked, and the sanctuary of the tent of testimony in heaven was opened,",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "and the seven angels holding the seven plagues came out from the sanctuary, clothed in pure, radiant linen and girded around their chests with golden sashes.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And one of the four living creatures gave to the seven angels seven golden bowls filled with the fury of God who lives forever and ever.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And the sanctuary was filled with smoke from the glory of God and from his power, and no one could enter the sanctuary until the seven plagues of the seven angels were completed.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Fury\" (vv. 1, 7)**: Greek θυμός denotes intense, passionate anger—more visceral than ὀργή (settled wrath). \"Fury\" captures this intensity better than the traditional \"wrath.\"\n\n**\"All-Sovereign\" (v. 3)**: παντοκράτωρ means \"ruler over all\" rather than simply \"almighty.\" The traditional \"Almighty\" focuses only on raw power; the Greek emphasizes universal sovereignty and dominion.\n\n**\"King of the ages\" (v. 3)**: Following the critical text's αἰώνων (ages) rather than the variant ἐθνῶν (nations). This echoes the eternal kingship theme.\n\n**\"Sanctuary\" (vv. 5, 6, 8)**: Greek ναός refers specifically to the inner sanctuary, not the entire temple complex (ἱερόν). This precision matters for the imagery of God's presence.\n\n**\"Tent of testimony\" (v. 5)**: This phrase (σκηνὴ τοῦ μαρτυρίου) directly echoes the Septuagint's rendering of the Hebrew tabernacle terminology. First-century readers steeped in Scripture would recognize the connection to the wilderness tabernacle where God's glory dwelt.\n\n**\"Living creatures\" (v. 7)**: Greek ζῷα (living beings) must be distinguished from θηρίον (beast/monster). These are the cherubim-like beings from chapter 4, not malevolent creatures.\n\n**\"Bowls\" (v. 7)**: φιάλη denotes a broad, shallow bowl used for libations and offerings—not a narrow \"vial\" as in older translations.\n\n**\"Righteous judgments\" (v. 4)**: δικαιώματα can mean righteous acts, ordinances, or judicial decisions. In this context of impending plagues, \"righteous judgments\" captures both the moral quality and the judicial nature of God's actions about to be revealed."
    },
    {
      "chapter": 16,
      "verses": [
        {
          "verse": 1,
          "text": "And I heard a loud voice from the temple saying to the seven angels: \"Go and pour out the seven bowls of God's fury upon the earth.\"",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And the first went and poured out his bowl upon the earth, and there came a foul and malignant sore upon the people who had the mark of the beast and who worshiped its image.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "And the second poured out his bowl into the sea, and it became blood like that of a corpse, and every living creature died—everything in the sea.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "And the third poured out his bowl into the rivers and the springs of water, and they became blood.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "And I heard the angel of the waters saying: \"Righteous are you, the One who is and who was, the Holy One, because you have rendered this judgment—",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "because they poured out the blood of saints and prophets, and blood you have given them to drink. They deserve it.\"",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And I heard the altar saying: \"Yes, Lord God, the Almighty—true and just are your judgments.\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And the fourth poured out his bowl upon the sun, and it was permitted to scorch people with fire.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "And the people were scorched with a fierce burning, and they blasphemed the name of God who has authority over these plagues, and they did not repent so as to give him glory.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And the fifth poured out his bowl upon the throne of the beast, and its kingdom was plunged into darkness, and they were gnawing their tongues from the anguish,",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "and they blasphemed the God of heaven because of their anguish and their sores, and they did not repent of their deeds.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And the sixth poured out his bowl upon the great river, the Euphrates, and its water was dried up so that the way might be prepared for the kings from the rising of the sun.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "And I saw coming from the mouth of the dragon and from the mouth of the beast and from the mouth of the false prophet three unclean spirits like frogs—",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "for they are spirits of demons performing signs, which go out to the kings of the whole inhabited world to gather them for the war of the great day of God the Almighty.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "\"Look! I am coming like a thief. Blessed is the one who stays awake and guards his garments, so that he does not go about naked and they see his shame.\"",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "And they gathered them to the place called in Hebrew \"Armageddon.\"",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "And the seventh poured out his bowl upon the air—and a loud voice came from the temple, from the throne, saying: \"It is done!\"",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "And there were flashes of lightning and rumblings and thunder, and there was a great earthquake—such as had not occurred since humanity came to be upon the earth—so immense an earthquake, so great.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And the great city was split into three parts, and the cities of the nations collapsed. And Babylon the great was remembered before God, to give her the cup of the wine of his furious wrath.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "And every island fled, and mountains were not to be found.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "And great hailstones, each about a talent's weight, come down from heaven upon the people; and the people blasphemed God because of the plague of the hail, for its plague was utterly devastating.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Fury\" vs. \"wrath\" (θυμός/ὀργή)**: Greek has two words for divine anger. θυμός (v. 1, 19) suggests fierce, blazing fury; ὀργή (v. 19) suggests settled, judicial wrath. In v. 19, both appear together (τοῦ θυμοῦ τῆς ὀργῆς)—\"the fury of his wrath\"—which I rendered as \"furious wrath\" to capture the intensification without awkwardness.\n\n**\"Foul and malignant\" (v. 2)**: The Greek pairs κακόν (harmful, bad) and πονηρόν (evil, painful). These are not synonyms—the doubling emphasizes both the physical harmfulness and the malevolent character of the sore. This echoes the Egyptian plague of boils (Exodus 9:9-11).\n\n**\"Blood like that of a corpse\" (v. 3)**: The Greek ὡς νεκροῦ specifies \"like [blood] of a dead person\"—thick, coagulated, putrid blood rather than fresh blood.\n\n**\"The Holy One\" (v. 5)**: The Greek ὅσιος differs from the more common ἅγιος. It emphasizes moral purity, faithfulness to covenant, and devotion—God's holiness as expressed in righteous action.\n\n**\"Were gnawing their tongues\" (v. 10)**: The Greek ἐμασῶντο is an imperfect tense, depicting continuous, agonized chewing—a visceral image of suffering that I preserved.\n\n**\"Rising of the sun\" (v. 12)**: A literal rendering of ἀνατολῆς ἡλίου. While \"the east\" is the meaning, the original audience would have heard the more vivid expression.\n\n**\"Inhabited world\" (v. 14)**: The Greek οἰκουμένη refers specifically to the civilized, inhabited world—not the cosmos generally, but the realm of human society and governance.\n\n**Verse 15 parenthesis**: This saying of Christ interrupts the narrative flow. The abrupt insertion mirrors the thief imagery—unexpected, breaking in. I preserved this by maintaining the dash structure around it.\n\n**\"A talent's weight\" (v. 21)**: A talent was approximately 75-100 pounds (34-45 kg). Rather than converting to modern measurements, I retained the ancient unit; the original audience would have recognized this as extraordinarily heavy.\n\n**\"Come down\" (v. 21)**: The Greek καταβαίνει is present tense amid past-tense narrative—a vivid, dramatic present that brings the reader into the moment. I preserved this."
    },
    {
      "chapter": 17,
      "verses": [
        {
          "verse": 1,
          "text": "And one of the seven angels who had the seven bowls came and spoke with me, saying, \"Come, I will show you the judgment of the great prostitute who sits on many waters,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "with whom the kings of the earth committed fornication, and the inhabitants of the earth became drunk from the wine of her fornication.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And he carried me away in the Spirit into a wilderness. And I saw a woman sitting on a scarlet beast, covered with blasphemous names, having seven heads and ten horns.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "The woman was clothed in purple and scarlet and adorned with gold and precious stone and pearls, holding in her hand a golden cup full of abominations and the impurities of her fornication.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And on her forehead was written a name—a mystery: \"Babylon the Great, the Mother of Prostitutes and of the Abominations of the Earth.\"",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And I saw the woman drunk from the blood of the holy ones and from the blood of the witnesses of Jesus. And when I saw her, I was astonished with great astonishment.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "And the angel said to me, \"Why are you astonished? I will tell you the mystery of the woman and of the beast that carries her, the one having the seven heads and the ten horns.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "\"The beast that you saw was, and is not, and is about to ascend from the abyss, and it goes to destruction. And the inhabitants of the earth—those whose names have not been written in the book of life from the foundation of the world—will be astonished when they see the beast, because it was and is not and yet will be present.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Here is the mind that has wisdom: The seven heads are seven mountains on which the woman sits. And there are seven kings:",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "five have fallen, one now is, the other has not yet come—and when he comes, he must remain only a short time.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And the beast that was and is not—it is itself an eighth, yet it is from the seven, and it goes to destruction.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "\"And the ten horns that you saw are ten kings who have not yet received a kingdom, but they receive authority as kings for one hour together with the beast.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "These are of one mind, and they give their power and authority to the beast.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "These will make war against the Lamb, and the Lamb will conquer them—because he is Lord of lords and King of kings—and those with him are called and chosen and faithful.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And he says to me, \"The waters that you saw, where the prostitute sits, are peoples and multitudes and nations and languages.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "And the ten horns that you saw, along with the beast—these will hate the prostitute and will make her desolate and naked, and they will devour her flesh and burn her with fire.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For God put it into their hearts to carry out his purpose by acting with one purpose and giving their kingdom to the beast, until the words of God are fulfilled.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And the woman that you saw is the great city that holds dominion over the kings of the earth.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Committed fornication\" (v. 2)**: I retained the sexual language (ἐπόρνευσαν) rather than softening it to \"immorality\" because the prophetic metaphor of prostitution/adultery for political and religious unfaithfulness is deliberate, echoing Ezekiel 16 and 23, Isaiah 23, and Jeremiah 51. The original audience would recognize this prophetic register.\n\n**\"A mystery\" (v. 5)**: The word μυστήριον could be read as part of the name itself or as a label indicating the name is symbolic. I punctuated it as the latter—a signal to the reader that \"Babylon\" is coded language (almost certainly for Rome), not a reference to the literal city. First-century readers familiar with apocalyptic literature would understand this convention.\n\n**\"Was and is not and yet will be present\" (v. 8)**: This phrase parodies the divine formula \"who is and who was and who is to come\" (Rev 1:4, 4:8). The beast's existence is a demonic mockery of God's eternal being. The Greek παρέσται (\"will be present\") creates an imperfect parallel—where God \"is coming,\" the beast merely \"will be present.\"\n\n**\"Astonished with great astonishment\" (v. 6)**: The Greek ἐθαύμασα... θαῦμα μέγα is a Semitic cognate accusative construction for emphasis. I preserved the intensifying effect rather than smoothing it to \"greatly astonished.\"\n\n**\"Witnesses of Jesus\" (v. 6)**: The Greek μαρτύρων was developing its technical sense of \"martyrs\" (those who die for their testimony) by this period, but retains its original meaning of \"witnesses.\" Both senses are likely intended—these are witnesses whose testimony cost them their lives. \"Witnesses\" preserves this double meaning.\n\n**\"Seven mountains\" (v. 9)**: The Greek ὄρη means \"mountains,\" not \"hills,\" though Rome was famously the city of seven hills. The first-century audience would immediately catch this identification. The slightly grander word may be intentional—elevating the critique.\n\n**\"Lord of lords and King of kings\" (v. 14)**: This is the order in the Greek here (reversed in 19:16). The phrase uses a Hebrew superlative construction and echoes Daniel 2:47 and Deuteronomy 10:17. It directly challenges Roman imperial claims to supreme sovereignty."
    },
    {
      "chapter": 18,
      "verses": [
        {
          "verse": 1,
          "text": "After these things I saw another angel descending from heaven, having great authority, and the earth was illuminated by his glory.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And he cried out with a mighty voice, saying: \"Fallen, fallen is Babylon the great! She has become a dwelling place of demons, a haunt for every unclean spirit, a haunt for every unclean bird, a haunt for every unclean and detested beast,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "because all the nations have fallen from the wine of the fury of her sexual immorality, and the kings of the earth committed sexual immorality with her, and the merchants of the earth grew rich from the power of her wanton luxury.\"",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And I heard another voice from heaven saying: \"Come out of her, my people, so that you do not share in her sins, and so that you do not receive her plagues;",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "for her sins have been heaped up as high as heaven, and God has remembered her crimes.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Pay her back as she herself has paid out, and double her portion double according to her deeds; in the cup in which she mixed, mix her a double portion.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "To the degree that she glorified herself and lived in wanton luxury, give her that much torment and grief. For in her heart she says, 'I sit as queen; I am no widow, and I will never see grief.'",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Therefore in a single day her plagues will come—death and grief and famine—and she will be burned up with fire; for mighty is the Lord God who has judged her.\"",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And the kings of the earth who committed sexual immorality with her and lived in wanton luxury will weep and beat their breasts over her when they see the smoke of her burning,",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "standing far off because of the fear of her torment, saying, \"Alas, alas, the great city, Babylon the mighty city! For in a single hour your judgment has come.\"",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And the merchants of the earth weep and mourn over her, because no one buys their cargo anymore—",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "cargo of gold and silver, precious stone and pearls, fine linen and purple cloth, silk and scarlet cloth, every kind of citron wood and every article of ivory, every article made of most costly wood, bronze, iron, and marble,",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "cinnamon and spice, incense and perfume and frankincense, wine and olive oil, fine flour and wheat, cattle and sheep, horses and carriages, and slaves—that is, human souls.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "\"The ripe fruit your soul craved has gone from you, and all your luxuries and splendors have perished from you, and they will never be found again.\"",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "The merchants of these things, who grew rich from her, will stand far off because of the fear of her torment, weeping and mourning,",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "saying, \"Alas, alas, the great city, clothed in fine linen and purple and scarlet, adorned with gold and precious stone and pearl!",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For in a single hour such great wealth has been laid waste!\" And every ship's captain and everyone who sails from place to place, the sailors and all who make their living from the sea, stood far off",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "and cried out as they saw the smoke of her burning, saying, \"What city was like the great city?\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And they threw dust on their heads and cried out, weeping and mourning, saying, \"Alas, alas, the great city, in which all who had ships at sea grew rich from her wealth! For in a single hour she has been laid waste.\"",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "\"Rejoice over her, O heaven, and you saints and apostles and prophets, for God has rendered judgment against her for you!\"",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "And a mighty angel picked up a stone like a great millstone and hurled it into the sea, saying, \"Thus with violence will Babylon the great city be thrown down, and will never be found again.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "And the sound of harpists and musicians and flute players and trumpeters will never be heard in you again, and no craftsman of any craft will ever be found in you again, and the sound of the mill will never be heard in you again,",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "and the light of a lamp will never shine in you again, and the voice of bridegroom and bride will never be heard in you again; for your merchants were the great ones of the earth, for by your sorcery all the nations were led astray,",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "and in her was found the blood of prophets and saints and all who have been slaughtered on the earth.\"",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Wanton luxury\" (vv. 3, 7, 9)**: The Greek στρῆνος and its verbal form ἐστρηνίασεν denote not merely wealth but arrogant, sensual excess—luxury that flaunts itself. \"Wanton luxury\" captures both the material abundance and its morally reckless character.\n\n**\"Haunt\" (v. 2)**: The Greek φυλακή literally means \"prison\" or \"guard post,\" but when used of animals and spirits inhabiting ruins, it conveys the sense of a place where such creatures lurk or are confined. The repetition of φυλακὴ παντὸς (\"haunt for every\") three times creates a deliberate litany effect, which I preserved.\n\n**\"Heaped up\" (v. 5)**: The verb ἐκολλήθησαν means \"were joined together\" or \"adhered\"—her sins have stuck to one another, piling up to heaven. This echoes Jeremiah 51:9 (LXX).\n\n**\"Slaves—that is, human souls\" (v. 13)**: The Greek σωμάτων καὶ ψυχὰς ἀνθρώπων literally reads \"bodies and souls of humans.\" The word σῶμα was commercial terminology for slaves (human \"bodies\" as cargo). The addition of \"souls of humans\" is a deliberate intensification—John emphasizes that these are not mere commodities but human beings. My rendering makes this rhetorical move explicit.\n\n**\"Double her portion double\" (v. 6)**: The phrase διπλώσατε τὰ διπλᾶ is intensifying: \"double the double things.\" Rather than smooth this into \"repay double,\" I retained the emphatic repetition.\n\n**\"Beat their breasts\" (v. 9)**: The verb κόπτομαι refers to the physical act of striking oneself in mourning, not merely generic lamenting.\n\n**\"Alas, alas\" (vv. 10, 16, 19)**: The Greek Οὐαὶ οὐαί is an exclamation of grief and horror. \"Woe, woe\" has become too familiar; \"Alas\" captures the lamentation without the prophetic-judgment connotation that \"woe\" sometimes carries in English.\n\n**\"Rendered judgment against her for you\" (v. 20)**: The Greek ἔκρινεν ὁ θεὸς τὸ κρίμα ὑμῶν ἐξ αὐτῆς is difficult—literally \"God has judged your judgment from her.\" This means God has rendered the verdict that was owed to you, judging her for what she did to you. My rendering attempts to clarify this.\n\n**\"Sorcery\" (v. 23)**: The Greek φαρμακεία refers to the use of drugs and potions for magical purposes. While \"sorcery\" is traditional, it accurately captures the first-century meaning of manipulative, deceptive spiritual practices."
    },
    {
      "chapter": 19,
      "verses": [
        {
          "verse": 1,
          "text": "After these things I heard something like the loud voice of a great multitude in heaven, saying: \"Hallelujah! Salvation and glory and power belong to our God,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "because his judgments are true and just. He has judged the great prostitute who was corrupting the earth with her sexual immorality, and he has avenged the blood of his servants from her hand.\"",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And a second time they said: \"Hallelujah! Her smoke rises to the ages of ages.\"",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "And the twenty-four elders and the four living creatures fell down and worshiped God who sits on the throne, saying: \"Amen! Hallelujah!\"",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "And a voice came from the throne, saying: \"Praise our God, all his servants, those who fear him, the small and the great.\"",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "And I heard something like the sound of a great multitude, and like the sound of many waters, and like the sound of mighty thunders, saying: \"Hallelujah! For the Lord our God, the Almighty, has begun to reign.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Let us rejoice and exult and give him the glory, because the wedding of the Lamb has come, and his bride has made herself ready.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "It was granted to her to clothe herself in fine linen, bright and pure\"—for the fine linen is the righteous deeds of the holy ones.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And he says to me: \"Write: Blessed are those who have been invited to the wedding feast of the Lamb.\" And he says to me: \"These are the true words of God.\"",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "And I fell before his feet to worship him, but he says to me: \"See that you do not! I am a fellow servant with you and with your brothers who hold to the testimony of Jesus. Worship God! For the testimony of Jesus is the spirit of prophecy.\"",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "Then I saw heaven standing open, and look—a white horse! And the one sitting on it is called Faithful and True, and in righteousness he judges and wages war.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "His eyes are a flame of fire, and on his head are many diadems. He has a name written that no one knows except himself,",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "and he is clothed in a robe dipped in blood, and his name is called the Word of God.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And the armies in heaven were following him on white horses, clothed in fine linen, white and pure.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "From his mouth comes a sharp sword, so that with it he may strike down the nations, and he will shepherd them with an iron rod. He treads the winepress of the wine of the fury of the wrath of God the Almighty.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And on his robe and on his thigh he has a name written: King of kings and Lord of lords.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Then I saw an angel standing in the sun, and he cried out with a loud voice, saying to all the birds flying in mid-heaven: \"Come, gather for the great feast of God,",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "to eat the flesh of kings, the flesh of military commanders, the flesh of mighty men, the flesh of horses and their riders, the flesh of all people—both free and slave, both small and great.\"",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And I saw the beast and the kings of the earth and their armies gathered to make war against the one sitting on the horse and against his army.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "And the beast was captured, and with it the false prophet who had performed signs in its presence—signs by which he deceived those who had received the mark of the beast and those who worshiped its image. The two of them were thrown alive into the lake of fire that burns with sulfur.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "And the rest were killed by the sword of the one sitting on the horse—the sword that came from his mouth—and all the birds were gorged on their flesh.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Hallelujah\" (vv. 1, 3, 4, 6)**: This Hebrew expression (הַלְלוּ יָהּ, \"Praise Yah\") appears only in this chapter in the entire New Testament—four times. The retention of the untranslated Hebrew rather than rendering it \"Praise the Lord\" preserves its liturgical foreignness and connects to the Psalms (particularly the Hallel psalms), which first-century readers would have recognized.\n\n**\"To the ages of ages\" (v. 3)**: Greek εἰς τοὺς αἰῶνας τῶν αἰώνων is a Hebraism. \"Forever and ever\" is accurate but loses the specific construction. I chose a more literal rendering to preserve the idiom's texture.\n\n**\"Has begun to reign\" (v. 6)**: The aorist ἐβασίλευσεν is likely ingressive—marking the commencement of God's reign—rather than simply \"reigns\" or \"has reigned.\" This captures the eschatological moment: God's kingdom has now been inaugurated.\n\n**\"Diadems\" (v. 12)**: Greek διαδήματα refers to royal crowns symbolizing sovereignty, distinct from στέφανος (victor's wreath). The rider wears many royal crowns—a contrast to the dragon's seven diadems (12:3) and beast's ten (13:1).\n\n**\"Dipped in blood\" (v. 13)**: The robe is bloodied before the battle begins, echoing Isaiah 63:1-3 where the divine warrior's garments are stained from treading the winepress of judgment. This is not blood acquired in the coming battle but blood already present.\n\n**\"Military commanders\" (v. 18)**: Greek χιλιάρχων literally means \"commanders of a thousand\"—a specific Roman military rank (tribune). \"Military commanders\" conveys the martial context better than the archaic \"captains.\"\n\n**\"Shepherd them with an iron rod\" (v. 15)**: The verb ποιμανεῖ means \"shepherd\" or \"rule.\" I retained \"shepherd\" because it preserves the ironic pastoral imagery from Psalm 2:9—ruling nations as one would tend sheep, but with an iron instrument.\n\n**\"The testimony of Jesus is the spirit of prophecy\" (v. 10)**: The genitive Ἰησοῦ is ambiguous—it could mean testimony *about* Jesus, testimony *from* Jesus, or testimony that Jesus himself bore. The ambiguity may be intentional; the translation preserves it."
    },
    {
      "chapter": 20,
      "verses": [
        {
          "verse": 1,
          "text": "And I saw an angel descending from heaven, holding the key to the abyss and a great chain in his hand.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He seized the dragon—the ancient serpent, who is the Devil and Satan—and bound him for a thousand years.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "He threw him into the abyss, and locked and sealed it over him, so that he could no longer lead the nations astray until the thousand years are completed. After this, he must be released for a short time.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And I saw thrones, and those who sat on them were given authority to judge. I also saw the souls of those who had been beheaded because of their testimony about Jesus and because of the word of God—those who had not worshiped the beast or its image and had not received the mark on their forehead or on their hand. They came to life and reigned with the Christ for a thousand years.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "The rest of the dead did not come to life until the thousand years were completed. This is the first resurrection.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Blessed and holy is the one who has a share in the first resurrection. Over these the second death holds no power, but they will be priests of God and of the Christ, and will reign with him for a thousand years.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "When the thousand years are completed, Satan will be released from his prison",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "and will go out to lead astray the nations in the four corners of the earth—Gog and Magog—to gather them for battle. Their number is like the sand of the sea.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "They marched up across the broad expanse of the earth and surrounded the encampment of the holy ones and the beloved city. But fire came down from heaven and consumed them.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And the devil who led them astray was thrown into the lake of fire and sulfur, where the beast and the false prophet also are, and they will be tormented day and night to the ages of ages.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then I saw a great white throne and the one seated on it. From his presence earth and heaven fled away, and no place was found for them.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "And I saw the dead—the great and the small—standing before the throne, and scrolls were opened. Then another scroll was opened, which is the scroll of life. And the dead were judged by what was written in the scrolls, according to their deeds.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "The sea gave up the dead that were in it, and Death and Hades gave up the dead that were in them, and each one was judged according to their deeds.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Then Death and Hades were thrown into the lake of fire. This is the second death—the lake of fire.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And if anyone was not found written in the scroll of life, they were thrown into the lake of fire.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Abyss\" (v. 1, 3)**: Greek ἄβυσσος refers to the primordial deep, connected to the Hebrew תְּהוֹם (tehom) of Genesis 1:2. It represents chaos and is the prison of demonic forces. \"Bottomless pit\" (KJV) adds an interpretive element not in the Greek.\n\n**\"Lead astray\" (v. 3, 8, 10)**: Greek πλανάω means to cause to wander, deceive, or lead off the path. I use \"lead astray\" consistently to capture both the deceptive and directional aspects—Satan causes wandering from truth.\n\n**\"Beheaded\" (v. 4)**: Greek πεπελεκισμένων specifically means execution by axe (from πέλεκυς, \"axe\"), the Roman method of capital punishment for citizens. This is more specific than generic \"executed.\"\n\n**\"Came to life\" (v. 4, 5)**: Greek ἔζησαν (aorist of ζάω) here functions as an ingressive aorist—they entered into life, not merely \"lived.\" This is crucial for understanding the resurrection language.\n\n**\"Encampment\" (v. 9)**: Greek παρεμβολή is a military term for an army camp, evoking Israel's wilderness encampment. Most translations use \"camp,\" but \"encampment\" better conveys the organized, military sense.\n\n**\"Scrolls\" (v. 12)**: Greek βιβλίον referred to scrolls in the first century, not codex books. This maintains historical accuracy.\n\n**\"To the ages of ages\" (v. 10)**: Greek εἰς τοὺς αἰῶνας τῶν αἰώνων is a Hebraic superlative construction (like \"holy of holies\"). \"Forever and ever\" captures the meaning, but the Greek emphasizes endless duration through multiplication of ages.\n\n**\"Death and Hades\" (v. 13, 14)**: I retain \"Hades\" rather than \"hell\" because ᾅδης refers to the realm of the dead (equivalent to Hebrew Sheol), not the place of punishment. These are personified powers that must surrender their captives for judgment.\n\n**Gog and Magog (v. 8)**: This alludes to Ezekiel 38-39, where Gog is a leader from the land of Magog. Revelation transforms both into names for hostile nations, a development first-century readers familiar with the Septuagint would recognize."
    },
    {
      "chapter": 21,
      "verses": [
        {
          "verse": 1,
          "text": "And I saw a new heaven and a new earth, for the first heaven and the first earth had passed away, and the sea was no more.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And I saw the holy city, new Jerusalem, descending out of heaven from God, prepared like a bride adorned for her husband.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And I heard a loud voice from the throne saying: \"Look! The dwelling of God is with humanity, and he will dwell among them, and they will be his peoples, and God himself will be with them,",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "and he will wipe away every tear from their eyes, and death will be no more—neither mourning nor wailing nor pain will be anymore. The former things have passed away.\"",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And the one seated on the throne said, \"Look! I am making all things new.\" And he said, \"Write this down, for these words are trustworthy and true.\"",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "And he said to me, \"It is done. I am the Alpha and the Omega, the beginning and the end. To the one who thirsts I will give freely from the spring of the water of life.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "The one who conquers will inherit these things, and I will be his God and he will be my son.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But as for the cowardly and the faithless and the abominable and murderers and the sexually immoral and sorcerers and idolaters and all liars—their portion is in the lake that burns with fire and sulfur, which is the second death.\"",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And one of the seven angels who had the seven bowls full of the seven final plagues came and spoke with me, saying, \"Come, I will show you the bride, the wife of the Lamb.\"",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "And he carried me away in the Spirit to a great and high mountain, and he showed me the holy city Jerusalem descending out of heaven from God,",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "having the glory of God. Its radiance was like a most precious stone, like a jasper stone, crystal-clear.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "It had a great and high wall with twelve gates, and at the gates twelve angels, and names inscribed on them—the names of the twelve tribes of the sons of Israel:",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "three gates on the east, three gates on the north, three gates on the south, and three gates on the west.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "And the wall of the city had twelve foundations, and on them were the twelve names of the twelve apostles of the Lamb.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And the one speaking with me had a golden measuring rod to measure the city and its gates and its wall.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "The city lies foursquare, its length the same as its width. He measured the city with the rod: twelve thousand stadia—its length and width and height are equal.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "He also measured its wall: one hundred forty-four cubits by human measurement, which the angel was using.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "The wall was built of jasper, and the city was pure gold, like clear glass.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "The foundations of the city wall were adorned with every kind of precious stone: the first foundation jasper, the second sapphire, the third chalcedony, the fourth emerald,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "the fifth sardonyx, the sixth carnelian, the seventh chrysolite, the eighth beryl, the ninth topaz, the tenth chrysoprase, the eleventh jacinth, the twelfth amethyst.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "And the twelve gates were twelve pearls—each gate made from a single pearl. And the main street of the city was pure gold, transparent as glass.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "And I saw no temple in it, for the Lord God the Almighty is its temple, and the Lamb.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "And the city has no need of the sun or the moon to shine on it, for the glory of God illuminates it, and its lamp is the Lamb.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "The nations will walk by its light, and the kings of the earth will bring their glory into it.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Its gates will never be shut by day—and there will be no night there—",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "and they will bring the glory and the honor of the nations into it.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "And nothing profane will ever enter it, nor anyone who practices abomination or falsehood, but only those written in the Lamb's scroll of life.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Dwelling... dwell\" (v. 3)**: The Greek σκηνή (dwelling/tabernacle) and σκηνώσει (will dwell/tent) contain wordplay evoking the wilderness tabernacle and God's presence among Israel. The same verb appears in John 1:14 (\"the Word became flesh and dwelt among us\"). I preserved the shared root in English.\n\n**\"Peoples\" (v. 3)**: The SBLGNT has the plural λαοί rather than the singular λαός. This is theologically significant—the new covenant encompasses multiple peoples, not Israel alone.\n\n**\"Wailing\" (v. 4)**: Greek κραυγή denotes loud crying out or lamentation, stronger than quiet weeping. \"Crying\" in modern English has become too mild.\n\n**\"Cowardly\" (v. 8)**: Greek δειλοῖς heads this vice list, referring to those who failed to stand firm under persecution—a pointed warning to John's audience facing Roman pressure. This is not general timidity but apostasy through fear.\n\n**\"Sorcerers\" (v. 8)**: Greek φαρμάκοις (from φάρμακον, \"drug/potion\") refers to those practicing magic through potions and spells—a common feature of Greco-Roman religion that early Christians were pressured to participate in.\n\n**\"Radiance\" (v. 11)**: Greek φωστήρ means a light-bearing body or luminary (used of stars in Philippians 2:15). \"Brilliance\" or \"radiance\" better captures this than \"light.\"\n\n**\"Foursquare... equal\" (v. 16)**: The city is a perfect cube—its length, width, and height are identical. This mirrors the dimensions of the Holy of Holies in Solomon's temple (1 Kings 6:20), indicating that the entire city is now the sacred space where God dwells.\n\n**\"By human measurement, which the angel was using\" (v. 17)**: This clarifying phrase indicates that the angel employed standard human units of measurement rather than some celestial scale.\n\n**\"Profane\" (v. 27)**: Greek κοινόν means \"common\" in the ritual sense—that which is unclean or unholy, the opposite of consecrated. \"Unclean\" carries too many modern associations; \"profane\" better captures the cultic sense.\n\n**\"Scroll of life\" (v. 27)**: Greek βιβλίον refers to a scroll rather than a codex (book). The image is of a registry or census document listing citizens."
    },
    {
      "chapter": 22,
      "verses": [
        {
          "verse": 1,
          "text": "And he showed me a river of living water, radiant as crystal, flowing from the throne of God and of the Lamb",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "down the middle of the city's main street. On each side of the river stood the tree of life, producing twelve kinds of fruit, yielding its fruit each month, and the leaves of the tree are for the healing of the nations.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "There will no longer be anything accursed. The throne of God and of the Lamb will be in the city, and his servants will render him priestly service.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "They will see his face, and his name will be on their foreheads.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Night will be no more, and they will have no need of lamplight or sunlight, because the Lord God will shine upon them, and they will reign unto the ages of the ages.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "And he said to me, \"These words are trustworthy and true. The Lord, the God of the spirits of the prophets, has sent his angel to show his servants what must soon take place.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "And look—I am coming quickly! Blessed is the one who keeps the words of the prophecy of this book.\"",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And I, John, am the one who heard and saw these things. And when I heard and saw, I fell down to worship at the feet of the angel who was showing me these things.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "But he says to me, \"Do not do that! I am a fellow servant with you and with your brothers the prophets and with those who keep the words of this book. Worship God!\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And he says to me, \"Do not seal up the words of the prophecy of this book, for the appointed time is near.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "Let the wrongdoer continue doing wrong, and let the filthy continue in filth, and let the righteous continue doing righteousness, and let the holy continue being made holy.\"",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "\"Look—I am coming quickly, and my wages are with me, to repay each person according to their work.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "I am the Alpha and the Omega, the first and the last, the beginning and the end.\"",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Blessed are those who wash their robes, so that they will have the right to the tree of life and may enter the city through its gates.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "Outside are the dogs—the sorcerers, the sexually immoral, the murderers, the idol-worshippers, and everyone who loves and practices falsehood.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "\"I, Jesus, have sent my angel to testify these things to you for the assemblies. I am the root and the descendant of David, the bright morning star.\"",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "And the Spirit and the bride say, \"Come!\" And let the one who hears say, \"Come!\" And let the one who thirsts come—let the one who desires take the water of life as a gift.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "I testify to everyone who hears the words of the prophecy of this book: if anyone adds to them, God will add to that person the plagues written in this book.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "And if anyone takes away from the words of this book of prophecy, God will take away that person's share in the tree of life and in the holy city, which are written about in this book.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "The one who testifies to these things says, \"Yes, I am coming quickly.\" Amen. Come, Lord Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "The grace of the Lord Jesus be with all.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Priestly service\" (v. 3)**: The Greek λατρεύσουσιν denotes cultic, religious service—the kind of worship offered in a temple. \"Serve\" in English is too generic; \"priestly service\" captures that all God's people now perform the sacred function once reserved for priests.\n\n**\"Tree of life\" (v. 2)**: The singular ξύλον appears on both sides of the river, creating a striking image. This echoes both the Garden of Eden (Genesis 2-3) and Ezekiel's vision of the temple river (Ezekiel 47:12). The singular may suggest one tree of life manifesting on both banks.\n\n**\"Unto the ages of the ages\" (v. 5)**: The Greek εἰς τοὺς αἰῶνας τῶν αἰώνων is a Hebraic superlative construction. \"Forever and ever\" is traditional but flattens the distinctive idiom.\n\n**\"Appointed time\" (v. 10)**: The Greek καιρός refers to a decisive, appointed moment rather than mere chronological time (χρόνος). This is the critical hour, not just \"the time.\"\n\n**\"Dogs\" (v. 15)**: In Jewish usage, \"dogs\" was a term of contempt for those outside the covenant community, particularly Gentiles engaged in impure practices. Here it likely refers to those whose conduct marks them as spiritually impure.\n\n**\"Sorcerers\" (v. 15)**: The Greek φάρμακοι (from which we get \"pharmacy\") refers to practitioners of magic who used drugs, potions, and spells. This was associated with manipulation and deception.\n\n**\"Adds... will add / takes away... will take away\" (vv. 18-19)**: The Greek uses deliberate wordplay: ἐπιθῇ/ἐπιθήσει and ἀφέλῃ/ἀφελεῖ. The punishment mirrors the crime—God will add plagues to adders, remove blessings from those who remove.\n\n**\"Wages\" (v. 12)**: The Greek μισθός can mean \"reward\" or \"wages.\" Given the context of repayment according to work (ἔργον), \"wages\" captures the transactional imagery."
    }
  ]
}