{
  "book": "Revelation",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "The Unveiling of Jesus Christ, which God gave to him to show his slaves the things that must soon take place. He communicated this through signs, sending his messenger to his slave John,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "who testified to the word of God and the testimony of Jesus Christ—everything he saw.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Blessed is the one who reads aloud and those who hear the words of this prophecy and keep what is written in it, for the time is near.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "John, to the seven churches in Asia: Grace to you and peace from “The One Who Is and Who Was and Who Is Coming,” and from the seven spirits before his throne,",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "and from Jesus Christ—the faithful witness, the firstborn of the dead, and the ruler of the kings of the earth. To him who loves us and has released us from our sins by his blood—",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "and has made us a kingdom, priests to his God and Father—to him be the glory and the power forever and ever. Amen.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Look! He is coming with the clouds, and every eye will see him, even those who pierced him, and all the tribes of the earth will wail because of him. Yes, Amen.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "“I am the Alpha and the Omega,” says the Lord God, “The One Who Is and Who Was and Who Is Coming, the All-Ruler.”",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "I, John, your brother and partner in the suffering, the kingdom, and the patient endurance found in Jesus, was on the island called Patmos because of the word of God and the testimony of Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "I was in a spiritual state on the Lord’s Day, and I heard behind me a loud voice like a trumpet",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "saying, “Write what you see in a scroll and send it to the seven churches: to Ephesus, Smyrna, Pergamum, Thyatira, Sardis, Philadelphia, and Laodicea.”",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "I turned to see the voice that was speaking with me, and having turned, I saw seven gold lampstands.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "In the middle of the lampstands was one like a son of man, wearing an ankle-length robe and with a gold sash wrapped around his chest.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "His head and hair were white like white wool, like snow, and his eyes were like a flame of fire.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "His feet were like glowing bronze refined in a furnace, and his voice was like the sound of many waters.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "In his right hand he held seven stars, and from his mouth came a sharp, two-mouthed sword, and his face was like the sun shining in its full strength.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "When I saw him, I fell at his feet like a dead man. But he placed his right hand on me and said, “Do not be afraid. I am the First and the Last,",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "and the Living One. I became dead, and look! I am alive forever and ever, and I hold the keys of Death and Hades.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Therefore, write what you have seen, both the things that are and the things that are about to happen after these.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "As for the secret meaning of the seven stars that you saw in my right hand and the seven gold lampstands: the seven stars are the messengers of the seven churches, and the seven lampstands are the seven churches.”",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Unveiling\" (v. 1)**: The Greek *Apokalypsis* refers to the pulling back of a curtain or the disclosure of something previously hidden. \"Revelation\" has become a technical title, but \"Unveiling\" captures the action described.\n\n**\"Communicated this through signs\" (v. 1)**: The verb *esēmanen* means to give a sign (*sēmeion*). This is a crucial interpretive key: John is informing the reader that the visions to follow are symbolic language, not literal descriptions.\n\n**\"Slaves\" (v. 1)**: While many translations use \"servants,\" the Greek *doulos* specifically denotes a slave. In the first-century context, being a \"slave of God\" was a title of high honor, echoing the status of Moses and the prophets, while simultaneously emphasizing absolute Allegiance.\n\n**\"The One Who Is and Who Was and Who Is Coming\" (v. 4, 8)**: In Greek, this phrase is grammatically defiant. The author uses the nominative case (the case for a subject) even after a preposition (*apo*) that requires the genitive case. This intentional \"error\" treats the phrase as an unchangeable, divine Title—a Greek expansion of the Hebrew name YHWH (I AM).\n\n**\"Released\" (v. 5)**: The critical text (SBLGNT/NA28) uses *lysanti* (\"released/loosed\") rather than *lousanti* (\"washed\"). While \"washed\" is traditional (KJV), \"released\" has stronger manuscript support and emphasizes the liberation of the believer.\n\n**\"A kingdom, priests\" (v. 6)**: This is a direct allusion to Exodus 19:6. Rather than two separate categories, the Greek structure suggests a singular corporate identity: a royal collective of priestly mediators.\n\n**\"All-Ruler\" (v. 8)**: The Greek *pantokratōr* is the Septuagint’s translation for *Sabaoth* (\"of hosts\"). It implies one who has his hand upon everything—sovereign over all competing earthly powers.\n\n**\"In a spiritual state\" (v. 10)**: The phrase *egenomēn en pneumati* (literally \"I became in spirit\") refers to a prophetic trance or a state of visionary consciousness, rather than simply \"being spiritual\" in a modern sense.\n\n**\"Like a son of man\" (v. 13)**: This is a reference to the figure in Daniel 7:13. The lack of the definite article in Greek (*hyion anthrōpou*) emphasizes the quality of the figure's appearance—human-like yet divine.\n\n**\"Two-mouthed sword\" (v. 16)**: The Greek *distomos* is literally \"two-mouthed.\" In the ancient world, the \"mouth\" of the sword was its edge (the part that \"eats\" or devours). A \"two-mouthed\" sword is one that devours in every direction.\n\n**\"Hades\" (v. 18)**: This is retained as a loanword to distinguish it from the modern concept of \"Hell.\" In the first century, Hades was the underworld, the collective realm of the dead, corresponding to the Hebrew *Sheol*.\n\n**\"Secret meaning\" (v. 20)**: The Greek *mystērion* does not mean something \"mysterious\" or \"spooky,\" but rather a truth that was once hidden but is now being explained to the initiated. \"Secret meaning\" or \"revealed secret\" captures this transition from symbol to explanation."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "To the angelic messenger of the church in Ephesus, write: These are the words of the one who holds the seven stars in his right hand, the one who walks among the seven golden lampstands.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I know your works—your exhausting toil and your steadfast endurance. I know that you cannot tolerate those who are evil, and that you have tested those who claim to be apostles but are not, and have found them to be liars.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "You possess endurance and have carried a heavy burden for the sake of my name, and you have not grown weary.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But I have this against you: you have abandoned the love you had at first.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Remember, then, the height from which you have fallen! Repent and do the works you did at first. If you do not, I am coming to you and I will remove your lampstand from its place—unless you repent.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But you do have this in your favor: you hate the practices of the Nicolaitans, which I also hate.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Let anyone who has an ear listen to what the Spirit is saying to the churches. To the one who emerges victorious, I will grant the right to eat from the tree of life, which is in the paradise of God.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And to the angelic messenger of the church in Smyrna, write: These are the words of the First and the Last, who became dead and returned to life.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "I know your affliction and your poverty—though you are rich!—and the slander from those who claim to be Jews and are not, but are a synagogue of Satan.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Do not fear what you are about to suffer. Look, the Accuser is about to throw some of you into prison so that you may be tested, and for ten days you will have affliction. Be faithful even to the point of death, and I will give you the victor’s crown of life.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Let anyone who has an ear listen to what the Spirit is saying to the churches. The one who emerges victorious will never be harmed by the second death.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And to the angelic messenger of the church in Pergamum, write: These are the words of the one who has the sharp, double-edged sword.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "I know where you live—where the throne of Satan is located. Yet you hold fast to my name, and you did not deny your faith in me even in the days of Antipas, my faithful witness, who was killed among you, where Satan lives.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "But I have a few things against you: you have people there who hold to the teaching of Balaam, who taught Balak to place a stumbling block before the sons of Israel, enticing them to eat food sacrificed to idols and to practice sexual immorality.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "In the same way, you also have those who hold to the teaching of the Nicolaitans.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Repent, therefore! If you do not, I am coming to you quickly and will wage war against them with the sword of my mouth.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Let anyone who has an ear listen to what the Spirit is saying to the churches. To the one who emerges victorious, I will give some of the hidden manna, and I will give him a white stone, and on that stone is a new name inscribed which no one knows except the one who receives it.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And to the angelic messenger of the church in Thyatira, write: These are the words of the Son of God, the one who has eyes like a flame of fire and whose feet are like glowing refined bronze.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "I know your works—your love, faith, service, and steadfast endurance—and that your recent works exceed those you did at first.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "But I have this against you: you tolerate that woman Jezebel, who calls herself a prophetess and teaches and leads my servants astray to practice sexual immorality and to eat food sacrificed to idols.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "I gave her time to repent, but she refuses to repent of her immorality.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Look, I am throwing her onto a bed of suffering, and those who commit adultery with her into great affliction, unless they repent of her practices.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "I will strike her children dead. Then all the churches will know that I am the one who searches the inner desires and the hearts, and I will give to each of you according to your works.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "But to the rest of you in Thyatira—all who do not hold to this teaching and have not learned the so-called \"deep things of Satan\"—I say: I lay no other burden on you.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Only hold fast to what you have until I come.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "To the one who emerges victorious and who keeps my works until the end, I will give authority over the nations—",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "and he will shepherd them with an iron staff, just as clay jars are shattered—",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "even as I have received authority from my Father. And I will give him the morning star.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Let anyone who has an ear listen to what the Spirit is saying to the churches.",
          "paragraphStart": false
        }
      ],
      "notes": "**Angelic messenger (vv. 1, 8, 12, 18)**: The Greek *angelos* means messenger. In the context of the seven churches, this refers either to a celestial guardian of the local congregation or a personified spirit of the community itself.\n\n**Steadfast endurance (vv. 2, 3, 19)**: The Greek *hypomonē* is not passive \"patience\" but an active, courageous \"staying power\" under pressure.\n\n**The Accuser (v. 10)**: The Greek *diabolos* (Devil) literally means \"the slanderer\" or \"the accuser.\" In a context involving prisons and trials, the legal connotation of an accuser is prominent.\n\n**Victor’s crown (v. 10)**: The *stephanos* was the laurel wreath given to winning athletes or military heroes, signifying victory rather than the *diadēma* of hereditary royalty.\n\n**Throne of Satan (v. 13)**: Likely a reference to the Great Altar of Zeus in Pergamum or the city’s status as a center of the Roman imperial cult.\n\n**Stumbling block (v. 14)**: The Greek *skandalon* refers to the trigger-mechanism of a trap. It denotes something that causes someone to trip or be ensnared.\n\n**White stone (v. 17)**: The *psēphon leukēn* has several historical resonances: a \"white stone\" was used by juries to signify acquittal, by hosts as a \"token of admission\" (*tessera hospitalis*) to events, or as an amulet. Given the context of \"hidden manna\" (the messianic banquet), it likely functions as a token of admission or an invitation.\n\n**Glowing refined bronze (v. 18)**: The Greek *chalkolibanos* is a rare term for a high-quality, glowing alloy of copper or bronze. The translation emphasizes its brilliant, fire-refined appearance.\n\n**Inner desires and the hearts (v. 23)**: The Greek literally reads \"kidneys and hearts\" (*nephrous kai kardias*). In the Aramaic/Hebrew thought-world underlying this text, the kidneys were the seat of the deepest emotions and hidden desires, while the heart was the seat of the will and intellect. \n\n**Shepherd them with an iron staff (v. 27)**: The verb *poimanei* means \"to shepherd,\" but in this Messianic allusion to Psalm 2, it refers to the exercise of sovereign rule. The \"staff\" or \"rod\" is the shepherd’s tool used for both protection and discipline."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "To the messenger of the church in Sardis write: This is the declaration of the one who holds the seven spirits of God and the seven stars: I know your works. You have a reputation for being alive, but you are dead.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Wake up and strengthen what remains, which was on the verge of death; for I have not found your works completed in the sight of my God.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Remember, then, what you have received and heard; keep it and repent. If you do not wake up, I will come like a thief, and you will not know at what hour I will come upon you.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But you have a few people in Sardis who have not defiled their clothes. They will walk with me in white, for they are worthy.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "The victor will be clothed in white garments like this, and I will never erase his name from the Book of Life, but I will acknowledge his name before my Father and before his angels.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Let anyone who has an ear listen to what the Spirit says to the churches.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "To the messenger of the church in Philadelphia write: This is the declaration of the Holy One, the True One, the one who holds the key of David—who opens and no one will shut, and shuts and no one opens:",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "I know your works. Look, I have placed before you an open door that no one can shut. I know that you have little power, yet you have kept my word and have not denied my name.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Look, I will give you some from the synagogue of Satan—those who claim to be Jews and are not, but are lying. I will make them come and prostrate themselves at your feet, and they will know that I have loved you.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Because you have kept the word of my patient endurance, I will also keep you from the hour of trial that is about to come upon the whole inhabited world, to test those who dwell on the earth.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "I am coming soon. Hold onto what you have, so that no one takes your victor’s wreath.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "The victor I will make a pillar in the temple of my God, and he will never have to leave it again. I will write on him the name of my God and the name of the city of my God, the new Jerusalem that descends out of heaven from my God, and my own new name.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Let anyone who has an ear listen to what the Spirit says to the churches.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "To the messenger of the church in Laodicea write: This is the declaration of the Amen, the faithful and true witness, the originating source of God’s creation:",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "I know your works, that you are neither cold nor hot. I wish you were either cold or hot!",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "So, because you are lukewarm—neither hot nor cold—I am about to vomit you out of my mouth.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For you say, “I am rich, I have acquired wealth, and I need nothing,” and you do not realize that you are the wretched one—pitiable, poor, blind, and naked.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "I advise you to buy from me gold refined by fire so that you may become rich, and white garments so that you may clothe yourself and the shame of your nakedness may not be exposed, and medicinal salve to rub on your eyes so that you may see.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Those whom I love, I convict and discipline. Be zealous, therefore, and repent.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Look, I stand at the door and knock. If anyone hears my voice and opens the door, I will come in to him and dine with him, and he with me.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "To the victor I will grant the right to sit with me on my throne, just as I also conquered and sat down with my Father on his throne.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Let anyone who has an ear listen to what the Spirit says to the churches.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Messenger\" (v. 1, 7, 14)**: The Greek *angelos* means messenger. While it often refers to celestial beings (angels), in the context of the seven letters, it refers to the specific spiritual guardian or representative of each local congregation to whom the letter is addressed.\n\n**\"Reputation\" (v. 1)**: The Greek *onoma* literally means \"name.\" In this context, it refers to the city's or the church's public standing or \"name\" among others, which stands in contrast to their actual spiritual state.\n\n**\"Wake up\" (v. 2)**: The city of Sardis was famously captured twice in its history because its sentries failed to stay alert on its seemingly impregnable cliffs. The command *ginou grēgorōn* (\"become wakeful\") carries a sharp historical resonance for the original audience.\n\n**\"Prostrate themselves\" (v. 9)**: The Greek *proskunēsousin* describes the physical act of bowing down or falling on one's face. The context alludes to Isaiah 60:14, where the oppressors of Israel bow at their feet, reversing the social order.\n\n**\"Patient endurance\" (v. 10)**: The Greek *hypomonē* is more active than \"patience\"; it is a \"staying under\" pressure, a courageous persistence in the face of difficulty.\n\n**\"Inhabited world\" (v. 10)**: The Greek *oikoumenē* refers specifically to the civilized, Roman-governed world, rather than the physical planet (*kosmos*).\n\n**\"Victor’s wreath\" (v. 11)**: The *stephanos* was not a royal crown (*diadēma*) but the laurel wreath awarded to athletes or conquering generals.\n\n**\"The Amen\" (v. 14)**: Used here as a personal title. It derives from the Hebrew root for \"truth\" or \"certainty,\" identifying Jesus as the fulfillment of God’s promises (cf. Isaiah 65:16).\n\n**\"Originating source\" (v. 14)**: The Greek *archē* can mean \"beginning,\" \"ruler,\" or \"origin.\" In light of the Christology of the era (cf. Colossians 1:15-18), it suggests that Christ is the principle or source from which all creation began, rather than the first thing created.\n\n**\"Vomit\" (v. 16)**: The Greek *emesai* is a graphic term for vomiting. \"Spit out\" is too mild; the text conveys a visceral reaction of disgust. This likely alludes to the lukewarm, mineral-heavy water of Laodicea, which was notoriously unpalatable compared to the hot springs of Hierapolis or the cold water of Colossae.\n\n**\"The wretched one\" (v. 17)**: The use of the definite article (*ho talaipōros*) singles out the Laodicean church as the personification of misery, despite their perceived wealth.\n\n**\"Medicinal salve\" (v. 18)**: The Greek *kollourion* was a specific type of eye paste. Laodicea was famous for its medical school and the production of \"Phrygian powder\" used for eye ailments. The text uses the city's own commercial pride to highlight its spiritual blindness."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "After this, I looked, and there was a door standing open in the heavens. The first voice I had heard—the one like a trumpet speaking with me—said, “Come up here, and I will show you what must take place after these things.”",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Immediately, I was in a prophetic trance. There, set in heaven, was a throne, and someone was seated upon it.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "The one seated there had the appearance of jasper and carnelian, and a rainbow that looked like an emerald encircled the throne.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Surrounding the throne were twenty-four other thrones, and seated on those thrones were twenty-four elders. They were clothed in white garments and had golden victors’ wreaths upon their heads.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "From the throne came flashes of lightning, rumblings, and peals of thunder. Burning before the throne were seven flaming torches, which are the seven spirits of God.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "In front of the throne was something like a sea of glass, as clear as crystal. In the center, at each side of the throne, were four living creatures covered with eyes, both in front and behind.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "The first creature was like a lion, the second creature was like a young ox, the third creature had a face like a human being, and the fourth creature was like an eagle in flight.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Each of the four living creatures had six wings, and they were covered with eyes all around and even under their wings. Day and night they never stop saying: “Holy, holy, holy is the Lord God, the Ruler of All, who was, and who is, and who is coming.”",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Whenever the living creatures give glory, honor, and thanks to the one seated on the throne—the one who lives forever and ever—",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "the twenty-four elders fall down before the one seated on the throne and worship the one who lives forever and ever. They cast their victors’ wreaths before the throne, saying:",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "“You are worthy, our Lord and God, to receive the glory and the honor and the power, for you created all things; by your will they existed, and they were created.”",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Prophetic trance\" (v. 2)**: The Greek *ἐγενόμην ἐν πνεύματι* (literally \"I became in spirit\") refers to a state of visionary consciousness. In the context of apocalyptic literature and the author's debt to Ezekiel, this is not merely a \"mood\" but a specific state of being caught up by the Divine Spirit to perceive heavenly realities.\n\n**\"Victors’ wreaths\" (v. 4, 10)**: The Greek *στέφανος* (stephanos) refers to the laurel wreath given to a victorious athlete or a crown of honor, rather than the *διάδημα* (diadema), which is the crown of a hereditary monarch. The elders wear these as signs of their endurance and victory.\n\n**\"Rumblings\" (v. 5)**: While *φωναί* is often translated as \"voices,\" in the context of lightning and thunder, it refers to the atmospheric sounds of a storm. This triad (lightning, sounds, thunder) deliberately evokes the theophany at Mount Sinai (Exodus 19:16).\n\n**\"Seven spirits of God\" (v. 5)**: This is likely a reference to the \"sevenfold Spirit\" or the plenitude of the Holy Spirit, drawing from the imagery of the seven-branched lampstand (Menorah) and Isaiah 11:2 in the Septuagint.\n\n**\"In the center, at each side of the throne\" (v. 6)**: The Greek *ἐν μέσῳ τοῦ θρόνου καὶ κύκλῳ τοῦ θρόνου* is spatially paradoxical (literally \"in the middle of the throne and around the throne\"). It likely describes the creatures stationed at the midpoint of each of the four sides of the throne, suggesting they are both part of the throne-chariot and surrounding it.\n\n**\"Ruler of All\" (v. 8)**: The term *παντοκράτωρ* is the standard Septuagint translation for *Sabaoth* (Lord of Hosts). While \"Almighty\" is traditional, \"Ruler of All\" or \"The One who holds all things\" more accurately captures the Greek sense of total sovereign grip over the cosmos.\n\n**\"Who is coming\" (v. 8)**: The Greek *ὁ ἐρχόμενος* is a present participle. Rather than a static \"is to come,\" it implies an active, approaching movement. God is the one who is even now on the way to intervene in history.\n\n**\"Our Lord and God\" (v. 11)**: This specific phrasing (*ὁ κύριος καὶ ὁ θεὸς ἡμῶν*) was a direct counter-assertion to the Roman Emperor Domitian, who demanded to be addressed as *Dominus et Deus noster* (\"Our Lord and God\"). The acclamation \"You are worthy\" (*Ἄξιος εἶ*) also mirrors the language of imperial court ceremonies.\n\n**\"They existed, and they were created\" (v. 11)**: The Greek *ἦσαν* (they were/existed) precedes *ἐκτίσθησαν* (they were created). This likely reflects the theological concept that all things existed in the mind or will of God before they were brought into physical existence."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "Then I saw at the right hand of the One seated on the throne a scroll, written on both the inside and the back, sealed tight with seven seals.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And I saw a mighty messenger proclaiming with a loud voice: “Who is worthy to open the scroll and break its seals?”",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "But no one in heaven or on earth or under the earth was able to open the scroll or even to look into it.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And I began to weep bitterly because no one was found worthy to open the scroll or to look into it.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Then one of the elders said to me, “Stop weeping! Look—the Lion from the tribe of Judah, the Root of David, has triumphed; he is able to open the scroll and its seven seals.”",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Then I saw standing in the center, between the throne and the four living creatures and among the elders, a Lamb that looked as though it had been slaughtered. It had seven horns and seven eyes, which are the seven spirits of God sent out into all the earth.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "He came and took the scroll from the right hand of the One seated on the throne.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "When he took the scroll, the four living creatures and the twenty-four elders fell down before the Lamb. Each one held a lyre and shallow golden bowls full of incense, which are the prayers of the holy ones.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "And they sang a new song, saying: “You are worthy to take the scroll and to open its seals, for you were slaughtered, and by your blood you purchased for God people from every tribe and language and people and nation.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "You have made them a kingdom and priests for our God, and they are reigning upon the earth.”",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then I looked, and I heard the voice of many messengers surrounding the throne and the living creatures and the elders. They numbered myriads of myriads and thousands of thousands,",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "saying with a loud voice: “Worthy is the slaughtered Lamb to receive power and wealth and wisdom and might and honor and glory and blessing!”",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then I heard every creature in heaven and on earth and under the earth and on the sea, and everything in them, saying: “To the One seated on the throne and to the Lamb be blessing and honor and glory and sovereign power throughout the ages of ages!”",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "And the four living creatures kept saying, “Amen!” and the elders fell down and worshiped.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"At the right hand\" (v. 1)**: The Greek *epi tēn dexian* suggests the scroll is lying on the open palm of the right hand of the Enthroned One, or perhaps situated just beside the hand, waiting to be claimed.\n\n**\"Scroll\" (v. 1)**: While *biblion* is the ancestor of the word \"Bible,\" in the first century it specifically referred to a papyrus or parchment scroll. The description of it being written on both sides (*opisthograph*) was a known Roman legal convention for certain types of contracts or wills, signifying that the document was complete and nothing could be added.\n\n**\"Sealed tight\" (v. 1)**: The verb *katesphragismenon* uses the intensifying prefix *kata-*, suggesting the scroll is not merely \"sealed\" but \"sealed up\" or \"securely sealed.\"\n\n**\"Mighty messenger\" (v. 2)**: The Greek *angelon* is translated as \"messenger\" to retain the functional role of the being. A \"mighty\" (*ischyron*) messenger is required to project a voice across the entire cosmos.\n\n**\"Worthy\" (v. 2)**: The term *axios* implies more than moral goodness; it refers to being \"fit,\" \"qualified,\" or \"having the standing\" to perform a specific task—in this case, the legal and cosmic authority to enact God's purposes.\n\n**\"Look into it\" (v. 3, 4)**: The verb *blepein* (\"to see\") in this context implies peering into the contents of the scroll to read or understand them.\n\n**\"Slaughtered\" (v. 6, 12)**: The Greek *esphagmenon* specifically refers to the violent throat-cutting used in animal sacrifice. Traditional \"slain\" is too sanitized; \"slaughtered\" better captures the visceral imagery of the sacrificial cultus which the original audience would have recognized.\n\n**\"Horns\" (v. 6)**: In the Hebrew scriptures and apocalyptic literature, \"horns\" are a standard metaphor for power and kingly authority. Seven horns signify perfect or complete power.\n\n**\"Purchased\" (v. 9)**: The Greek *ēgorasas* is commercial language from the *agora* (marketplace). It was commonly used for the manumission of slaves, where a price was paid to \"buy\" a slave's freedom into the service of a deity.\n\n**\"Kingdom and priests\" (v. 10)**: This is a direct allusion to Exodus 19:6. Rather than individuals being \"kings,\" they collectively constitute a \"kingdom\" (*basileian*).\n\n**\"Sovereign power\" (v. 13)**: The Greek *kratos* refers to exercised power, dominion, or the \"might\" that rules. It is more specific than *dynamis* (inherent power)."
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "I watched as the Lamb opened the first of the seven seals, and I heard one of the four living creatures say with a voice like thunder, “Come!”",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I looked, and there was a white horse! Its rider held a bow, and a victor’s crown was given to him. He went out conquering, and in order to conquer.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "When he opened the second seal, I heard the second living creature say, “Come!”",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "And another horse went out, fiery red. Its rider was permitted to take peace from the earth so that people would slaughter one another, and he was given a great sword.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "When he opened the third seal, I heard the third living creature say, “Come!” I looked, and there was a black horse! Its rider held a pair of scales in his hand.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Then I heard what sounded like a voice from among the four living creatures, saying, “A quart of wheat for a day’s wage, and three quarts of barley for a day’s wage—but do not damage the olive oil and the wine!”",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "When he opened the fourth seal, I heard the voice of the fourth living creature say, “Come!”",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "I looked, and there was a pale, sickly green horse! The name of its rider was Death, and Hades followed close behind him. They were given authority over a fourth of the earth, to kill by the broadsword, by famine, by plague, and by the wild animals of the earth.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "When he opened the fifth seal, I saw underneath the altar the souls of those who had been slaughtered because of the word of God and because of the witness they had maintained.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "They cried out with a loud voice, “Sovereign Lord, holy and true, how long until you judge those who live on the earth and avenge our blood?”",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then each of them was given a white robe, and they were told to rest a little longer, until the number was complete of their fellow slaves and their brothers and sisters who were about to be killed just as they had been.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "I watched as he opened the sixth seal, and a great earthquake occurred. The sun became black like sackcloth made of hair, and the full moon became like blood.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "The stars of the sky fell to the earth, like a fig tree drops its unripe fruit when shaken by a gale.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "The sky vanished like a scroll being rolled up, and every mountain and island was jolted from its place.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Then the kings of the earth, the high officials, the military commanders, the rich, the powerful, and every slave and free person hid themselves in the caves and among the rocks of the mountains.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "They called out to the mountains and the rocks, “Fall on us and hide us from the face of the one seated on the throne and from the wrath of the Lamb!",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For the great day of their wrath has come, and who is able to stand?”",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Come!\" (v. 1, 3, 5, 7)**: Many traditional translations (following later manuscripts) add \"and see.\" However, the earliest and best manuscripts contain only *Erchou* (\"Come\"). This is not an invitation to John to look, but a judicial summons issued by the living creatures to the four riders.\n\n**\"Slaughter\" (v. 4, 9)**: The Greek *sphazō* refers to the butchering of an animal or a ritual slaughter. It is a more violent and graphic term than the standard word for \"kill\" (*apokteinō*). It links the death of the martyrs (v. 9) to the sacrificial imagery of the Lamb (*arnion*).\n\n**\"A day’s wage\" (v. 6)**: The Greek *dēnariou* refers to a denarius, the standard daily pay for a laborer. A *choinix* (quart) of wheat was the approximate daily ration for one person. This depicts a period of extreme hyperinflation where a man's entire daily wage can only buy enough food for himself, leaving nothing for his family or other necessities. \n\n**\"Pale, sickly green\" (v. 8)**: The word *chlōros* describes the yellowish-green color of vegetation, but when applied to a horse in this context, it evokes the ashen, livid pallor of a corpse. \n\n**\"Plague\" (v. 8)**: The Greek *thanatō* literally means \"death,\" but in the Septuagint (the Greek Old Testament), it is frequently used to translate the Hebrew *deber* (\"pestilence\" or \"plague\"), particularly in \"four-fold judgments\" like those found in Ezekiel 14:21, which this passage alludes to.\n\n**\"Sovereign Lord\" (v. 10)**: The Greek *despotēs* refers to a master with absolute authority or an owner of slaves. In a Roman context, it emphasizes God’s absolute legal and moral right to judge, contrasting with the earthly \"despots\" of the empire.\n\n**\"Witness\" (v. 9)**: The Greek *martyrian* carries the sense of legal testimony. These individuals were killed because of their \"testimony,\" and they now appeal to the Sovereign for a legal verdict.\n\n**\"Fellow slaves\" (v. 11)**: The Greek *syndouloi* is often softened to \"fellow servants,\" but \"fellow slaves\" captures the first-century reality of total belonging to a master—in this case, the Sovereign of verse 10.\n\n**\"Unripe fruit\" (v. 13)**: *Olynthous* refers specifically to late-season figs that grow in winter but fall off before ripening in the spring.\n\n**\"High officials\" and \"Military commanders\" (v. 15)**: *Megistanes* (grandees/magnates) and *chiliarchoi* (tribunes/commanders of a thousand) are specific Roman-era social and military ranks. The list in verse 15 is intended to encompass the entire Roman social hierarchy."
    },
    {
      "chapter": 7,
      "verses": [
        {
          "verse": 1,
          "text": "After this, I saw four angels standing at the four corners of the earth, holding back the four winds of the earth so that no wind would blow on the land or on the sea or against any tree.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Then I saw another angel ascending from the rising of the sun, carrying the seal of the living God. He shouted with a great voice to the four angels who had been authorized to harm the land and the sea,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "saying, “Do not harm the land or the sea or the trees until we have sealed the bondservants of our God on their foreheads.”",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "And I heard the number of those who were sealed: one hundred and forty-four thousand, sealed from every tribe of the sons of Israel:",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "From the tribe of Judah, twelve thousand were sealed; from the tribe of Reuben, twelve thousand; from the tribe of Gad, twelve thousand;",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "from the tribe of Asher, twelve thousand; from the tribe of Naphtali, twelve thousand; from the tribe of Manasseh, twelve thousand;",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "from the tribe of Simeon, twelve thousand; from the tribe of Levi, twelve thousand; from the tribe of Issachar, twelve thousand;",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "from the tribe of Zebulun, twelve thousand; from the tribe of Joseph, twelve thousand; from the tribe of Benjamin, twelve thousand were sealed.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "After these things I looked, and behold, a vast crowd that no one was able to number, from every nation and all tribes and peoples and languages, standing before the throne and before the Lamb. They were clothed in long white robes and were holding palm branches in their hands.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "They cried out with a great voice, saying: “Salvation belongs to our God, the one seated on the throne, and to the Lamb!”",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And all the angels stood in a circle around the throne and the elders and the four living beings; they fell on their faces before the throne and worshiped God,",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "saying: “Amen! The blessing and the glory and the wisdom and the thanksgiving and the honor and the power and the strength be to our God forever and ever. Amen!”",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then one of the elders addressed me, saying, “These people clothed in long white robes—who are they, and where did they come from?”",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "I said to him, “My lord, you are the one who knows.” And he said to me, “These are the ones coming out of the great ordeal; they have washed their robes and made them white in the blood of the Lamb.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For this reason: They are before the throne of God, and they offer him liturgical service day and night in his sanctuary; and the one seated on the throne will spread his tent over them.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "They will never hunger again, nor will they ever thirst; the sun will not beat down on them, nor any scorching heat.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For the Lamb who is at the center of the throne will shepherd them, and he will guide them to springs of the water of life; and God will wipe away every tear from their eyes.”",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Rising of the sun\" (v. 2)**: The Greek *anatolēs hēliou* is the standard term for \"the East,\" but the literal imagery of the rising sun carries messianic and Edenic overtones (referencing the direction of paradise and the \"Day-spring\" of Luke 1:78) that the simple directional \"East\" misses.\n\n**\"Bondservants\" (v. 3)**: The Greek *douloi* refers to those in a state of total belonging to a master. While \"servants\" is common, \"bondservants\" or \"slaves\" better captures the first-century reality of the *doulos* as someone whose entire identity and security are found in their master—a status of high honor when the master is God.\n\n**\"Salvation\" (v. 10)**: The Greek *hē sōtēria* functions here as a shout of victory or acclamation. In a Roman context, such acclamations were often directed at the Emperor. By ascribing *hē sōtēria* to God and the Lamb, the multitude is making a subversive political and theological claim: deliverance and cosmic order come from God, not Caesar.\n\n**\"Great ordeal\" (v. 14)**: The Greek *thlipsis* denotes pressure, crushing, or affliction. While traditionally rendered \"tribulation,\" this has become a technical term in modern eschatology that may obscure the original sense of an intense, crushing period of testing.\n\n**\"Liturgical service\" (v. 15)**: The verb *latreuousin* refers specifically to the service performed by priests in a cultic or temple setting. It is more specific than general \"service\" (*douleuō*).\n\n**\"Sanctuary\" (v. 15)**: The word *naō* refers to the inner sanctum or the actual dwelling place of the deity, as opposed to *hieron*, which refers to the entire temple precinct.\n\n**\"Spread his tent over them\" (v. 15)**: The Greek *skēnōsei* is a direct allusion to the *mishkan* (Tabernacle) of the Hebrew Scriptures and the *Shekinah* (the indwelling glory of God). It implies a protective, hovering presence. The phrasing \"over them\" (*ep’ autous*) suggests the cloud of glory covering the people.\n\n**\"The Lamb... will shepherd them\" (v. 17)**: This is a deliberate and striking paradox in the Greek. The *arnion* (little lamb) performs the role of the *poimanei* (shepherding). The victim becomes the protector. This reflects the author’s consistent use of \"Lamb\" as the primary Christological title."
    },
    {
      "chapter": 8,
      "verses": [
        {
          "verse": 1,
          "text": "And when he opened the seventh seal, there was silence in heaven for about half an hour.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Then I saw the seven angels who stand in the presence of God, and seven trumpets were given to them.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Another angel came and stood at the altar, holding a golden censer, and he was given a great amount of incense to offer with the prayers of all the holy ones upon the golden altar that is before the throne.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "The smoke of the incense, together with the prayers of the holy ones, ascended from the hand of the angel into the presence of God.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Then the angel took the censer, filled it with fire from the altar, and hurled it to the earth; and there were crashes of thunder, rumblings, flashes of lightning, and an earthquake.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Then the seven angels holding the seven trumpets prepared themselves to sound them.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "The first sounded his trumpet, and there came hail and fire mixed with blood, and it was hurled to the earth; a third of the earth was burned up, a third of the trees were burned up, and all the green grass was burned up.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "The second angel sounded his trumpet, and something like a great mountain, blazing with fire, was hurled into the sea; a third of the sea became blood,",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "a third of the living creatures in the sea died, and a third of the ships were destroyed.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "The third angel sounded his trumpet, and a great star, blazing like a torch, fell from heaven; it fell on a third of the rivers and on the springs of water.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "The name of the star is called Wormwood. A third of the waters turned into wormwood, and many people died from the waters because they had been made bitter.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "The fourth angel sounded his trumpet, and a third of the sun was struck, along with a third of the moon and a third of the stars, so that a third of them would be darkened, and the day would not shine for a third of its duration, and the night likewise.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Then I looked, and I heard an eagle flying in mid-heaven, crying out with a loud voice, “Woe! Woe! Woe to those who dwell upon the earth, because of the remaining trumpet blasts of the three angels who are about to sound!”",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Silence in heaven\" (v. 1)**: This \"half-hour\" silence is not merely a pause in the narrative but reflects the Jewish liturgical practice where silence was kept in the temple while incense was offered (echoed in v. 3-4). It also alludes to prophetic traditions where the earth is silent before the judgment of God (Habakkuk 2:20, Zephaniah 1:7).\n\n**\"Holy ones\" (v. 3, 4)**: The Greek *hagioi* is traditionally translated as \"saints.\" However, in the first-century context, this refers to the community of God's people set apart for His purposes, mirroring the \"holy ones\" of the Hebrew scriptures.\n\n**\"Censer\" (v. 3, 5)**: The Greek *libanōtos* can refer to the frankincense itself, but when described as \"golden\" and being \"filled with fire,\" it clearly refers to the vessel used for burning incense.\n\n**\"Rumblings\" (v. 5)**: The Greek *phōnai* literally means \"voices\" or \"sounds.\" In the context of a storm-theophany (thunder and lightning), it refers to the terrifying sounds associated with divine presence or atmospheric upheaval, rather than human speech.\n\n**\"Living creatures\" (v. 9)**: The Greek *ta echonta psychas* literally means \"those having souls.\" In the Aramaic and Hebrew thought-world, *psychē/nephesh* refers to the \"life-breath\" or \"vitality\" of any animate creature.\n\n**\"Wormwood\" (v. 11)**: *Apsinthos* refers to a plant (Artemisia) known for its extreme bitterness. In the Hebrew tradition (e.g., Jeremiah 9:15), it is a metaphor for judgment and sorrow. \n\n**\"For a third of its duration\" (v. 12)**: The Greek phrase *hē hēmera mē phanē to triton autēs* is somewhat compressed. It suggests that the light of the day (and night) was removed for a third of its usual time, rather than the light being dimmed by a third of its intensity.\n\n**\"Eagle\" (v. 13)**: While some later manuscripts change this to \"angel,\" the earliest and best manuscripts (and the SBLGNT) read *aetos* (eagle). In the ancient world, an eagle was a bird of omen and a symbol of swiftness, especially in judgment. \"Mid-heaven\" (*mesouranēma*) refers to the point where the sun reaches its zenith, the most visible part of the sky to everyone on earth."
    },
    {
      "chapter": 9,
      "verses": [
        {
          "verse": 1,
          "text": "Then the fifth angel sounded his trumpet, and I saw a star that had fallen from heaven to the earth, and the key to the shaft of the Abyss was given to him.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He opened the shaft of the Abyss, and smoke rose up out of the shaft like the smoke of a massive furnace, and the sun and the air were darkened by the smoke from the shaft.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Out of the smoke, locusts came forth onto the earth, and they were given power like the power that scorpions of the earth possess.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "They were told not to damage the grass of the earth, nor any green plant, nor any tree, but only those people who do not have the seal of God on their foreheads.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "They were not permitted to kill them, but were commissioned to torment them for five months; and their torment was like the sting of a scorpion when it strikes a person.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "In those days, people will seek death and will certainly not find it; they will long to die, yet death flees from them.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "In appearance, the locusts were like horses prepared for battle. On their heads were what looked like crowns of gold, and their faces were like human faces.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "They had hair like the hair of women, and their teeth were like the teeth of lions.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "They had breastplates like breastplates of iron, and the sound of their wings was like the roar of many horse-drawn chariots charging into battle.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "They have tails like scorpions, equipped with stingers; and in their tails is their power to harm people for five months.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "They have as king over them the angel of the Abyss; his name in Hebrew is Abaddon, and in the Greek tongue he has the name Apollyon.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "The first woe has passed; behold, two more woes are still coming after these things.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Then the sixth angel sounded his trumpet, and I heard a lone voice speaking from the four horns of the golden altar that stands before God.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "It said to the sixth angel who had the trumpet, \"Release the four angels who have been bound at the great river Euphrates.\"",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "So the four angels—who had been kept ready for this very hour and day and month and year—were released to kill a third of humanity.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "The number of the mounted troops was two hundred million; I heard their number.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "And this is how I saw the horses and those sitting on them in the vision: they wore breastplates that were fiery red, hyacinth blue, and sulfurous yellow. The heads of the horses were like the heads of lions, and out of their mouths came fire and smoke and sulfur.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "By these three plagues—by the fire and the smoke and the sulfur coming out of their mouths—a third of humanity was killed.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "For the power of the horses is in their mouths and in their tails; for their tails are like snakes, possessing heads, and with them they inflict harm.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "The rest of humanity, who were not killed by these plagues, did not repent of the works of their hands; they did not stop worshiping demons and idols made of gold, silver, bronze, stone, and wood—which can neither see nor hear nor walk.",
          "paragraphStart": true
        },
        {
          "verse": 21,
          "text": "Nor did they repent of their murders, or their sorceries, or their sexual immorality, or their thefts.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The shaft of the Abyss\" (v. 1, 2)**: The Greek *phrear* refers to a pit or a well-shaft. The *abyssos* (Abyss) in first-century Jewish thought was the subterranean prison for fallen angels and demonic spirits. The imagery suggests a literal opening of a cosmic prison vent.\n\n**\"The star that had fallen\" (v. 1)**: The Greek uses a perfect participle (*peptōkota*), indicating an event that happened in the past with results continuing into the present. In the context of the Apocalypse, stars are often personified as angelic beings.\n\n**\"Torment\" (v. 5)**: The Greek *basanizō* originally referred to the use of a touchstone to test the purity of metals, but evolved to mean judicial torture. Here it implies an agonizing, inescapable physical and mental distress.\n\n**\"Abaddon / Apollyon\" (v. 11)**: These are not merely names but titles. *Abaddon* is a Hebrew term for \"Destruction\" or the place of the dead. *Apollyon* is the Greek equivalent, meaning \"Destroyer.\" This is a rare instance where the author provides a bilingual identification to ensure the character of the entity is understood by both Jewish and Greek readers.\n\n**\"Hyacinth blue\" (v. 17)**: The Greek *hyakinthinos* refers to a deep, dark blue or purple-black color, similar to the smoke or the darkening of the sky. It forms a triad of deathly colors with \"fire\" (red) and \"sulfur\" (yellow).\n\n**\"Two hundred million\" (v. 16)**: The Greek text reads *dismyriades myriadōn*—literally \"two myriads of myriads.\" A myriad is 10,000, so \"20,000 times 10,000\" equals 200,000,000. In the ancient world, this number represented an army of impossible, supernatural proportions.\n\n**\"Sorceries\" (v. 21)**: The Greek *pharmakon* refers to the use of drugs, potions, and spells, often associated with ritual magic and the occult. It implies a deceptive, mind-altering form of religious practice.\n\n**\"Sexual immorality\" (v. 21)**: The Greek *porneia* is a broad term covering all forms of sexual activity outside the boundaries of the covenantal order, often linked in the prophets and Revelation with spiritual infidelity and idolatry."
    },
    {
      "chapter": 10,
      "verses": [
        {
          "verse": 1,
          "text": "Then I saw another mighty messenger descending from heaven, wrapped in a cloud, with the rainbow over his head. His face shone like the sun, and his legs were like pillars of fire.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "In his hand he held a little scroll that had been opened. He planted his right foot on the sea and his left foot on the land,",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "and he cried out with a great voice, sounding like the roar of a lion. When he cried out, the seven thunders uttered their own voices.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "When the seven thunders spoke, I was about to write; but I heard a voice from heaven saying, “Seal up what the seven thunders have spoken, and do not write it down.”",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "Then the messenger whom I saw standing on the sea and on the land raised his right hand toward heaven",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "and swore an oath by the One who lives forever and ever—who created the heaven and everything in it, the earth and everything in it, and the sea and everything in it—that there will be no more delay.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Rather, in the days when the seventh messenger is heard—whenever he is about to blow his trumpet—the secret purpose of God is brought to its completion, just as he announced the good news to his own servants, the prophets.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Then the voice that I had heard from heaven spoke to me again, saying, “Go, take the scroll that has been opened in the hand of the messenger who is standing on the sea and on the land.”",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "So I went to the messenger and told him to give me the little scroll. And he said to me, “Take it and eat it up; it will turn your stomach bitter, but in your mouth it will be as sweet as honey.”",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "I took the little scroll from the hand of the messenger and ate it. In my mouth it was as sweet as honey, but when I had swallowed it, my stomach was made bitter.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then they said to me, “It is necessary for you to prophesy again concerning many peoples and nations and languages and kings.”",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Mighty messenger\" (v. 1)**: The Greek *angelos* simply means \"messenger.\" While \"angel\" is a standard transliteration, \"messenger\" emphasizes the functional role of this being as a herald of a divine decree, especially in a chapter focused on the transmission of a \"little scroll.\"\n\n**\"The rainbow\" (v. 1)**: The presence of the definite article (*hē iris*) suggests a specific rainbow—likely the one surrounding the throne of God (Rev 4:3) or the sign of the Noahic covenant (Gen 9). It identifies the messenger as coming directly from the divine presence.\n\n**\"Legs\" (v. 1)**: While *podes* is literally \"feet,\" in the context of the architectural metaphor \"pillars of fire\" (*styloi pyros*), it refers to the entire limb. A pillar does not stop at a \"foot\"; the visual is of the legs as massive, fiery columns supporting the messenger as he bestrides the earth and sea.\n\n**\"No more delay\" (v. 6)**: The Greek *chronos* is often translated as \"time,\" but here it carries the sense of \"an interval of time\" or \"delay.\" Given the context of the saints' plea for justice (\"How long...?\" in Rev 6:10), the messenger is announcing that the period of waiting is over.\n\n**\"Secret purpose\" (v. 7)**: The term *mysterion* does not mean something \"mysterious\" or \"spooky,\" but rather a divine plan or truth that was previously hidden and is now being revealed. \"Secret purpose\" or \"hidden plan\" captures this better for a modern reader than the ecclesiastical \"mystery.\"\n\n**\"Is brought to its completion\" (v. 7)**: The Greek *etelesthē* is in the aorist tense, but it is used here to describe a future event as so certain that it is spoken of as already finished (a \"proleptic aorist\").\n\n**\"Announced the good news\" (v. 7)**: The verb *euangelisen* is the root of \"evangelize.\" It specifically refers to the proclamation of the Gospel. This highlights that even the judgments of Revelation are part of the \"good news\" of God’s kingdom finally coming to earth.\n\n**\"Eat it up\" (v. 9)**: The verb *kataphage* is an intensive form of \"eat,\" suggesting to consume entirely. This alludes to Ezekiel 3, where the prophet must internalize the word of God before he can speak it.\n\n**\"Concerning\" (v. 11)**: The preposition *epi* can mean \"about,\" \"concerning,\" or \"against.\" Given that the prophecies following this chapter involve both judgment and the destiny of nations, \"concerning\" provides the necessary scope."
    },
    {
      "chapter": 11,
      "verses": [
        {
          "verse": 1,
          "text": "Then I was given a measuring rod like a staff, and someone said, “Get up and measure the sanctuary of God and the altar, and count those who worship there.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "But exclude the courtyard outside the sanctuary; do not measure it, because it has been handed over to the nations, and they will trample the holy city for forty-two months.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And I will grant authority to my two witnesses, and they will prophesy for one thousand two hundred and sixty days, clothed in sackcloth.”",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "These are the two olive trees and the two lampstands that stand before the Lord of the earth.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "If anyone intends to harm them, fire pours out from their mouths and consumes their enemies; if anyone should intend to harm them, this is how they must be killed.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "These witnesses have the authority to shut the sky so that no rain falls during the days of their prophecy, and they have authority over the waters to turn them into blood and to strike the earth with every kind of plague as often as they desire.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "When they have finished their testimony, the beast that comes up from the abyss will make war against them, conquer them, and kill them.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "Their corpses will lie in the main street of the great city—the one symbolically called “Sodom” and “Egypt,” where their Lord was also crucified.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For three and a half days, people from the peoples, tribes, languages, and nations gaze at their corpses and refuse to let their bodies be placed in a tomb.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "The inhabitants of the earth gloat over them and celebrate, sending gifts to one another, because these two prophets had tormented the inhabitants of the earth.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "But after the three and a half days, a breath of life from God entered them, and they stood up on their feet; great fear fell upon those who watched them.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "Then the witnesses heard a loud voice from heaven saying to them, “Come up here!” and they went up to heaven in a cloud while their enemies watched them.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "At that very hour there was a massive earthquake, and a tenth of the city collapsed. Seven thousand people were killed in the earthquake, and the rest were terrified and gave glory to the God of heaven.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "The second woe has passed; behold, the third woe is coming quickly.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "Then the seventh angel blew his trumpet. There were loud voices in heaven, saying, “The sovereignty of the world has passed to our Lord and to his Christ, and he will reign forever and ever.”",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "And the twenty-four elders who sit on their thrones before God fell on their faces and worshiped God,",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "saying, “We give thanks to you, Lord God, the All-Sovereign, the one who is and who was, because you have taken up your great power and have begun to reign.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "The nations were enraged, but your wrath came, as did the time for the dead to be judged and for you to give the reward to your servants—to the prophets, the holy ones, and those who fear your name, both the small and the great—and the time to destroy those who destroy the earth.”",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Then the sanctuary of God in heaven was opened, and the ark of his covenant was seen within his sanctuary. There were flashes of lightning, rumblings, peals of thunder, an earthquake, and heavy hail.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Sanctuary\" (v. 1, 2, 19)**: The Greek *naos* refers specifically to the inner temple building (the Holy Place and the Most Holy Place) where God’s presence dwells, as opposed to the *hieron*, which encompasses the entire temple precinct and its outer courts.\n\n**\"Exclude\" (v. 2)**: The Greek *ekbale* literally means \"throw out\" or \"cast out.\" In this context, it functions as a technical command to leave the outer court unmeasured, signifying its abandonment to profane forces.\n\n**\"Symbolically\" (v. 8)**: The word *pneumatikōs* (literally \"spiritually\") here refers to a prophetic or allegorical application of names. The city is geographically Jerusalem (where the Lord was crucified), but its character is revealed through the archetypes of Sodom (moral depravity) and Egypt (oppression).\n\n**\"Corpses\" (v. 8, 9)**: The Greek *ptōma* denotes a fallen body, a carcass. The use of the singular in verse 8 (\"their corpse\") may suggest the corporate unity of the two witnesses' testimony, though many manuscripts move to the plural in verse 9.\n\n**\"Inhabitants of the earth\" (v. 10)**: This is a technical term in Revelation (Greek: *tous katoikountas epi tēs gēs*) referring not just to people living on the planet, but specifically to those who are settled in and committed to the world system in opposition to God.\n\n**\"The sovereignty of the world has passed\" (v. 15)**: The Greek *egeneto hē basileia* is singular (\"The kingdom... has become\"). It does not refer to various earthly kingdoms becoming godly, but to the total transfer of the world's \"kingship\" or \"sovereignty\" into the hands of God.\n\n**\"All-Sovereign\" (v. 17)**: The Greek *pantokratōr* is the Septuagint’s rendering of *Sabaoth* (Lord of Hosts) or *Shaddai* (Almighty). It denotes God’s absolute rule over all forces in the universe.\n\n**\"The one who is and who was\" (v. 17)**: Traditional texts often add \"and who is to come\" (as in 1:8). However, the earliest and best manuscripts omit that phrase here because, in the context of the seventh trumpet, God has already \"arrived\" and begun his reign.\n\n**\"Destroy those who destroy the earth\" (v. 18)**: The Greek *diaphtheirai* carries the sense of \"to ruin\" or \"to corrupt.\" There is a poetic justice in the Greek text: those who have ruined or corrupted the earth are now themselves brought to ruin."
    },
    {
      "chapter": 12,
      "verses": [
        {
          "verse": 1,
          "text": "A great and wondrous sign appeared in the heavens: a woman clothed with the sun, with the moon beneath her feet, and on her head a victor’s crown of twelve stars.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "She was pregnant and was screaming in the pangs of birth, agonized to bring forth the child.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Then another sign appeared in the heavens: look, a massive, fiery-red dragon with seven heads and ten horns, and on its heads were seven royal diadems.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "Its tail swept away a third of the stars of heaven and hurled them to the earth. The dragon stood before the woman who was about to give birth, so that he might devour her child the moment it was born.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "She gave birth to a son, a male child, who is destined to shepherd all the nations with a staff of iron. But her child was snatched away to God and to his throne.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Then the woman fled into the wilderness, where she has a place prepared by God, so that there she might be nourished for one thousand two hundred and sixty days.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Then war broke out in heaven: Michael and his angels fought against the dragon. The dragon and his angels fought back,",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "but he was not strong enough, and no place was found for them in heaven any longer.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "So the great dragon was thrown down—that ancient serpent, called the Slanderer and the Adversary, the one deceiving the whole inhabited world—he was thrown down to the earth, and his angels were thrown down with him.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Then I heard a loud voice in heaven saying: \"Now the salvation and the power and the kingdom of our God have come, along with the authority of his Messiah! For the accuser of our brothers and sisters—the one who prosecutes them before our God day and night—has been thrown down.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "They have conquered him by the blood of the Lamb and by the word of their testimony, for they did not love their lives even unto death.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Therefore, celebrate, O heavens and you who tent within them! But woe to the earth and the sea, because the devil has come down to you in a great fury, knowing that his time is short.\"",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "When the dragon saw that he had been thrown down to the earth, he pursued the woman who had given birth to the male child.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "But the two wings of the great eagle were given to the woman so that she could fly to her place in the wilderness, where she is nourished for a period, periods, and half a period, away from the serpent’s presence.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Then the serpent spewed water like a river out of his mouth after the woman, to sweep her away in the flood.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But the earth came to the woman’s aid; the earth opened its mouth and swallowed the river that the dragon had spewed from his mouth.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Enraged at the woman, the dragon went off to make war with the rest of her offspring—those who keep the commandments of God and hold to the testimony of Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And he stood on the sand of the seashore.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Victor’s crown\" (v. 1)**: The Greek *stephanos* refers to the laurel wreath or crown given to victors in athletic games or to honored citizens. It is distinct from the *diadēma* (v. 3), which is a crown of royal, often autocratic, authority.\n\n**\"Screaming... agonized\" (v. 2)**: The verb *krazhei* is a loud, piercing cry, and *basanizomenē* refers to being tormented or racked with pain. The imagery emphasizes the extreme intensity of the messianic birth pangs.\n\n**\"Shepherd... with a staff of iron\" (v. 5)**: The Greek *poimainein* literally means \"to shepherd.\" While often translated as \"rule,\" retaining \"shepherd\" preserves the deliberate irony of the Messiah using a shepherd’s tool (a staff) made of unbreakable iron to shatter opposition, alluding to Psalm 2:9.\n\n**\"Slanderer and the Adversary\" (v. 9)**: The Greek *Diabolos* (Devil) means \"Slanderer\" or \"False Accuser,\" while *Satanas* (Satan) is a transliteration of the Hebrew *Satan*, meaning \"Adversary\" or \"Prosecutor.\" Using these descriptive titles helps the reader understand the dragon's functional role in the narrative.\n\n**\"Accuser\" (v. 10)**: The SBLGNT uses the form *katēgōr*, which is a Greek transliteration of a specific Hebrew/Aramaic legal term for a prosecuting accuser. This reflects the \"Aramaic Substratum\" of the author’s thought, viewing the spiritual conflict through the lens of a cosmic courtroom.\n\n**\"Who tent within them\" (v. 12)**: The Greek *skēmountes* means \"to dwell in a tent\" or \"to tabernacle.\" It evokes the wilderness tabernacle of Israel and suggests a communal, albeit temporary, dwelling with God.\n\n**\"Period, periods, and half a period\" (v. 14)**: The word *kairos* means a specific, appointed time or season. This phrase is a direct allusion to the \"time, times, and half a time\" in Daniel 7:25 and 12:7, representing a finite period of suffering.\n\n**\"And he stood\" (v. 18)**: Following the SBLGNT and the oldest manuscript evidence (*estathē*), the dragon is the one standing on the shore, summoning the beasts that follow in chapter 13. Later manuscripts changed this to \"I stood\" (*estathēn*), shifting the focus to the narrator, John."
    },
    {
      "chapter": 13,
      "verses": [
        {
          "verse": 1,
          "text": "And I saw a predatory beast rising out of the sea, having ten horns and seven heads. On its horns were ten royal diadems, and on its heads were names that insulted the honor of God.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "The beast I saw was like a leopard, its feet were like those of a bear, and its mouth was like the mouth of a lion. The Dragon gave the beast his own power, his own throne, and great authority.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "One of its heads appeared as if it had been slaughtered to death, yet its fatal slaughter-wound was healed. The whole world followed the beast in stunned amazement,",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "and they prostrated themselves before the Dragon because he had given authority to the beast. They also prostrated themselves before the beast, saying, “Who is like the beast? And who is able to wage war against it?”",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "The beast was given a mouth speaking arrogant boasts and insults against God’s honor, and it was given authority to act for forty-two months.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "It opened its mouth to hurl insults against God—to insult his name and his dwelling place, that is, those who dwell in heaven.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "It was also permitted to wage war against the holy ones and to conquer them, and it was given authority over every tribe, people, language, and nation.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "All those who live on the earth will prostrate themselves before it—everyone whose name has not been written, from the foundation of the world, in the Book of Life belonging to the Lamb who was slaughtered.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "If anyone has an ear, let them hear:",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "If anyone is destined for captivity, into captivity they go. If anyone is to be killed by the sword, by the sword they must be killed. This calls for the patient endurance and the faithfulness of the holy ones.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then I saw another beast rising out of the earth. It had two horns like a lamb’s, but it spoke like a dragon.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "It exercises all the authority of the first beast on its behalf, and it makes the earth and those who live in it worship the first beast, whose fatal slaughter-wound had been healed.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "It performs great signs, even making fire come down from heaven to earth in the sight of everyone.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "By the signs it was permitted to perform on behalf of the beast, it deceives those who live on the earth, telling them to make a cult-image for the beast that had been wounded by the sword and yet lived.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "The second beast was permitted to give breath to the image of the first beast, so that the image could actually speak and could cause anyone who refused to worship the image of the beast to be put to death.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "It also forces everyone—the small and the great, the rich and the poor, the free and the slave—to be given a branded mark on their right hand or on their forehead,",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "so that no one can buy or sell unless they have the mark: the name of the beast or the number of its name.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Here is the requirement for wisdom: let the one who has insight calculate the number of the beast, for it is the number of a person. Its number is six hundred sixty-six.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Predatory beast\" (v. 1)**: The Greek *thērion* refers to a wild, dangerous animal, distinct from *zōon* (living creature). In a political-apocalyptic context, it evokes the predatory empires of Daniel 7.\n\n**\"Insulted the honor of God / Insults\" (v. 1, 5, 6)**: The Greek *blasphēmia* is often left as \"blasphemy,\" but to the original audience, this specifically meant speech that slanders, defames, or usurps the status and honor of a deity. In the Roman context, claiming divine titles for an emperor was the ultimate *blasphēmia*.\n\n**\"Royal diadems\" (v. 1)**: The Greek *diadēmata* refers to the blue-and-white bands worn by Persian kings and later Hellenistic monarchs as symbols of absolute sovereignty. This is distinct from the *stephanos* (victory wreath).\n\n**\"Slaughtered\" (v. 3, 8)**: The Greek *sphazō* means to butcher or slay, often in a sacrificial context. By using *hōs esphagmenēn* (\"as if slaughtered\") for the beast, the author creates a dark parody of the Lamb (*arnion*) in Revelation 5:6, who was also \"standing as if slaughtered.\"\n\n**\"Prostrated themselves\" (v. 4, 8)**: *Proskuneō* involves the physical act of bowing or falling to the ground. In the first century, this was the standard act of submission to a deity or a deified emperor.\n\n**\"From the foundation of the world\" (v. 8)**: In the Greek syntax, this phrase (*apo katabolēs kosmou*) is placed after \"the Lamb who was slaughtered.\" However, in the broader context of Revelation (cf. 17:8), the author likely intends it to modify the \"writing of the names\" in the book. The translation preserves the ambiguity while leaning toward the predestined nature of the record.\n\n**\"Cult-image\" (v. 14, 15)**: *Eikōn* here refers to a statue or representation used in worship. For the original audience, this would immediately evoke the statues of the Emperor placed in temples throughout Asia Minor.\n\n**\"Breath\" (v. 15)**: The Greek *pneuma* can mean \"spirit,\" but in the context of an image or statue, it refers to the \"breath of life\" or the animating force that makes the inanimate appear alive—a common claim in ancient \"wonder-working\" and temple magic.\n\n**\"Branded mark\" (v. 16, 17)**: *Charagma* was used for official seals, the stamp on coins, or the brand burned into a slave or soldier to indicate ownership. It signifies total allegiance and belonging to the beast’s economic and political system.\n\n**\"Calculate... number of a person\" (v. 18)**: The verb *psēphisatō* means to count with pebbles or compute. This is an explicit invitation to *gematria*, the practice of assigning numerical values to letters. The \"number of a person\" indicates that the code refers to a specific human name (widely understood by historians as *Neron Kaisar*)."
    },
    {
      "chapter": 14,
      "verses": [
        {
          "verse": 1,
          "text": "Then I looked, and behold: the Lamb was standing on Mount Zion, and with him were one hundred forty-four thousand who had his name and his Father’s name written on their foreheads.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And I heard a sound from heaven like the roar of many waters and like the sound of loud thunder; the sound I heard was like lyre-players accompanying themselves on their lyres.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "They were singing what seemed to be a new song before the throne and before the four living creatures and the elders. No one was able to learn that song except the one hundred forty-four thousand—those who had been purchased from the earth.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "These are the ones who have not defiled themselves with women, for they are like celibate priests; these are the ones who follow the Lamb wherever he goes. These were purchased from humanity as a firstfruits offering to God and to the Lamb.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "In their mouth, no lie was ever found; they are without blemish.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Then I saw another angel flying in mid-heaven, having an eternal gospel to proclaim to those who live on the earth—to every nation, tribe, language, and people.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "He said with a loud voice, “Fear God and give him glory, because the hour of his judgment has come! Worship the one who made the heaven, the earth, the sea, and the springs of water.”",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Another angel, a second one, followed him, saying, “Fallen! Fallen is Babylon the Great, she who made all the nations drink the wine of the burning passion of her sexual immorality.”",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Another angel, a third one, followed them, saying with a loud voice, “If anyone worships the beast and its image and receives a mark on their forehead or on their hand,",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "that person will also drink the wine of God’s fury, which has been poured full-strength into the cup of his wrath. They will be tortured with fire and sulfur in the presence of the holy angels and in the presence of the Lamb.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "The smoke of their torture rises forever and ever. There is no rest day or night for those who worship the beast and its image, or for anyone who receives the mark of its name.”",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Here is the call for the endurance of the holy ones—those who keep the commandments of God and the faithfulness of Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "And I heard a voice from heaven saying, “Write this: Blessed are the dead who die in the Lord from now on.” “Yes,” says the Spirit, “so that they may rest from their labors, for the things they have done follow along with them.”",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "Then I looked, and behold: a white cloud, and sitting on the cloud was one like a Son of Man, wearing a golden victory-crown on his head and holding a sharp sickle in his hand.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "Another angel came out of the temple, crying out with a loud voice to the one sitting on the cloud, “Swing your sickle and reap, for the hour to reap has come; the harvest of the earth is over-ripe.”",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "So the one sitting on the cloud swung his sickle over the earth, and the earth was harvested.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Then another angel came out of the temple in heaven, and he also had a sharp sickle.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "Yet another angel came from the altar—the one who has authority over the fire—and he called out with a loud voice to the one who had the sharp sickle, saying, “Swing your sharp sickle and gather the clusters of the vine of the earth, for its grapes are ripe.”",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "The angel swung his sickle into the earth and gathered the vintage of the earth, throwing it into the great winepress of God’s fury.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "The winepress was trodden outside the city, and blood flowed from the winepress as high as the horses' bridles for a distance of sixteen hundred stadia.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Mount Zion\" (v. 1)**: To the original audience, this was the site of the eschatological gathering of the redeemed (Joel 2:32) and the seat of the Davidic King.\n\n**\"Purchased\" (v. 3, 4)**: The Greek *ēgorasthēsan* refers to the commercial transaction of buying a slave, often used in the context of manumission (buying a slave’s freedom). \n\n**\"Like celibate priests\" (v. 4)**: The Greek *parthenoi* (virgins) is used here of men. In a first-century context, this likely alludes to \"holy war\" requirements (where soldiers abstained from sex to remain ritually pure, Deut 23:9-14) or to the purity required for temple service. \"Celibate\" captures the intentionality, and \"priests\" connects it to the cultic \"firstfruits\" and \"without blemish\" imagery that follows.\n\n**\"Firstfruits\" (v. 4)**: The *aparchē* was the portion of the harvest given to God that sanctified the whole. It implies they are the elite or representative portion of the redeemed.\n\n**\"Mid-heaven\" (v. 6)**: *Mesouranēma* refers to the highest point in the sky where the sun reaches its noon zenith—the point where the angel would be most visible and audible to the entire world.\n\n**\"The wine of the burning passion\" (v. 8)**: The Greek *thumos* can mean \"wrath\" or \"intense passion/heat.\" In the context of \"the wine of her sexual immorality,\" it refers to the intoxicating, feverish desire that Babylon (Rome) uses to seduce the nations.\n\n**\"Poured full-strength\" (v. 10)**: The Greek contains a deliberate paradox: *kekerasmenou akratou*—\"mixed unmixed.\" In antiquity, wine was always diluted with water; to drink it \"unmixed\" (*akratos*) was a sign of excess or judgment. Here, the \"mixing\" refers to the preparation of the wine with spices or strength-enhancers, but it is not \"diluted\" with water.\n\n**\"Faithfulness of Jesus\" (v. 12)**: The Greek *pistin Iēsou* can be an objective genitive (\"faith in Jesus\") or a subjective genitive (\"the faithfulness of Jesus\"). Given the context of \"endurance,\" it refers to the believers maintaining the same type of faithfulness that Jesus demonstrated.\n\n**\"Victory-crown\" (v. 14)**: The *stephanos* is the laurel wreath or crown given to a conqueror or an athlete, distinct from the *diadēma* (royal diadem).\n\n**\"Over-ripe\" (v. 15)**: The Greek *exēranthē* literally means \"dried up\" or \"withered,\" indicating a harvest that has passed its peak and must be taken immediately.\n\n**\"Sixteen hundred stadia\" (v. 20)**: A stadium was approximately 600 feet. 1,600 is a symbolic number (4x4x100), representing a judgment that covers the four corners of the land completely. In literal terms, this is about 184 miles, roughly the length of Palestine."
    },
    {
      "chapter": 15,
      "verses": [
        {
          "verse": 1,
          "text": "Then I saw another sign in heaven, great and awe-inspiring: seven angels holding seven plagues. These are the final plagues, because in them the burning wrath of God is brought to its completion.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And I saw what looked like a transparent sea intermingled with fire. Standing beside this transparent sea were those who had emerged victorious from the beast, from its cult-statue, and from the number of its name. They were holding lyres given to them by God,",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "and they sang the song of Moses, the servant of God, and the song of the Lamb: “Great and awe-inspiring are your works, Lord God, the All-Ruler; Righteous and true are your ways, King of the Ages.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Who will not revere you, Lord, and bring glory to your name? For you alone are holy. All the nations will come and worship before you, because your righteous decrees have been revealed.”",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "After this I looked, and the sanctuary of the Tabernacle of Witness in heaven was opened.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Out of the sanctuary came the seven angels who held the seven plagues. They were clothed in pure, radiant linen and wore golden sashes wrapped around their chests.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Then one of the four living beings gave the seven angels seven golden offering-bowls filled with the burning wrath of God, who lives forever and ever.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "The sanctuary was filled with smoke from the glory of God—his heavy radiance—and from his power; no one was able to enter the sanctuary until the seven plagues of the seven angels were completed.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Sign\" (v. 1)**: The Greek *sēmeion* (σημεῖον) denotes a portent or a miraculous signal that points toward a divine reality. In the context of Revelation, these are visionary markers of the unfolding end-times drama.\n\n**\"Burning wrath\" (v. 1, 7)**: The Greek *thumos* (θυμός) differs from *orgē* (settled indignation). *Thumos* suggests a more intense, boiling passion or a \"heat\" of anger. \"Burning wrath\" or \"fury\" captures this volatility.\n\n**\"Brought to its completion\" (v. 1)**: The verb *etelesthē* (ἐτελέσθη) implies more than just ending; it means reaching a state of \"telos\" or the intended goal. God’s judgment is not merely stopping; it is being fulfilled.\n\n**\"Transparent sea\" (v. 2)**: The adjective *hyalinēn* (ὑαλίνην) refers to glass or crystal. In the first century, glass was not perfectly clear as it is today, but often translucent or colored. This \"sea\" evokes the \"molten sea\" of Solomon’s temple and the Red Sea of the Exodus, now transformed into a heavenly, firm floor.\n\n**\"Victorious from\" (v. 2)**: The Greek uses the preposition *ek* (out of/from) with \"conquering\" (*nikōntas*). This suggests they didn't just win a battle, but they emerged as survivors/victors *out of* the sphere of the beast’s influence and persecution.\n\n**\"Cult-statue\" (v. 2)**: While usually translated as \"image\" (*eikonos*), in a first-century Roman context, this specifically refers to the statues of the Emperor used in the imperial cult, which Christians were pressured to worship.\n\n**\"Lyres\" (v. 2)**: The *kithara* (κιθάρα) was a stringed instrument more akin to a lyre than a modern harp. It was associated with formal praise and the Davidic psalms.\n\n**\"All-Ruler\" (v. 3)**: *Pantokratōr* (παντοκράτωρ) is the standard Septuagint translation for *Sabaoth* (Lord of Hosts) or *Shaddai*. It emphasizes God’s absolute sovereignty over all forces, celestial and terrestrial.\n\n**\"King of the Ages\" (v. 3)**: While some manuscripts read \"King of the nations,\" the earliest and best manuscripts (followed by the SBLGNT) read *basileus tōn aiōnōn*. This highlights God’s lordship over time and history itself.\n\n**\"Holy\" (v. 4)**: The word here is *hosios* (ὅσιος) rather than the more common *hagios*. *Hosios* refers to the essential purity, piety, and faithfulness of God’s character.\n\n**\"Righteous decrees\" (v. 4)**: *Dikaiōmata* (δικαιώματά) refers to the concrete expressions of justice—legal requirements, sentences, or righteous acts—rather than the abstract concept of justice.\n\n**\"Sanctuary of the Tabernacle of Witness\" (v. 5)**: *Naos* (ναὸς) refers specifically to the inner shrine or \"Holy of Holies,\" not the general temple precinct (*hieron*). The \"Tabernacle of Witness\" (*skēnēs tou martyriou*) is a direct allusion to the wilderness Tabernacle in the Septuagint (Exodus 38:21), emphasizing that God’s covenantal presence is the source of the coming judgment.\n\n**\"Offering-bowls\" (v. 7)**: *Phialas* (φιάλας) were broad, shallow bowls used for pouring out libations in a ritual context. This links the plagues to the liturgical actions of the temple.\n\n**\"Heavy radiance\" (v. 8)**: The word *doxa* (δόξης, glory) in a biblical context carries the weight of the Hebrew *kabod*, which literally means \"heaviness\" or \"weight.\" The smoke signifies the physical manifestation of God’s overwhelming presence (the *Shekinah*), which precludes human entrance."
    },
    {
      "chapter": 16,
      "verses": [
        {
          "verse": 1,
          "text": "Then I heard a loud voice from the sanctuary saying to the seven angels, “Go and pour out onto the earth the seven libation bowls of God’s fuming fury.”",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "So the first angel went and poured out his bowl onto the earth; and a vicious and agonizing ulcer broke out on the people who bore the mark of the beast and those who bowed down to its image.",
          "paragraphStart": true
        },
        {
          "verse": 3,
          "text": "The second poured out his bowl into the sea; it became coagulated blood like that of a corpse, and every living creature in the sea died.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "The third poured out his bowl into the rivers and the springs of water, and they became blood.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And I heard the angel of the waters saying, “You are just, O Eternal One—the One who is and who was, the Holy One—because you have executed this judgment.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Because they shed the blood of the saints and the prophets, you have given them blood to drink; they have received what they deserved.”",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "And I heard the altar respond, “Yes, Lord God, Sovereign over all, your judgments are true and just.”",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "The fourth angel poured out his bowl upon the sun, and it was permitted to scorch the people with fire.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "The people were burned by the intense heat, and they blasphemed the name of the God who held the sovereignty over these plagues; yet they did not repent so as to give him glory.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "The fifth poured out his bowl upon the throne of the beast, and its kingdom was plunged into darkness. People gnawed their tongues from the agony",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "and blasphemed the God of heaven because of their pains and their ulcers; yet they did not repent of their deeds.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "The sixth poured out his bowl upon the great river Euphrates, and its water was dried up to prepare the way for the kings from the rising of the sun.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Then I saw three foul spirits like frogs coming out of the mouth of the dragon, out of the mouth of the beast, and out of the mouth of the false prophet.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For they are demonic spirits performing miraculous signs, who go out to the kings of the whole inhabited world to mobilize them for battle on the Great Day of God, the Sovereign over all.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "“Look! I am coming like a thief. Blessed is the one who stays alert and keeps his clothes at hand, so that he does not walk around naked and let people see his shameful exposure.”",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "And the spirits gathered the kings to the place called in Hebrew *Har-Magedon*.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "The seventh poured out his bowl into the air. A loud voice came out of the sanctuary from the throne, saying, “It is finished!”",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "There followed flashes of lightning, rumblings, and peals of thunder, and a massive earthquake occurred—such as has never happened since humanity appeared on the earth, so great and mighty was this earthquake.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "The great city was split into three parts, and the cities of the nations fell. God called Great Babylon to mind, giving her the cup filled with the wine of his fierce, fuming fury.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Every island vanished, and mountains could no longer be found.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Huge hailstones, weighing nearly a hundred pounds each, fell from heaven onto the people. And the people blasphemed God because of the plague of hail, for the disaster it brought was exceedingly great.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Sanctuary\" (v. 1, 17)**: The Greek *naos* refers specifically to the inner shrine or the holy precinct where God dwells, rather than the *hieron*, which encompasses the entire temple complex.\n\n**\"Libation bowls\" (v. 1)**: The *phialē* was a shallow, saucer-like vessel used in the Greco-Roman world and the Jewish temple for pouring out drink offerings (libations). The imagery suggests that the wrath of God is being \"offered\" back as a ritual consequence.\n\n**\"Fuming fury\" (v. 1, 19)**: The Greek *thumos* denotes a turbulent, boiling passion or \"burning\" anger, distinguished from *orgē* (settled wrath). When used together in v. 19 (*tou thumou tēs orgēs*), it suggests the outward breaking forth of a long-stored indignation.\n\n**\"Living creature\" (v. 3)**: The Greek *psuchē zōēs* (\"soul of life\") is a Hebraism (from the Septuagint’s *nephesh chayah*) referring to any breathing, living being.\n\n**\"Sovereign over all\" (v. 7, 14)**: *Pantokratōr* is the Greek rendering of the Hebrew *Yahweh Sabaoth* (Lord of Hosts). It implies not just \"Almighty\" power, but the active exercise of universal dominion and governance.\n\n**\"Sovereignty\" (v. 9)**: *Exousia* is more than \"power\" (*dunamis*); it is the legal and moral right to exercise authority. The text emphasizes that God remains the rightful governor even over the plagues that afflict the rebellious.\n\n**\"Whole inhabited world\" (v. 14)**: *Oikoumenē* refers to the civilized world known to the original audience, often used specifically for the Roman Empire, but here extended to the cosmic scope of the gathering against God.\n\n**\"Shameful exposure\" (v. 15)**: The Greek *aschēmosunē* refers to nakedness in a social or cultic sense that brings disgrace. In the first-century context, being caught without one's outer garment was a source of profound public shame.\n\n**\"Har-Magedon\" (v. 16)**: Retained as a transliteration of the Hebrew *Har Megiddo* (Mountain of Megiddo). Megiddo was a strategic site of many historical battles in Israel’s history, symbolizing a final place of decisive judgment.\n\n**\"It is finished\" (v. 17)**: The verb *gegonen* (perfect tense of *ginomai*) literally means \"It has happened\" or \"It has come to pass.\" It signals the completion of God’s decree and the arrival of the end-state of the current age.\n\n**\"Called to mind\" (v. 19)**: The passive *emnēsthē* (\"was remembered\") is a \"divine passive,\" implying that God has now stepped in to act upon the sins he had seemingly overlooked. In biblical idiom, when God \"remembers,\" he acts.\n\n**\"Weighing nearly a hundred pounds\" (v. 21)**: The Greek *talantiaia* means \"the weight of a talent.\" While talent weights varied, the Attic talent was approximately 57 lbs, while others reached nearly 100 lbs. The translation chooses a modern equivalent to convey the terrifying, terminal nature of the hail."
    },
    {
      "chapter": 17,
      "verses": [
        {
          "verse": 1,
          "text": "Then one of the seven angels who held the seven bowls came and spoke with me, saying, “Come, I will show you the sentence passed against the great prostitute who sits enthroned over many waters.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "The kings of the earth have committed sexual infidelity with her, and those who inhabit the earth have become intoxicated with the wine of her prostitution.”",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "He then carried me away in a prophetic trance into a wilderness. There I saw a woman sitting on a scarlet beast that was covered with blasphemous names and had seven heads and ten horns.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "The woman was clothed in purple and scarlet and was gilded with gold, precious stones, and pearls. In her hand she held a golden cup filled with abominations and the ritual impurities of her prostitution.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "On her forehead was written a name with a hidden symbolic meaning: “Babylon the Great, the mother of prostitutes and of the abominations of the earth.”",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "I saw that the woman was drunk—not with wine, but with the blood of God’s holy people and the blood of those who bore witness to Jesus. When I saw her, I was struck with utter amazement.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "But the angel said to me, “Why are you amazed? I will explain to you the hidden symbolic meaning of the woman and of the beast that carries her, the one with the seven heads and ten horns.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "The beast that you saw was, and now is not, and is about to ascend from the Abyss and go to its final destruction. The inhabitants of the earth—those whose names have not been written in the book of life since the foundation of the world—will be astonished when they see the beast, because it was, and is not, and yet will be present.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "This calls for a mind that possesses wisdom: The seven heads are seven mountains on which the woman sits. They are also seven kings.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Five have fallen, one is currently reigning, and the other has not yet come; and when he does come, he must remain for only a little while.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "As for the beast that was and is not, it is an eighth king, yet it belongs to the seven, and it is heading for destruction.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "The ten horns you saw are ten kings who have not yet received a kingdom, but they receive sovereign authority as kings for a single hour along with the beast.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "These kings share a single purpose, and they hand over their power and authority to the beast.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "They will make war against the Lamb, but the Lamb will conquer them because he is Lord of lords and King of kings—and those with him are the called, the chosen, and the faithful.”",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Then he said to me, “The waters you saw, where the prostitute sits enthroned, are peoples and multitudes and nations and languages.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "And the ten horns you saw and the beast—these will come to hate the prostitute. They will leave her desolated and naked; they will devour her flesh and consume her with fire.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For God has put it into their hearts to carry out his purpose by being of one mind and giving their royal sovereignty to the beast until the words of God are fulfilled.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "And the woman you saw is the great city that holds sovereign power over the kings of the earth.”",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Sentence passed\" (v. 1)**: The Greek *krima* refers to the result of a judgment—the verdict or the execution of the sentence—rather than the abstract process of judging.\n\n**\"Prostitute / Prostitution\" (vv. 1, 2, 5)**: The term *pornē* in prophetic literature (following the Septuagint's use of the Hebrew *zanah*) refers to more than literal sex work. It denotes a city or nation that is unfaithful to God through idolatry or a city that sells its influence and luxury to other nations for gain. \"Sexual infidelity\" (v. 2) captures this metaphor of political and religious betrayal.\n\n**\"Prophetic trance\" (v. 3)**: The phrase *en pneumati* (literally \"in spirit\") describes the visionary state of the prophet, similar to being \"in the Spirit\" in Revelation 1:10. It implies a relocation of the consciousness by divine power.\n\n**\"Gilded\" (v. 4)**: *Kechrysōmenē* means to be covered or plated with gold. It suggests an outward display of extreme, almost gaudy, wealth.\n\n**\"Abominations\" (vv. 4, 5)**: *Bdelygmata* is a specific term in the Septuagint for idols and the detestable practices associated with pagan worship. It carries a heavy sense of ritual defilement.\n\n**\"Hidden symbolic meaning\" (vv. 5, 7)**: The Greek *mystērion* does not mean a \"mystery\" in the modern sense of a puzzle to be solved, but a secret truth or a symbolic reality that can only be understood through divine revelation.\n\n**\"Those who bore witness\" (v. 6)**: The Greek *martyrōn* refers to witnesses. While this is the root of the English \"martyr,\" in the first century, the emphasis was on the act of testifying to the truth, even unto death.\n\n**\"The Abyss\" (v. 8)**: *Abyssos* refers to the bottomless deep, understood in Jewish apocalyptic thought as the prison-house of demons and chaotic powers.\n\n**\"Will be present\" (v. 8)**: The Greek *parestai* is a play on the word *parousia* (arrival/presence). The beast mimics the \"coming\" of Christ, appearing as a parody of the one \"who was and is and is to come.\"\n\n**\"Mountains\" (v. 9)**: For a first-century reader, \"seven mountains\" (*hepta orē*) was a ubiquitous shorthand for the city of Rome, famously known as the city on seven hills.\n\n**\"Desolated\" (v. 16)**: *Ērēmōmenēn* means to be turned into a wilderness or a desert. It implies the total stripping of resources and population.\n\n**\"Sovereign power\" (v. 18)**: *Basileia* is usually translated as \"kingdom,\" but in this context, it refers to the exercise of imperial dominion or the right to rule over others."
    },
    {
      "chapter": 18,
      "verses": [
        {
          "verse": 1,
          "text": "After these things, I saw another angel coming down from heaven. He possessed great authority, and the earth was flooded with light from his radiance.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He cried out with a mighty voice, saying: “Fallen! Fallen is Babylon the Great! She has become a haunt for demons, a place of confinement for every unclean spirit, a cage for every unclean bird, and a haunt for every unclean and loathsome beast.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For all the nations have collapsed from the wine of the intoxicating passion of her sexual immorality; the kings of the earth committed immoral acts with her, and the merchants of the earth grew rich from the power of her unrestrained luxury.”",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Then I heard another voice from heaven saying: “Come out of her, my people, so that you do not participate in her sins and so that you do not receive a share of her plagues.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "For her sins have been piled as high as heaven, and God has called to mind her crimes.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Pay her back exactly as she herself paid out; pay her back double for what she has done. In the cup she mixed, mix a double portion for her.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "To the same extent that she glorified herself and lived in arrogant luxury, give her torment and mourning. For in her heart she says, ‘I sit enthroned as a queen; I am no widow, and I will never see mourning.’",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "For this reason, her plagues will come in a single day—death and mourning and famine—and she will be burned up with fire. For strong is the Lord God who has judged her.”",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "The kings of the earth, who committed immoral acts and lived in luxury with her, will weep and wail over her when they see the smoke of her burning.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "They will stand at a distance because of their fear of her torment, saying: “Woe! Woe, O great city! Babylon, the mighty city! In a single hour your judgment has come.”",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And the merchants of the earth weep and mourn over her, because no one buys their cargo anymore—",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "cargo of gold, silver, precious stones, and pearls; fine linen, purple cloth, silk, and scarlet cloth; every kind of citron wood and every object made of ivory; every object made of the costliest wood, bronze, iron, and marble;",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "cinnamon, exotic spice, incense, fragrant ointment, frankincense, wine, olive oil, fine flour, and wheat; cattle, sheep, horses, and carriages; and human bodies—that is, the lives of people.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "The fruit your soul craved has left you, and all your delicacies and splendors have perished from you; people will never find them again.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "The merchants of these things, who grew rich from her, will stand at a distance because of their fear of her torment, weeping and mourning,",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "saying: “Woe! Woe, O great city, clothed in fine linen, purple, and scarlet, and gilded with gold, precious stones, and pearls!",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "In a single hour such vast wealth has been laid waste.” Every shipmaster, every seafarer, sailors, and all who work the sea stood at a distance",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "and cried out as they saw the smoke of her burning, saying: “What city was ever like this great city?”",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "They threw dust on their heads and cried out, weeping and mourning, saying: “Woe! Woe, O great city, in which all who had ships on the sea grew rich from her abundance! In a single hour she has been laid waste.”",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Rejoice over her, O heaven, and you holy ones, apostles, and prophets! For God has executed the judgment against her that she intended for you.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Then a single mighty angel picked up a stone like a huge millstone and hurled it into the sea, saying: “With this kind of violence, Babylon the great city will be thrown down, and she will never be found again.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "The sound of harpists, musicians, flute players, and trumpeters will never be heard in you again; no craftsman of any trade will ever be found in you again; the sound of a millstone will never be heard in you again;",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "the light of a lamp will never shine in you again; and the voice of the bridegroom and bride will never be heard in you again. For your merchants were the tycoons of the earth, and by your sorcery all the nations were led astray.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "And in her was found the blood of prophets and of holy ones, and of all those who have been slaughtered on the earth.”",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Haunt / Place of confinement\" (v. 2)**: The Greek *phylakē* is often translated as \"prison,\" but in this context of a ruined city, it refers to a place where these unclean things are restricted or where they congregate. \"Haunt\" and \"cage\" (for the birds) capture the imagery of a desolate ruin.\n\n**\"Intoxicating passion\" (v. 3)**: The Greek *thymos* can mean \"wrath\" or \"passionate desire.\" Given the pairing with \"wine\" and \"immorality,\" it refers to the heated, driving passion of her seduction, which leads to God's eventual \"wrath.\"\n\n**\"Unrestrained luxury\" (v. 3, 7)**: The term *strēnos* refers to a defiant, insolent kind of luxury—the kind of wealth that leads to arrogance and a rejection of God. \n\n**\"Piled as high as heaven\" (v. 5)**: The verb *ekollēthēsan* literally means \"glued\" or \"welded.\" The image is of sins being stuck together in a massive heap that eventually reaches the heavens.\n\n**\"Human bodies—that is, the lives of people\" (v. 13)**: The Greek text lists *sōmatōn* (bodies) and *psychas anthrōpōn* (souls/lives of humans). In the first century, *sōmata* was a standard technical term for slaves. The author adds \"lives of people\" to emphasize the human cost of Babylon’s commerce; she doesn't just trade goods, but the very essence of human beings.\n\n**\"Fruit your soul craved\" (v. 14)**: Literally, \"the autumn fruit (*opōra*) of the desire of your soul.\" \n\n**\"Executed the judgment against her that she intended for you\" (v. 20)**: The Greek *ekrinen ho theos to krima hymōn ex autēs* is idiomatic. It means God has judged her with the very judgment she had imposed on the believers, or perhaps \"vindicated your cause\" against her.\n\n**\"Tycoons\" (v. 23)**: The Greek *megistanes* refers to the great men, the magnates, or the high-ranking officials. In a commercial context, \"tycoons\" or \"merchant princes\" captures the status these traders held due to Babylon's influence.\n\n**\"Sorcery\" (v. 23)**: The Greek *pharmakeia* refers to the use of drugs, potions, or spells. It suggests that Babylon’s influence wasn't just economic, but a kind of deceptive enchantment or \"drugging\" of the nations to bring them under her sway."
    },
    {
      "chapter": 19,
      "verses": [
        {
          "verse": 1,
          "text": "After these things, I heard what sounded like the roar of a vast multitude in heaven, shouting: “Hallelujah! Salvation and glory and power belong to our God,",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "because his judgments are true and just. He has judged the great prostitute who corrupted the earth with her sexual immorality, and he has exacted vindication for the blood of his servants at her hand.”",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And a second time they shouted: “Hallelujah! The smoke from her goes up forever and ever.”",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Then the twenty-four elders and the four living beings fell down and worshiped God, who is seated on the throne, saying: “Amen! Hallelujah!”",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "And a voice came from the throne, saying: “Give praise to our God, all you his servants, you who fear him, both the small and the great.”",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Then I heard what sounded like the roar of a vast multitude, like the roar of many rushing waters, and like the roar of mighty peals of thunder, shouting: “Hallelujah! For the Lord our God, the All-Ruler, has begun his reign.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Let us rejoice and exult and give him the glory, because the wedding day of the Lamb has come, and his bride has made herself ready.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "It was granted to her to clothe herself in fine linen, bright and pure”—for the fine linen represents the righteous deeds of the holy ones.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And the angel said to me, “Write this: Blessed are those who have been invited to the wedding banquet of the Lamb.” And he said to me, “These are the true words of God.”",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "Then I fell at his feet to worship him, but he said to me, “Do not do that! I am a fellow servant with you and with your brothers and sisters who hold to the testimony of Jesus. Worship God! For the testimony of Jesus is the spirit of prophecy.”",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then I saw heaven standing open, and behold, a white horse! The one sitting on it is called Faithful and True, and in righteousness he judges and makes war.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "His eyes are like a flame of fire, and on his head are many royal diadems. He has a name written on him that no one knows except himself.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "He is clothed in a robe dipped in blood, and the name by which he is called is the Logos of God.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "The armies of heaven, wearing fine linen, white and pure, were following him on white horses.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "From his mouth comes a sharp broadsword with which to strike down the nations, and he will shepherd them with an iron staff. He treads the winepress of the furious wrath of God the All-Ruler.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "And he has a name written on his robe and on his thigh: King of kings and Lord of lords.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Then I saw an angel standing in the sun, and he cried out with a great voice to all the birds flying in mid-heaven: “Come, gather together for the great banquet of God,",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "so that you may eat the flesh of kings, the flesh of commanders, the flesh of the mighty, the flesh of horses and their riders, and the flesh of all people—both free and slave, both small and great.”",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "And I saw the beast and the kings of the earth and their armies gathered to make war against the one sitting on the horse and against his army.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "And the beast was captured, and with it the false prophet who performed the signs in its presence, by which he deceived those who had received the mark of the beast and those who worshiped its image. These two were thrown alive into the lake of fire that burns with sulfur.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "And the rest were killed by the broadsword of the one sitting on the horse—the sword that comes out of his mouth—and all the birds gorged themselves on their flesh.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Hallelujah\" (v. 1, 3, 4, 6)**: This is a transliteration of the Hebrew *halelu-yah* (\"Praise Yahweh\"). Its presence in the Greek text reflects the liturgical language of the early Jewish-Christian community, preserved as a sacred shout of victory.\n\n**\"Exacted vindication... at her hand\" (v. 2)**: The Greek *exedikēsen... ek cheiros autēs* follows a Semitic idiom (Aramaic/Hebrew). It implies not just getting revenge, but holding her legally responsible for the \"debt\" of blood she spilled.\n\n**\"All-Ruler\" (v. 6, 15)**: The Greek *pantokratōr* is often translated \"Almighty,\" but it specifically means \"the one who has his hand on everything\" or \"the Sovereign over all.\" In the context of the Roman Empire, this was a direct counter-claim to the \"totalitarian\" claims of the Caesars.\n\n**\"Has begun his reign\" (v. 6)**: The aorist verb *ebasileusen* is ingressive here, marking the beginning of a new state of affairs—God’s active, manifest sovereignty over the earth.\n\n**\"Righteous deeds\" (v. 8)**: The Greek *dikaiōmata* is plural. While *dikaiosynē* often refers to a state of righteousness or justification, *dikaiōmata* refers to the concrete, outward acts or requirements of justice performed by the \"holy ones\" (saints).\n\n**\"Logos\" (v. 13)**: Retained as a loanword per the guidelines. To a first-century reader, this identified the rider with the divine creative reason of the prologue of the Fourth Gospel and the \"Word of God\" that active in Old Testament judgment and creation.\n\n**\"Royal diadems\" (v. 12)**: The Greek *diadēmata* refers to royal crowns, the symbols of kingship, as opposed to *stephanoi*, which were the laurel wreaths given to victorious athletes or generals.\n\n**\"Broadsword\" (v. 15, 21)**: The Greek *rhomphaia* refers to a large, heavy sword (often Thracian in origin), distinct from the smaller *machaira* (dagger or short sword). It emphasizes the overwhelming and devastating nature of the judgment.\n\n**\"Shepherd them with an iron staff\" (v. 15)**: This alludes to Psalm 2:9. The Greek *poimanei* (\"he will shepherd\") is used ironically here; instead of the gentle care of a shepherd, the \"rod\" or \"staff\" is made of iron, signifying an unbreakable rule.\n\n**\"Mid-heaven\" (v. 17)**: The Greek *mesouranēmati* refers to the highest point of the sky, the zenith, where the sun is at noon and anything appearing there would be visible to all."
    },
    {
      "chapter": 20,
      "verses": [
        {
          "verse": 1,
          "text": "And I saw a messenger descending from the heavens, holding the key to the Abyss and a great chain in his hand.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "He seized the dragon—that ancient serpent, who is the Slanderer and the Adversary—and bound him for a thousand years.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "He threw him into the Abyss, then shut and sealed it over him, so that he could no longer lead the nations astray until the thousand years were completed. After these things, he must be released for a short time.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Then I saw thrones, and those who sat on them were entrusted with the authority to judge. I also saw the souls of those who had been executed by the axe because of their testimony about Jesus and because of the word of God. These are the ones who had not worshiped the beast or its image and had not received its brand on their foreheads or their hands. They came to life and reigned with the Christ for a thousand years.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "(The rest of the dead did not come to life until the thousand years were completed.) This is the first resurrection.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Favored and holy is the one who shares in the first resurrection! Over these, the second death has no authority, but they will be priests of God and of the Christ, and they will reign with him for the thousand years.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "When the thousand years are completed, the Adversary will be released from his prison",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "and will go out to lead astray the nations at the four corners of the earth—Gog and Magog—to mobilize them for battle. Their number is like the sand of the sea.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "They marched up across the broad plain of the earth and encircled the encampment of the holy ones and the beloved city. But fire came down from heaven and devoured them.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And the Slanderer, who had been leading them astray, was thrown into the lake of fire and sulfur where the beast and the false prophet were, and they will be tormented day and night into the ages of ages.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Then I saw a great white throne and the one seated upon it. From his presence the earth and the heavens fled away, and no place was found for them.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "And I saw the dead, the great and the small, standing before the throne, and scrolls were opened. Then another scroll was opened, which is the Scroll of Life. The dead were judged by what was written in the scrolls, according to their deeds.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "The sea gave up the dead that were in it, and Death and Hades gave up the dead that were in them, and each person was judged according to their deeds.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Then Death and Hades were thrown into the lake of fire. This—the lake of fire—is the second death.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "And if anyone’s name was not found written in the Scroll of Life, they were thrown into the lake of fire.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"The Abyss\" (v. 1, 3)**: The Greek *abyssos* evokes the primordial deep of Genesis 1, which in the Second Temple Jewish worldview (e.g., 1 Enoch) became the designated prison for fallen celestial beings. Translating it as \"bottomless pit\" captures the depth but loses the cosmological connection to the \"deep.\"\n\n**\"Slanderer and the Adversary\" (v. 2)**: The Greek *Diabolos* means \"the Slanderer\" or \"the Accuser,\" while *Satanas* is a transliteration of the Hebrew *Satan*, meaning \"the Adversary.\" Using these descriptive titles restores the legal and functional roles these names played for the original audience.\n\n**\"Executed by the axe\" (v. 4)**: The Greek *pepeleksimenōn* is highly specific, referring to the *pelekys* or the Roman *fasces* (the axe-and-rod symbol of magistrate authority). It denotes a formal state execution, specifically beheading, which was the Roman punishment for citizens.\n\n**\"The Christ\" (v. 4, 6)**: The Greek includes the definite article (*tou christou*). In the first century, *Christos* was not a last name but a title—\"the Anointed One\"—referring to the Messianic King of Israel.\n\n**\"The second death\" (v. 6, 14)**: This is a technical term found in the Aramaic Targums (Jewish paraphrases of the Hebrew Bible) of the period. It refers specifically to the final, permanent death of the soul in the age to come, as distinct from the first, physical death.\n\n**\"Hades\" (v. 13-14)**: In the 1st-century context, Hades is the Greek equivalent of the Hebrew *Sheol*—the temporary, intermediate realm of the dead, both righteous and unrighteous. It is distinct from the \"lake of fire\" (the final destination), which is why Hades itself is eventually cast into the lake of fire.\n\n**\"Scroll\" (v. 12, 15)**: The Greek *biblion* refers to a papyrus or parchment scroll, the standard medium for legal records and literature in the first century. \"Book\" can imply a modern codex, whereas \"scroll\" better captures the visual of a record being unrolled for judgment."
    },
    {
      "chapter": 21,
      "verses": [
        {
          "verse": 1,
          "text": "Then I saw a fresh heaven and a fresh earth; for the first heaven and the first earth had passed away, and the sea—the realm of chaos—was no more.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "And I saw the holy city, New Jerusalem, descending out of heaven from God, prepared like a bride adorned for her husband.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And I heard a loud voice from the throne saying, “Look! God’s dwelling-tent is now among human beings. He will pitch his tent among them, and they will be his peoples. God himself will be with them as their God.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "He will blot out every tear from their eyes. Death will be no more; neither will there be mourning, nor wailing, nor pain anymore. The former things have passed away.”",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Then the one seated on the throne said, “Look! I am making all things new.” And he said, “Write this down, because these words are trustworthy and true.”",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "And he said to me, “It is finished! I am the Alpha and the Omega, the Beginning and the End. To the one who thirsts, I will give water from the spring of the water of life as a gift.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "The one who emerges victorious will inherit these things; I will be God to him, and he will be a son to me.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But as for the cowardly, the faithless, the detestable, the murderers, the sexually immoral, the practitioners of magic potions, the idol-worshipers, and all who are liars—their portion is in the lake that burns with fire and sulfur, which is the second death.”",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Then one of the seven angels who held the seven bowls filled with the seven final plagues came and spoke with me, saying, “Come, I will show you the bride, the wife of the Lamb.”",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "And he carried me away in a Spirit-led trance to a great and high mountain, and he showed me the holy city Jerusalem, descending out of heaven from God.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "It possessed the radiance of God. Its brilliance was like a most precious stone, like a crystal-clear jasper.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "It had a great, high wall with twelve gates, and twelve angels were at the gates. Names were inscribed on them, which are the names of the twelve tribes of the sons of Israel.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "There were three gates on the east, three gates on the north, three gates on the south, and three gates on the west.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "The wall of the city had twelve foundation stones, and on them were the twelve names of the twelve apostles of the Lamb.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "The one speaking with me had a gold measuring rod to measure the city, its gates, and its wall.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "The city is laid out as a square; its length is as great as its width. He measured the city with the rod at twelve thousand stadia; its length, width, and height are equal.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "He also measured its wall: one hundred forty-four cubits by a human measurement, which the angel was using.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "The structure of its wall was jasper, and the city was pure gold, clear as transparent glass.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "The foundation stones of the city wall were adorned with every kind of precious stone: the first foundation stone was jasper, the second sapphire, the third chalcedony, the fourth emerald,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "the fifth sardonyx, the sixth carnelian, the seventh chrysolite, the eighth beryll, the ninth topaz, the tenth chrysoprase, the eleventh hyacinth, and the twelfth amethyst.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "The twelve gates were twelve pearls; each individual gate was made of a single pearl. And the broad plaza of the city was pure gold, like transparent glass.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "I saw no sanctuary in the city, for the Lord God, the Ruler of All, is its sanctuary—as is the Lamb.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "The city has no need of the sun or the moon to shine on it, for the radiance of God illuminated it, and its lamp is the Lamb.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "The nations will walk by means of its light, and the kings of the earth will bring their glory into it.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Its gates will never be closed by day—and there will be no night there.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "They will bring the glory and the honor of the nations into it.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "But nothing profane, nor anyone who practices detestable things or falsehood, will ever enter it—only those who have been written in the Lamb’s Book of Life.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Fresh\" (v. 1, 2, 5)**: The Greek *kainos* denotes something new in quality or nature, rather than simply new in time (*neos*). It suggests a renewal or a superior replacement of the old, rather than just a chronological successor.\n\n**\"The sea—the realm of chaos\" (v. 1)**: For the original audience, the sea (*thalassa*) was often a symbol of the primeval chaos, the abyss, and the source of the beastly powers that oppose God (cf. Daniel 7, Revelation 13). Its absence signifies the total removal of chaos and the threat of evil.\n\n**\"Dwelling-tent\" / \"Pitch his tent\" (v. 3)**: The Greek *skēnē* (noun) and *skēnōsei* (verb) are direct allusions to the Tabernacle of the Hebrew Scriptures. In a Jewish context, this also evokes the *Shekhinah*—the localized, indwelling presence of God.\n\n**\"Peoples\" (v. 3)**: The SBLGNT uses the plural *laoi* (peoples). While many traditional translations use the singular \"people,\" the plural reflects the inclusive nature of the New Jerusalem, where all nations and ethnic groups become God’s own.\n\n**\"Blot out\" (v. 4)**: *Exaleipsō* means to wipe away or erase, often used of washing off ink from papyrus. It suggests the total removal of the record of sorrow.\n\n**\"Practitioners of magic potions\" (v. 8)**: *Pharmakois* refers to those who deal in *pharmakeia*. In the first century, this involved the use of drugs for spells, poisoning, or ritual sorcery. \"Sorcerers\" is the traditional rendering, but \"practitioners of magic potions\" captures the medicinal/chemical element of the Greek term.\n\n**\"Spirit-led trance\" (v. 10)**: *En pneumati* (literally \"in spirit\") refers to the prophetic state of being, where the author is transported by the Holy Spirit into a visionary experience.\n\n**\"Radiance\" / \"Luminary\" (v. 11, 23)**: *Phōstēr* (v. 11) refers to a light-bearing body or the radiance it emits. It is the same word used in the Septuagint for the sun and moon in Genesis 1.\n\n**\"Twelve thousand stadia\" (v. 16)**: A *stadion* was approximately 600 feet. Twelve thousand stadia is roughly 1,400 miles. The key significance is the number 12 (the number of God's people) and the fact that the city is a perfect cube, the same shape as the Holy of Holies in the Temple.\n\n**\"Sanctuary\" (v. 22)**: *Naos* refers specifically to the inner temple, the dwelling place of the deity, rather than the *hieron* (the entire temple complex). The city has no need for a restricted sacred space because the entire city has become the Holy of Holies.\n\n**\"Profane\" (v. 27)**: *Koinon* literally means \"common.\" In a cultic or religious sense, it means something that is ritually \"unclean\" or has not been set apart for God."
    },
    {
      "chapter": 22,
      "verses": [
        {
          "verse": 1,
          "text": "Then he showed me a river of the water of life, sparkling like crystal, flowing from the throne of God and of the Lamb",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "through the middle of the city’s main street. On either side of the river stood the tree of life, producing twelve kinds of fruit, yielding its fruit every month; and the leaves of the tree were for the healing of the nations.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "And every accursed thing will exist no longer. The throne of God and of the Lamb will be in the city, and his bondservants will offer him cultic worship.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "They will see his face, and his name will be on their foreheads.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Night will exist no more; they have no need for the light of a lamp or the light of the sun, because the Lord God will shine upon them, and they will reign forever and ever.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Then he said to me, “These words are faithful and true. The Lord, the God of the spirits of the prophets, has sent his messenger to show his bondservants what must take place without delay.”",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "“And look! I am coming quickly. Blessed is the one who keeps the words of the prophecy of this book.”",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "I, John, am the one who heard and saw these things. And when I heard and saw them, I fell down to worship at the feet of the messenger who showed them to me.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "But he said to me, “Don’t do that! I am a fellow servant with you, with your brothers the prophets, and with those who keep the words of this book. Worship God!”",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Then he told me, “Do not seal up the words of the prophecy of this book, for the time is near.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "Let the one who does wrong continue to do wrong; let the filthy one continue to be filthy; let the righteous one continue to practice righteousness; and let the holy one continue to be kept holy.”",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "“Look! I am coming quickly, and my reward is with me, to pay back each person according to what they have done.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "I am the Alpha and the Omega, the First and the Last, the Beginning and the End.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Blessed are those who wash their robes, so that they may have the right to the tree of life and may enter the city by its gates.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Outside are the dogs, the sorcerers, the sexually immoral, the murderers, the idolaters, and everyone who loves and practices falsehood.”",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "“I, Jesus, have sent my messenger to testify these things to you for the sake of the churches. I am the Root and the descendant of David, the bright morning star.”",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "Both the Spirit and the Bride say, “Come!” And let the one who hears say, “Come!” And let the one who is thirsty come; let the one who desires it take the water of life as a free gift.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "I testify to everyone who hears the words of the prophecy of this book: if anyone adds to them, God will add to him the plagues described in this book;",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "and if anyone takes away from the words of the book of this prophecy, God will take away his share of the tree of life and of the holy city, which are described in this book.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "The one who testifies to these things says, “Yes, I am coming quickly.” Amen. Come, Lord Jesus!",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "The grace of the Lord Jesus be with all.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Main street\" (v. 2)**: The Greek *plateia* refers to a broad, open street or public square. In the context of the New Jerusalem, it suggests the primary thoroughfare where the community gathers.\n\n**\"Tree of life\" (v. 2)**: The Greek *xylon* literally means \"wood\" or \"timber,\" but in the Septuagint and the New Testament, it is frequently used for a living tree (echoing Genesis 2:9). The description of the tree being on \"either side\" of the river suggests either a grove of trees or a singular life-giving reality that spans the water.\n\n**\"Accursed thing\" (v. 3)**: The Greek *katathema* refers to something devoted to destruction or a curse. It evokes the Hebrew *herem* (the \"ban\" or things set apart for divine judgment). Its removal signals the total reversal of the Fall and the end of Zechariah 14:11's \"curse.\"\n\n**\"Cultic worship\" (v. 3)**: The verb *latreuō* refers specifically to the service and worship offered to a deity, often in a priestly or ritual context. It is more specific than general service (*douleuō*).\n\n**\"Messenger\" (v. 6, 8, 16)**: While traditionally translated as \"angel,\" the Greek *angelos* simply means \"messenger.\" Given the book's emphasis on the communication of a divine revelation, \"messenger\" preserves the functional role of the figure.\n\n**\"Without delay\" (v. 6)**: The phrase *en tachei* is often translated \"soon,\" but in Greek, it carries a sense of speed or \"with haste.\" It suggests that once the events begin, they will proceed rapidly to their conclusion.\n\n**\"Let the filthy one continue...\" (v. 11)**: This difficult verse uses imperatives (*rhypareuthētō*, etc.). To a first-century reader, this wasn't an encouragement to sin, but a rhetorical device emphasizing the fixity of character at the moment of the end. The window for change is closing; what one has become is what one will be.\n\n**\"Dogs\" (v. 15)**: In the first-century Mediterranean world, \"dogs\" (*kynes*) were not pets but scavengers. In Jewish idiom, the term was a pejorative for the ritually impure, the lawless, or those outside the covenant (cf. Philippians 3:2).\n\n**\"Sorcerers\" (v. 15)**: The Greek *pharmakoi* refers to those who use drugs, potions, or spells. It encompasses the occult and the manipulation of the divine through \"medicine\" or magic.\n\n**\"Washing their robes\" (v. 14)**: The SBLGNT, following the earliest manuscripts (Codex Sinaiticus and Alexandrinus), reads \"wash their robes\" (*plynontes tas stolas autōn*) rather than \"keep the commandments\" (*poiountes tas entolas autou*), which is found in later manuscripts and the Textus Receptus."
    }
  ]
}