{
  "book": "Romans",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul, a slave of Christ Jesus, called to be an emissary, set apart for God’s good news—",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "the news he promised beforehand through his prophets in the Holy Scriptures",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "regarding his Son. On the level of human descent, he was born from the seed of David;",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "on the level of the Spirit of holiness, he was powerfully designated as the Son of God by his resurrection from the dead: Jesus Christ our Lord.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Through him we received grace and a commission as an emissary to bring about the obedience that springs from faith among all the nations for the sake of his name,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "among whom you also are called to belong to Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "To all those in Rome who are loved by God and called to be his holy people: Grace to you and peace from God our Father and the Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "First, I thank my God through Jesus Christ for all of you, because your faith is being reported throughout the whole world.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "For God is my witness—whom I serve with my whole spirit in the work of the good news of his Son—how constantly I make mention of you.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Always in my prayers I am pleading that somehow, by God’s will, I may at last succeed in coming to you.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For I long to see you, so that I may share some spiritual gift with you to make you strong—",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "that is, that we may be mutually encouraged by each other’s faith, both yours and mine.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "I do not want you to be unaware, brothers and sisters, that I have often intended to come to you (though I have been prevented until now), in order that I might reap some harvest among you just as I have among the rest of the nations.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "I am in debt to both Greeks and foreigners, to both the wise and the simple-minded.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "So, for my part, I am eager to announce the good news to you also who are in Rome.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For I am not ashamed of the good news, for it is the power of God resulting in salvation for everyone who believes—to the Jew first, and also to the Greek.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "For in it the righteousness of God is being unveiled from faith to faith, just as it is written: *The one who is righteous by faith shall live.*",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For the wrath of God is being unveiled from heaven against all the godlessness and injustice of people who suppress the truth by their injustice.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "This is because what can be known about God is plain within them, for God has made it plain to them.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Ever since the creation of the world, his invisible attributes—his eternal power and divine nature—have been clearly perceived through the things he has made. As a result, they are without excuse.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For although they knew God, they did not honor him as God or give him thanks. Instead, they became futile in their reasonings, and their senseless hearts were darkened.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Claiming to be wise, they became fools,",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "and they exchanged the glory of the incorruptible God for the likeness of an image of corruptible humans, birds, four-footed animals, and reptiles.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Therefore, God handed them over in the cravings of their hearts to impurity, so that their bodies would be dishonored among themselves.",
          "paragraphStart": true
        },
        {
          "verse": 25,
          "text": "They exchanged the truth of God for \"The Lie,\" and they worshiped and served the creation rather than the Creator, who is blessed forever. Amen.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "Because of this, God handed them over to degrading passions. Their females exchanged natural sexual function for that which is contrary to nature.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "In the same way, the males also abandoned natural sexual function with females and were consumed by their intense desire for one another, males committing shameless acts with males and receiving in their own persons the inevitable penalty for their wandering.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "And just as they did not see fit to acknowledge God, God handed them over to a mind that failed the test, to do things that are not proper.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "They are filled with every kind of injustice, wickedness, greed, and malice. They are full of envy, murder, strife, deceit, and craftiness. They are gossips,",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "slanderers, God-haters, insolent, arrogant, braggarts, inventors of evil, disobedient to parents,",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "senseless, faithless, heartless, and merciless.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Although they fully know God’s righteous decree—that those who practice such things deserve death—they not only do them, but also give their approval to those who practice them.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Slave\" (v. 1)**: The Greek *doulos* describes a person owned by a master. While \"servant\" is a common polite translation, it fails to capture the 1st-century reality of total belonging and lack of autonomy that Paul is claiming in relation to Jesus.\n\n**\"Emissary\" (v. 1, 5)**: *Apostolos* refers to a sent messenger with the delegated authority of the sender. \"Emissary\" captures this formal, commissioned status better than \"apostle,\" which has become a specialized religious title.\n\n**\"Designated\" (v. 4)**: The Greek *horisthentos* (from which we get \"horizon\") means to mark out a boundary or determine. Paul is not saying Jesus *became* the Son of God at the resurrection, but that the resurrection definitively marked him out or \"installed\" him in power as such in the eyes of the world.\n\n**\"Obedience that springs from faith\" (v. 5)**: This translates the genitive *hypakoēn pisteōs*. It is not just \"obeying a set of rules,\" but the specific type of life-allegiance that is produced by trust/faith in the Messiah.\n\n**\"The righteousness of God\" (v. 17)**: *Dikaiosynē theou* refers to God's own character, his covenant faithfulness, and his judicial act of putting the world right. \n\n**\"From faith to faith\" (v. 17)**: This captures the Greek *ek pisteōs eis pistin*. It suggests that the entire process—from God’s faithfulness to the believer’s response—is characterized by \"faith/trust.\"\n\n**\"The Lie\" (v. 25)**: The Greek uses the definite article (*tō pseudei*). This likely refers to the fundamental lie of idolatry: that the creation is the source of life rather than the Creator.\n\n**\"Natural sexual function\" (vv. 26-27)**: The Greek *chrēsis* refers to \"use\" or \"function.\" In the context of the 1st-century Jewish-Hellenistic world, *physikos* (natural) referred to the order of creation established in Genesis. Paul is framing his argument around the reversal of the creation order (humans worshipping animals, gender roles reversed).\n\n**\"A mind that failed the test\" (v. 28)**: Paul uses a wordplay here. The people \"did not see fit\" (*edokimasan*) to acknowledge God, so God gave them over to a \"worthless\" or \"failed\" (*adokimon*) mind. The translation \"failed the test\" attempts to preserve this connection.\n\n**\"Faithless, heartless\" (v. 31)**: The Greek *asynthetous* (faithless/covenant-breakers) and *astorgous* (without natural family affection) are part of a rhythmic list of \"a-\" privative words in Greek (*asynetous, asynthetous, astorgous, aneleēmonas*) that emphasize the privation of human virtue."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, you have no legal defense, O man—every one of you who sits in judgment. For in the very act of judging another, you are condemning yourself, because you who judge are practicing the same things.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Now we know that God’s judgment is based on the reality of the situation against those who practice such things.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Do you reckon this, O man—you who judge those practicing such things and yet do them yourself—that you will escape the judgment of God?",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Or do you look down on the wealth of his kindness, his tolerance, and his long-suffering patience, unaware that God’s kindness is meant to lead you toward a change of heart?",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But because of your stubbornness and your unrepentant heart, you are storing up for yourself a reserve of wrath on the day of wrath, when the righteous judgment of God will be fully revealed.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "He will repay each person according to what they have done:",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "to those who, with persistence in good work, seek glory, honor, and incorruptibility, he will give eternal life;",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "but for those who act out of selfish ambition and are disobedient to the truth while obeying unrighteousness, there will be wrath and fury.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "There will be crushing distress and anguish for every human soul who produces what is evil—for the Jew first, and also for the Greek—",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "but glory, honor, and peace for everyone who works what is good, for the Jew first, and also for the Greek.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For God shows no favoritism based on status.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For all who have sinned without the Law will also perish without the Law, and all who have sinned under the Law will be judged by the Law.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "For it is not the hearers of the Law who are righteous before God, but the doers of the Law who will be vindicated.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For whenever the Gentiles, who do not possess the Law, do by natural inclination what the Law requires, they are a law to themselves even though they do not have the Law.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "They demonstrate that the work required by the Law is written on their hearts, while their conscience bears joint witness, and their conflicting thoughts either accuse or even defend them",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "on the day when, according to my good news, God judges the secrets of humanity through Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "But if you call yourself a “Jew” and rely on the Law and boast in God,",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "and if you know his will and can distinguish what is essential because you are instructed by the Law;",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "and if you are confident that you are a guide to the blind, a light to those in darkness,",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "a disciplinarian of the foolish, and a teacher of infants—possessing in the Law the very embodiment of knowledge and truth—",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "then you, the one teaching another, do you not teach yourself? You who preach against stealing, do you steal?",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "You who say one must not commit adultery, do you commit adultery? You who abhor idols, do you rob their temples?",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "You who boast in the Law, do you dishonor God by breaking the Law?",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "As it stands written: “The name of God is slandered among the Gentiles because of you.”",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Circumcision is indeed beneficial if you practice the Law; but if you are a law-breaker, your circumcision has become uncircumcision.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "So, if the uncircumcised man keeps the righteous requirements of the Law, will not his uncircumcision be counted as circumcision?",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Then the man who is physically uncircumcised but fulfills the Law will judge you—the one who, despite having the written code and circumcision, is a law-breaker.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "For a person is not a Jew by outward appearance, nor is circumcision something merely visible in the flesh.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Rather, a person is a Jew in secret, and circumcision is a matter of the heart—by the Spirit, not by the written letter. Such a person’s praise comes not from human beings, but from God.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"No legal defense\" (v. 1)**: The Greek *anapologētos* is a legal term. It refers to someone who lacks a valid defense in a court of law.\n\n**\"Based on the reality of the situation\" (v. 2)**: The phrase *kata alētheian* (according to truth) in this context suggests that God’s judgment is not based on labels or ethnic status (like \"Jew\" or \"Greek\") but on the actual facts of a person's life.\n\n**\"Selfish ambition\" (v. 8)**: *Eritheia* refers to a self-seeking, mercenary, or factional spirit. In a first-century context, it often described those who sought office for personal gain.\n\n**\"Favoritism based on status\" (v. 11)**: *Prosōpolēmpsia* literally means \"lifting up the face.\" It refers to the ancient practice of a judge looking up to see who a person was before deciding a case, thereby showing partiality to the wealthy or powerful.\n\n**\"Vindicated\" (v. 13)**: *Dikaiōthēsontai* is often translated \"justified,\" but in this forensic (legal) context, it means to be declared righteous or acquitted by the judge.\n\n**\"Natural inclination\" (v. 14)**: *Physei* (by nature) refers to the internal disposition or the inherent constitution of a person, contrasting with an external written code.\n\n**\"Rob their temples\" (v. 22)**: *Hierosyleis* literally means \"temple-robbing.\" While Jews abhorred idols, some were apparently involved in the illicit trade of gold or goods taken from pagan temples, an act that ancient readers would see as hypocritical and sacrilegious.\n\n**\"Written letter\" (v. 29)**: *Gramma* refers to the written code. Paul is contrasting the internal work of the Spirit with the external, written requirements of the Mosaic Law.\n\n**\"Praise\" (v. 29)**: There is a wordplay here that a first-century Jewish reader would recognize. The name \"Judah\" (*Yehudah*, the root of \"Jew\") is derived from the Hebrew word for \"praise.\" Paul is saying that a true \"Judahite\" (Jew) is one whose \"praise\" (*epainos*) comes from God."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "What, then, is the distinct advantage of being a Jew, or what is the benefit of circumcision?",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "It is great in every respect. To begin with, they were entrusted with the very oracles of God—his own divine utterances.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "What if some were unfaithful? Does their lack of faithfulness nullify the faithfulness of God?",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Absolutely not! Let God be proven true, even if every human being is a liar, just as it is written: *So that you may be shown to be just in your words and prevail when you are brought to judgment.*",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "But if our injustice serves to confirm God’s justice, what shall we say? That God is unjust to inflict his wrath? (I am speaking from a purely human perspective).",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "Absolutely not! Otherwise, how could God judge the world?",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "But if by my lie God’s truthfulness overflowed to his glory, why am I still being judged as a sinner?",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "And why not say—as we are slandered and as some claim we say—“Let us do evil so that good may come”? The condemnation of such people is well-deserved.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "What follows then? Are we Jews any better off? Not at all. For we have already made the charge that all people, both Jews and Greeks, are under the power of sin.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "As it is written: *There is no one who is just, not even one;",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "there is no one who understands; there is no one who seeks out God.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "All have turned away; they have become collectively worthless. There is no one who practices kindness, not so much as one.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Their throat is an opened grave; they use their tongues to deceive; the venom of vipers is under their lips.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Their mouth is full of cursing and bitterness.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Their feet are swift to shed blood;",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "ruin and misery are in their paths,",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "and the path of peace they have not known.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "There is no fear of God before their eyes.*",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Now we know that whatever the Law says, it speaks to those who are within the sphere of the Law, so that every mouth may be silenced and the whole world may become accountable to God’s judgment.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "This is because no human being will be set right in his sight by \"works of the Law\"; for through the Law comes the full recognition of sin.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "But now, apart from the Law, God’s way of setting things right has been revealed—a justice that the Law and the Prophets themselves testify to.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "This is the justice of God through the faithfulness of Jesus Christ for all who believe. For there is no distinction:",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "for all have sinned and fall short of the glory of God,",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "and are being set right as a free gift by his grace through the ransom-redemption that is in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "God put him forward as a place of atonement, effective through faithfulness, by his blood. This was to demonstrate his justice, because in his divine restraint he had passed over the sins previously committed.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "It was for the demonstration of his justice in the present time, so that he himself might be just and the one who sets right the person who lives by the faithfulness of Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "Where then is the boasting? It is shut out. Through what kind of law? A law of works? No, but through a law of faith.",
          "paragraphStart": true
        },
        {
          "verse": 28,
          "text": "For we conclude that a person is set right by faith apart from the \"works of the Law.\"",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "Or is God the God of Jews only? Is he not also the God of the nations? Yes, of the nations too,",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "since there is only one God, who will set right the circumcised on the basis of faith and the uncircumcised through that same faith.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "Do we then nullify the Law through faith? Absolutely not! On the contrary, we uphold the Law.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Oracles\" (v. 2)**: The Greek *logia* refers to divine utterances or sacred sayings. In the first century, this specifically evoked the Hebrew Scriptures as the living voice of God, not just a historical record.\n\n**\"The faithfulness of God / the faithfulness of Jesus\" (vv. 3, 22, 26)**: The Greek *pistis* can mean \"faith\" (belief/trust) or \"faithfulness\" (fidelity/reliability). In v. 3, it clearly refers to God’s own fidelity to his covenant. In vv. 22 and 26, the phrase *pistis Iēsou Christou* uses a genitive construction that can be understood as the \"faithfulness of Jesus\" (his subjective obedience) or \"faith in Jesus\" (the believer's objective trust). Given the context of God's own faithfulness being the theme of the chapter, \"faithfulness of Jesus\" is retained to show how Christ’s own fidelity fulfills God's covenant promises, which then invites the response of \"those who believe.\"\n\n**\"May it never be / Absolutely not\" (vv. 4, 6, 31)**: *Mē genoito* is the strongest Greek negation, often used by Paul to dismiss a logical absurdity. \"God forbid\" is a traditional but archaic rendering; \"Absolutely not\" or \"Impossible\" captures the rhetorical force.\n\n**\"Set right / Justice\" (vv. 5, 20-22, 24-26)**: The *dik-* word group (*dikaiosynē*, *dikaioō*) is often translated as \"righteousness\" and \"justify.\" However, in a first-century context, these are legal and covenantal terms. \"Justice\" and \"setting right\" capture the sense of a judge restoring a right relationship or making a correct verdict, which is Paul's primary metaphor here.\n\n**\"Works of the Law\" (vv. 20, 28)**: *Erga nomou* refers specifically to the deeds required by the Mosaic Torah—often those that functioned as \"boundary markers\" for the Jewish people (like circumcision and dietary laws) in the Second Temple period.\n\n**\"Ransom-redemption\" (v. 24)**: *Apolytrōsis* refers to a release secured by the payment of a ransom, such as the freeing of a slave or a prisoner of war.\n\n**\"Place of atonement\" (v. 25)**: The Greek *hilastērion* is the word used in the Septuagint (LXX) for the \"mercy seat\" or the lid of the Ark of the Covenant where blood was sprinkled on the Day of Atonement. Paul is identifying Jesus as the physical location where God’s justice and mercy meet to deal with sin.\n\n**\"Passed over\" (v. 25)**: The Greek *paresis* is a legal term for \"suspension\" or \"passing over\" a debt or penalty, distinct from *aphesis* (complete dismissal or forgiveness). Paul's point is that God had delayed the full penalty for sins until the work of Christ."
    },
    {
      "chapter": 4,
      "verses": [
        {
          "verse": 1,
          "text": "What then shall we say that Abraham, our forefather according to natural human descent, has discovered?",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For if Abraham was placed in right standing based on his own works, he has something to boast about—but not before God.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For what does the Scripture say? “Abraham put his trust in God, and it was credited to his account as righteousness.”",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Now to the one who works, the wage is not credited as a gift of grace, but as a debt owed.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "But to the one who does not work, but instead puts their trust in the one who declares the irreverent to be in the right, their faith is credited to their account as righteousness.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Just as David also speaks of the blessing upon the person to whom God credits righteousness apart from works:",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "“Blessed are those whose lawless acts are forgiven and whose sins are covered over;",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "blessed is the man whose sin the Lord will never take into account.”",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Is this blessing, then, only for the circumcised, or also for the uncircumcised? For we are saying, “His faith was credited to Abraham as righteousness.”",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "How then was it credited? While he was in a state of circumcision, or uncircumcision? It was not in circumcision, but in uncircumcision.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And he received the sign of circumcision as a seal of the righteousness of the faith he had while still uncircumcised. This was so that he might be the father of all who believe while uncircumcised, so that righteousness might be credited to their account as well,",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "and also the father of the circumcised—not just to those who are circumcised, but to those who also walk in the tracks of the faith our father Abraham had before he was circumcised.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For the promise to Abraham or to his offspring that he would be heir of the world did not come through the law, but through the righteousness of faith.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "For if those who hold to the law are the heirs, faith has been emptied of its meaning and the promise has been nullified.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For the law brings about wrath; but where there is no law, there is no violation.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "For this reason, the promise depends on faith, so that it may rest on grace and be guaranteed to all the offspring—not only to those of the law, but also to those of the faith of Abraham, who is the father of us all.",
          "paragraphStart": true
        },
        {
          "verse": 17,
          "text": "As it is written: “I have appointed you a father of many nations.” This was in the presence of the God in whom he trusted—the God who gives life to the dead and calls into being the things that do not exist.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Against all hope, he trusted in hope, so that he might become the father of many nations according to what had been spoken: “So shall your offspring be.”",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "Without weakening in faith, he considered his own body—which was as good as dead, since he was about a hundred years old—and the deadness of Sarah’s womb.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "He did not waver in unbelief regarding the promise of God, but was empowered by faith, giving glory to God,",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "being fully convinced that what God had promised, he was also powerful enough to do.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Therefore, “it was credited to his account as righteousness.”",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Now the words “it was credited to him” were not written for his sake alone,",
          "paragraphStart": true
        },
        {
          "verse": 24,
          "text": "but also for our sake. It is going to be credited to us who trust in the one who raised Jesus our Lord from the dead,",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "who was delivered over because of our stumbles and was raised for the sake of our being set in the right.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Natural human descent\" (v. 1)**: The Greek *kata sarka* (\"according to the flesh\") refers here to Abraham’s physical, biological ancestry. It distinguishes between the \"fleshly\" lineage of Israel and the spiritual lineage Paul is about to define.\n\n**\"Credited to his account\" (v. 3, 4, 5, 6, 8, 9, 10, 11, 22, 23, 24)**: The Greek *logizomai* is a primary ledger term from the world of first-century commerce and accounting. It means to place something on someone's balance sheet. Translating this consistently as \"credited to the account\" preserves Paul’s sustained metaphor of a divine accounting system where faith, not works, is the entry that balances the ledger.\n\n**\"Right standing\" / \"Righteousness\" (v. 3, 5, 6, 9, 11, 13, 22)**: The Greek *dikaiosynē* carries a legal and covenantal weight. It is not just \"piety\" or \"moral goodness,\" but a status of being \"in the right\" before a judge or in a relationship. \n\n**\"Irreverent\" (v. 5)**: The Greek *asebē* is often translated as \"ungodly.\" In the Greco-Roman context, it specifically refers to a lack of proper reverence or \"piety\" (*sebeia*) toward God. Paul’s claim that God \"justifies the ungodly\" would have been shocking to a first-century ear, as a judge's duty was to justify the righteous and condemn the wicked.\n\n**\"Violation\" (v. 15)**: The Greek *parabasis* (transgression) literally means \"stepping over a line.\" Paul distinguishes between \"sin\" (missing the mark) and \"violation\" (breaking a specific, codified command). The Law provides the \"line\" that makes \"stepping over\" possible.\n\n**\"As good as dead\" (v. 19)**: The Greek *nenekrōmenon* is a perfect passive participle meaning \"having been deadened.\" It emphasizes the physical impossibility of Abraham and Sarah conceiving, making the fulfillment of the promise an act of \"life from the dead\" (cf. v. 17).\n\n**\"Stumbles\" (v. 25)**: The Greek *paraptōmata* (often \"trespasses\") refers to a falling away or a false step. It suggests a lapse from a standard.\n\n**\"Being set in the right\" (v. 25)**: The Greek *dikaiōsin* (justification) is the act of being declared righteous. By using a phrase like \"being set in the right,\" the translation emphasizes the result of the resurrection—the vindication and change of status for the believer."
    },
    {
      "chapter": 5,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, since we have been declared righteous on the basis of trust, we have peace with God through our Lord Jesus Christ.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Through him, we have also obtained a formal introduction by trust into this state of favor in which we now stand, and we boast in the hope of the glory of God.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Not only that, but we also boast in our afflictions, knowing that affliction produces endurance,",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "and endurance produces proven character, and proven character produces hope.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "And this hope does not put us to shame, because God’s love has been poured out into our hearts through the Holy Spirit who was given to us.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "For while we were still helpless, at the right moment, Christ died on behalf of the ungodly.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Now, rarely will anyone die on behalf of a person who is merely upright—though perhaps for a truly good person someone might actually dare to die.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But God demonstrates his own love for us in this: while we were still sinners, Christ died on our behalf.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Much more, then, since we have now been declared righteous by his blood, will we be saved through him from the coming Wrath.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For if, while we were enemies, we were reconciled to God through the death of his Son, much more, having been reconciled, will we be saved by his life.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And not only that, but we are also boasting in God through our Lord Jesus Christ, through whom we have now received this reconciliation.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Therefore, just as sin entered the world through one man, and death through sin, so death spread to all humanity because all sinned—",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "for sin was in the world before the Law was given, but sin is not charged to one's account when there is no law.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Nevertheless, death reigned as king from Adam until Moses, even over those whose sinning was not like the violation of a direct command as Adam’s was. He is a prototype of the One who was to come.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "But the free gift is not like the stumble. For if the many died by the stumble of the one man, how much more did the favor of God and the gift given by the favor of the one man, Jesus Christ, overflow to the many.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "And the gift is not like the result of the one man’s sin: for the judgment following one stumble led to condemnation, but the free gift following many stumbles led to a verdict of acquittal.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For if, by the stumble of the one man, death reigned through that one, how much more will those who receive the overflowing of favor and of the gift of righteousness reign in life through the one, Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "So then, just as one stumble led to condemnation for all people, so also one act of righteousness led to a life-giving declaration of righteousness for all people.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "For just as through the disobedience of the one man the many were rendered sinners, so also through the obedience of the one man the many will be rendered righteous.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Now the Law slipped in so that the stumble might increase; but where sin increased, favor overflowed all the more,",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "so that, just as sin reigned in death, so also favor might reign through righteousness leading to eternal life through Jesus Christ our Lord.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Declared righteous\" (v. 1, 9)**: The Greek *dikaiōthentes* is a forensic term. Rather than \"made righteous\" (which suggests an internal moral change) or \"justified\" (which has become a specialized theological term), \"declared righteous\" captures the legal verdict of a judge.\n\n**\"Trust\" (v. 1, 2)**: The Greek *pistis* is usually rendered \"faith,\" but in the first century, it carried strong connotations of \"trust,\" \"reliability,\" and \"loyalty\" within a relationship (such as a patron and client). \n\n**\"Formal introduction\" (v. 2)**: The word *prosagōgēn* refers to the act of being formally introduced to a king or a person of high status by a third party. It implies that we do not barge into God's presence but are granted official access through Christ.\n\n**\"Favor\" (v. 2, 15, 20, 21)**: The Greek *charis* is traditionally \"grace.\" In a Roman context, *charis* (Latin *gratia*) referred to the system of favor and patronage. Translating it as \"favor\" or \"state of favor\" helps recover the sense of a social and relational standing granted by a superior.\n\n**\"Proven character\" (v. 4)**: *Dokimē* refers to the quality of being tested and found genuine, like metal that has survived the refinery. \n\n**\"Does not put us to shame\" (v. 5)**: *Kataischynei* means to be humiliated or let down because one’s expectations were misplaced. This hope is reliable; it won't leave us looking foolish.\n\n**\"The coming Wrath\" (v. 9)**: The Greek uses the definite article (*tēs orgēs*), referring to the specific \"Wrath\" of the Day of Judgment expected in Jewish eschatology.\n\n**\"Stumble\" (vv. 15-20)**: The Greek *paraptōma* (often \"trespass\" or \"offense\") literally means a \"false step\" or \"falling beside\" the path. It contrasts with *parakoē* (\"disobedience\" or \"refusal to hear\") in verse 19.\n\n**\"The many\" (vv. 15, 19)**: *Hoi polloi* is a Semitic idiom (reflecting the Hebrew *rabbim*) used to denote the inclusive \"all\" or \"the mass of humanity\" in contrast to \"the one.\"\n\n**\"Verdict of acquittal\" / \"Declaration of righteousness\" (vv. 16, 18)**: Paul uses three related words here: *dikaiōma* (the act/decree of righteousness), *dikaiōsis* (the process/state of being declared righteous), and *dikaiosynē* (righteousness). I have used \"verdict of acquittal\" and \"declaration of righteousness\" to maintain the forensic/judicial logic of the passage.\n\n**\"Slipped in\" (v. 20)**: *Pareisēlthen* suggests the Law entered alongside the main drama or \"came in as a side issue.\" It implies the Law was not the primary solution but was added to highlight the existing problem."
    },
    {
      "chapter": 6,
      "verses": [
        {
          "verse": 1,
          "text": "What then should we say? Should we persist in sin so that grace may multiply?",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "May it never be! We are those who died to sin; how can we still live in it?",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Or are you unaware that all of us who were baptized into Christ Jesus were baptized into his death?",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Therefore, we were buried with him through baptism into that death, so that just as Christ was raised from the dead through the glory of the Father, we too might walk in a completely new kind of life.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For if we have been fused together with him in the likeness of his death, we will certainly also be united with him in the likeness of his resurrection.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "We know this: our old humanity was crucified with him so that the body dominated by sin might be rendered powerless, with the result that we are no longer enslaved to sin.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For the one who has died has been legally acquitted from sin.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Now if we died with Christ, we believe that we will also live with him.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "We know that Christ, having been raised from the dead, will never die again; death no longer lords it over him.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For the death he died, he died to sin once for all; but the life he lives, he lives to God.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "In the same way, you also must account yourselves to be dead to sin, but alive to God in Christ Jesus.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Therefore, do not let sin reign as king in your mortal bodies so that you obey its lusts.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Stop offering the parts of your body to sin as weapons of unrighteousness; instead, offer yourselves to God as those who have been brought from death to life, and offer the parts of your body to God as weapons of righteousness.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For sin will not be your master, because you are not under the jurisdiction of law but under grace.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "What then? Should we commit an act of sin because we are not under law but under grace? May it never be!",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "Do you not know that when you offer yourselves to someone as obedient slaves, you are slaves to the one you obey—whether to sin, which leads to death, or to obedience, which leads to righteousness?",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "But thanks be to God that though you used to be slaves to sin, you became obedient from the heart to the pattern of teaching to which you were handed over.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "Having been set free from sin, you became enslaved to righteousness.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "I am speaking in human terms because of your natural limitations. Just as you once offered the parts of your body as slaves to impurity and to lawlessness, leading to further lawlessness, so now offer your body parts as slaves to righteousness, leading to holiness.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "For when you were slaves to sin, you were free from the demands of righteousness.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "So what fruit were you producing then? Things you are now ashamed of! For the end result of those things is death.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "But now, having been set free from sin and having become enslaved to God, the fruit you produce leads to holiness, and the end result is eternal life.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "For the wages paid by sin is death, but the free gift of God is eternal life in Christ Jesus our Lord.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Fused together\" (v. 5)**: The Greek *symphytoi* literally means \"grown together\" or \"planted together,\" as with a grafted plant. It implies a biological, organic union where two lives become one. \"United\" is too weak; \"fused\" captures the 1st-century agricultural metaphor of two things sharing the same life-source.\n\n**\"Old humanity\" (v. 6)**: *Ho palaios anthropos* is traditionally \"old man,\" but this is not about an individual's age. It refers to the \"old human condition\" or \"the person we were in Adam.\" \n\n**\"Rendered powerless\" (v. 6)**: *Katargēthē* is often translated as \"destroyed,\" but its meaning in Koine is closer to \"made ineffective,\" \"unemployed,\" or \"put out of business.\" The \"body of sin\" still exists, but its power to compel obedience has been nullified.\n\n**\"Legally acquitted\" (v. 7)**: The Greek *dedikaiotai* is a forensic term from the same root as \"justified.\" In a legal context, a dead person cannot be prosecuted; death satisfies the law's claim. The translation \"acquitted\" maintains this legal nuance better than the general \"freed.\"\n\n**\"Account yourselves\" (v. 11)**: *Logizesthe* is an accounting or bookkeeping term. It does not mean to \"feel\" dead to sin, but to enter it into the ledger as a settled fact.\n\n**\"Weapons\" (v. 13)**: While *hopla* can mean \"instruments,\" in the context of \"reigning\" (v. 12) and \"mastery\" (v. 14), it carries a military connotation. Paul views the members of the body as weapons used in a struggle between two kingdoms.\n\n**\"Under the jurisdiction of law\" (v. 14)**: The phrase *hypo nomon* (under law) suggests being under the authority or dominion of a specific legal system.\n\n**\"Pattern of teaching\" (v. 17)**: *Typon didachēs* refers to a \"mold\" (like a cast for metal). The image is that the believers were \"poured into\" a specific shape of Christian teaching that reshaped their character.\n\n**\"Wages\" (v. 23)**: *Opsōnia* specifically referred to a soldier's pay or rations. It is what one has earned and has a right to receive. This stands in sharp contrast to *charisma* (free gift), which is unearned."
    },
    {
      "chapter": 7,
      "verses": [
        {
          "verse": 1,
          "text": "Or are you unaware, brothers and sisters—for I am speaking to those who understand how law works—that the law exercises mastery over a person only as long as they live?",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For example, a married woman is bound by law to her husband while he is alive; but if the husband dies, she is released from the law that bound her to him.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "So then, if she belongs to another man while her husband is still living, she will be labeled an adulteress. But if her husband dies, she is free from that law, so that she is not an adulteress even if she comes to belong to another man.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "In the same way, my brothers and sisters, you also were put to death to the Law through the body of the Christ, so that you might belong to another—to the one who was raised from the dead—in order that we might bear fruit for God.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "For when we were in the grip of the flesh, the sinful passions aroused by the Law were at work in our bodies to bear fruit for death.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But now we have been released from the Law, having died to that which once held us captive, so that we may serve in the new way of the Spirit and not in the old way of the written code.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "What shall we say then? Is the Law sin? By no means! On the contrary, I would not have recognized sin if it were not for the Law. For I would not have known what it is to covet if the Law had not said, \"You shall not covet.\"",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "But sin, seizing a base of operations through the commandment, produced in me every kind of covetous desire. For apart from the Law, sin lies dead.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "I was once alive apart from the Law; but when the commandment came, sin sprang to life",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "and I died. The very commandment intended to bring life was found to bring death to me.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For sin, seizing its base of operations through the commandment, deceived me and used the commandment to kill me.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "So then, the Law itself is holy, and the commandment is holy, righteous, and good.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Did that which is good, then, become death to me? By no means! It was sin, so that it might be exposed as sin, working death in me through what is good—so that through the commandment sin might become sinful beyond measure.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "For we know that the Law is spiritual; but I am made of flesh, sold into slavery under sin.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "I do not understand my own actions. For I do not practice what I want to do, but I do the very thing I hate.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Now if I do what I do not want to do, I am agreeing with the Law—that it is good.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "So now it is no longer I who am performing the action, but the sin that makes its home in me.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For I know that nothing good lives in me—that is, in my flesh. The desire to do good is close at hand, but the ability to carry it out is not.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "For I do not do the good I want to do, but the evil I do not want to do—this is what I keep practicing.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Now if I do what I do not want, it is no longer I performing the action, but the sin that makes its home in me.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "So I find this to be the rule: when I want to do what is good, evil is sitting right next to me.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "For I delight in the Law of God in my inner self,",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "but I see a different law in my body, waging war against the law of my mind and taking me prisoner to the law of sin which exists in my body.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "Wretched man that I am! Who will rescue me from this body of death?",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "Thanks be to God through Jesus Christ our Lord! So then, I myself serve the Law of God with my mind, but with my flesh I serve the law of sin.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Exercises mastery\" (v. 1)**: The Greek *kyrieuei* suggests more than just application; it implies a \"lording over\" or the exercise of lordship/authority.\n\n**\"Released\" (v. 2, 6)**: The verb *katērgētai* (and *katērgēthēmen* in v. 6) means to render ineffective, nullify, or abolish. In the context of a legal bond, \"released\" or \"discharged\" best captures the termination of a previous obligation.\n\n**\"In the grip of the flesh\" (v. 5)**: The phrase *en tē sarki* (literally \"in the flesh\") refers to a mode of existence dominated by human limitations and the rebellious nature, rather than just physical tissue.\n\n**\"Base of operations\" (v. 8, 11)**: The Greek *aphormē* refers to a starting point, a bridgehead, or a base of operations in a military sense. Sin is personified as an invading force that uses the Law as its strategic entry point into the human experience.\n\n**\"Sprang to life\" (v. 9)**: *Anezēsen* suggests a revival or a bursting into activity. The Law acts as the catalyst that activates the dormant power of sin.\n\n**\"Made of flesh\" (v. 14)**: The word *sarkinos* describes the material out of which something is made. Paul is not just saying he is \"fleshly\" in behavior (*sarkikos*), but that his very constitution as a descendant of Adam makes him susceptible to the gravity of sin.\n\n**\"Sold into slavery under sin\" (v. 14)**: *Pepramenos hypo tēn hamartian* uses the imagery of the slave market. To be \"sold under\" someone was the standard way to describe being bought as a slave.\n\n**\"Makes its home in me\" (v. 17, 20)**: The verb *oikousa* implies more than just being present; it suggests residency or inhabitation. Sin is treated as a squatter or a hostile resident within the \"I.\"\n\n**\"The rule\" (v. 21)**: The word *nomos* is used here not for the Mosaic Law (Torah), but for a governing principle or a regular pattern of experience.\n\n**\"Body of death\" (v. 24)**: This likely refers to the \"body\" as the sphere where sin and death operate, or the mortal condition that is being \"waged war against\" by the law of sin. It captures the desperation of being trapped in a dying, sin-infected state."
    },
    {
      "chapter": 8,
      "verses": [
        {
          "verse": 1,
          "text": "Therefore, there is now no adverse verdict for those who are in Christ Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "For the law of the Spirit of life in Christ Jesus has set you free from the law of sin and death.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For what the Law was powerless to do, in that it was weakened by our unredeemed human nature, God did: by sending his own Son in a likeness similar to our sinful nature and as an offering for sin, he passed judgment on sin within the flesh itself.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "He did this so that the righteous requirement of the Law might be fully met in us, who do not direct our lives according to the impulses of the flesh, but according to the Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For those who live according to the flesh have their mindsets fixed on the things of the flesh, but those who live according to the Spirit fix their minds on the things of the Spirit.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "For the mindset of the flesh is death, but the mindset of the Spirit is life and peace.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "This is because the mindset of the flesh is hostile toward God; it does not submit itself to God’s law—indeed, it is incapable of doing so.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Those who exist in the realm of the flesh cannot please God.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "You, however, are not in the realm of the flesh but in the Spirit, if indeed the Spirit of God makes his home in you. But if anyone does not have the Spirit of Christ, this person does not belong to him.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "But if Christ is in you, though the body is dead because of sin, the Spirit is life because of righteousness.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And if the Spirit of the one who raised Jesus from the dead makes his home in you, the one who raised Christ Jesus from the dead will also give life to your mortal bodies through his Spirit who lives within you.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "So then, brothers and sisters, we are debtors—but not to the flesh, to live according to its impulses.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "For if you live according to the flesh, you are at the point of dying; but if by the Spirit you put to death the deeds of the body, you will live.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "For as many as are led by the Spirit of God, these are the sons of God.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For you did not receive a spirit of slavery leading back into fear; instead, you received the Spirit of adoption as sons, by which we cry out, \"*Abba*! Father!\"",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "The Spirit himself bears witness with our spirit that we are God’s children.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "And if children, then heirs—heirs of God and co-heirs with Christ, provided we suffer with him so that we may also be glorified with him.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For I consider that the sufferings of this present time are not worth comparing with the glory that is about to be revealed to us.",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "For the creation waits with outstretched neck in eager anticipation for the revealing of the sons of God.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "For the creation was subjected to futility, not by its own choice, but because of the one who subjected it—in the hope",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "that the creation itself will also be set free from its bondage to decay into the glorious freedom of the children of God.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "For we know that the entire creation has been groaning together and suffering birth pains together until now.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "And not only the creation, but we ourselves, who have the firstfruits of the Spirit, groan inwardly as we eagerly await our adoption as sons—the final redemption of our bodies.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "For in this hope we were saved. But hope that is seen is not hope at all; for who hopes for what he already sees?",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "But if we hope for what we do not see, we wait for it with steadfast endurance.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "In the same way, the Spirit also comes to our aid in our weakness. For we do not know how to pray as we ought, but the Spirit himself intercedes for us with wordless groans.",
          "paragraphStart": true
        },
        {
          "verse": 27,
          "text": "And the one who searches hearts knows what the mindset of the Spirit is, because the Spirit intercedes for the saints in harmony with God's will.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "And we know that for those who love God, he works all things together for good—for those who are called according to his purpose.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "For those whom he foreknew, he also predestined to be conformed to the image of his Son, so that he might be the firstborn among many brothers and sisters.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "And those whom he predestined, these he also called; and those whom he called, these he also justified; and those whom he justified, these he also glorified.",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "What, then, shall we say to these things? If God is for us, who can be against us?",
          "paragraphStart": true
        },
        {
          "verse": 32,
          "text": "He who did not even spare his own Son but gave him up for us all, how will he not also, along with him, graciously give us all things?",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "Who will bring a charge against God’s chosen ones? It is God who justifies!",
          "paragraphStart": false
        },
        {
          "verse": 34,
          "text": "Who is the one who condemns? Christ Jesus is the one who died—more than that, who was raised—who is at the right hand of God and who is also interceding for us.",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "Who shall separate us from the love of Christ? Shall tribulation, or distress, or persecution, or famine, or nakedness, or danger, or the sword?",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "As it is written: *For your sake we are being put to death all day long; we were accounted as sheep for the slaughter.*",
          "paragraphStart": false
        },
        {
          "verse": 37,
          "text": "No, in all these things we are more than conquerors through the one who loved us.",
          "paragraphStart": true
        },
        {
          "verse": 38,
          "text": "For I am convinced that neither death nor life, nor angels nor rulers, nor things present nor things to come, nor powers,",
          "paragraphStart": false
        },
        {
          "verse": 39,
          "text": "nor height nor depth, nor any other created thing, will be able to separate us from the love of God that is in Christ Jesus our Lord.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Adverse verdict\" (v. 1)**: The Greek *katakrima* is a legal term referring to the judicial sentence or the punishment following a \"guilty\" verdict. \"Condemnation\" is traditional, but \"adverse verdict\" captures the courtroom context of Paul's argument in Romans.\n\n**\"Unredeemed human nature / Flesh\" (v. 3, 4, 5, etc.)**: The Greek *sarx* (\"flesh\") in Paul’s writing refers to the whole person oriented away from God. I have used \"unredeemed human nature\" or \"impulses of the flesh\" where the theological weight is heavy, and \"flesh\" where the physical/metaphorical contrast is intended.\n\n**\"Offering for sin\" (v. 3)**: The phrase *peri hamartias* (\"concerning sin\") is the standard Septuagint (LXX) technical term for a \"sin offering\" (Leviticus 4:3, 5:6). Paul is intentionally evoking the sacrificial system.\n\n**\"Mindset\" (v. 6, 7, 27)**: *Phronēma* refers to the internal disposition, way of thinking, and aspirations of the mind. It is more than just a \"thought\"; it is an entire mental orientation.\n\n**\"Abba\" (v. 15)**: Retained as a loanword from the Aramaic. It reflects the intimate, familial language Jesus used for God, which was preserved in the early Greek-speaking church as a liturgical or prayer formula.\n\n**\"Adoption as sons\" (v. 15, 23)**: *Huiothesia* was a specific legal process in the Greco-Roman world where an adoptee was legally transferred from one *paterfamilias* to another, gaining all inheritance rights. \n\n**\"Waits with outstretched neck\" (v. 19)**: This translates *apokaradokia*, a vivid word suggesting a person leaning forward, craning their neck to see something on the horizon.\n\n**\"Futility\" (v. 20)**: *Mataiotēs* is the same word used in the LXX for the Hebrew *hebel* in Ecclesiastes (\"Vanity of vanities\"). It implies a state of frustration or emptiness where things do not reach their intended goal.\n\n**\"Redemption\" (v. 23)**: *Apolutrōsis* carries the sense of a ransom paid to release a slave or prisoner.\n\n**\"Wordless groans\" (v. 26)**: *Stenagmois alalētois* refers to groans that are unspoken or beyond the capacity of articulated language.\n\n**\"He works all things together\" (v. 28)**: There is a textual variant here. The SBLGNT reads *panta synergei* (\"all things work together\"), but many scholars argue the underlying grammar or alternative manuscripts imply God is the subject (*ho theos*). I have rendered it as God working through all things to better reflect the agency implied in the following verses (v. 29-30).\n\n**\"More than conquerors\" (v. 37)**: The Greek *hypernikōmen* is a \"hyper-victory.\" It means to win a crushing victory, leaving no doubt as to the outcome."
    },
    {
      "chapter": 9,
      "verses": [
        {
          "verse": 1,
          "text": "I am speaking the truth in Christ—I am not lying, and my conscience, governed by the Holy Spirit, confirms it—",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "that I have a great sorrow and unyielding anguish in my heart.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For I could wish that I myself were cursed, cut off from Christ for the sake of my brothers, my own people by blood.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "They are Israelites; to them belong the divine sonship, the kavod-glory, the covenants, the giving of the Law, the temple service, and the promises.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "To them belong the patriarchs, and from their lineage, according to the flesh, comes the Christ, who is over all, God blessed forever. Amen.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "It is not as though God’s word has failed. For not everyone descended from Israel truly belongs to Israel.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Nor is it the case that because they are Abraham’s offspring, they are all his children. On the contrary, the scripture says, *“Through Isaac your offspring will be named.”*",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "This means it is not the children of the flesh who are God’s children, but the children of the promise who are counted as the true offspring.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For this is the word of the promise: *“At the appointed time I will return, and Sarah will have a son.”*",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And not only that, but also when Rebecca had conceived children by one man, our forefather Isaac—",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "even before they were born or had done anything good or bad, so that God’s purpose in election might stand,",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "not based on works but on the one who calls—she was told, *“The older will serve the younger.”*",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Just as it is written: *“Jacob I loved, but Esau I hated.”*",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "What shall we say then? Is there injustice with God? Absolutely not!",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "For he says to Moses, *“I will have mercy on whom I have mercy, and I will have compassion on whom I have compassion.”*",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "So then, it does not depend on human will or human effort, but on God, who shows mercy.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For the Scripture says to Pharaoh, *“I raised you up for this very purpose: to demonstrate my power in you, and so that my name might be proclaimed throughout the whole earth.”*",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "So then, he has mercy on whom he wants to have mercy, and he hardens whom he wants to harden.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "You will say to me then, “Why does he still find fault? For who has ever resisted his resolve?”",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "On the contrary, who are you—a mere human—to talk back to God? Shall the molded object say to the molder, “Why did you make me like this?”",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Does the potter not have authority over the clay, to make from the same lump of dough one vessel for honor and another for dishonor?",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "What if God, though choosing to demonstrate his wrath and make his power known, endured with great patience the vessels of wrath that were ripe for destruction?",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "And what if he did this to make known the riches of his glory upon the vessels of mercy, which he prepared beforehand for glory—",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "including us, whom he called, not only from among the Jews but also from among the Gentiles?",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "As he says also in Hosea: *“I will call ‘my people’ those who were not my people, and ‘beloved’ her who was not beloved.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "And in the very place where it was said to them, ‘You are not my people,’ there they will be called sons of the living God.”*",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "And Isaiah cries out concerning Israel: *“Though the number of the sons of Israel be as the sand of the sea, only the remnant will be saved;",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "for the Lord will execute his sentence on the earth, completing it and cutting it short.”*",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "And as Isaiah predicted: *“Unless the Lord of Armies had left us an offspring, we would have become like Sodom and been made like Gomorrah.”*",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "What shall we say then? That Gentiles, who were not pursuing righteousness, have attained righteousness—specifically, the righteousness that comes from faith.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "But Israel, while pursuing a law of righteousness, did not arrive at that law.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "Why? Because they pursued it not by faith, but as if it were by works. They stumbled over the stumbling stone,",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "just as it is written: *“Look, I am placing in Zion a stone that trips people up and a rock that offends; yet the one who trusts in him will not be put to shame.”*",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Cursed, cut off\" (v. 3)**: The Greek *anathema* corresponds to the Hebrew *herem*—something devoted to God by being utterly destroyed. Paul is not merely talking about being \"unhappy\"; he is using the most extreme language of spiritual exclusion possible to show his devotion to his kin.\n\n**\"Kavod-glory\" (v. 4)**: The Greek *doxa* here refers specifically to the *Shekhinah*, the manifest presence of God that resided in the Tabernacle and Temple. Adding \"kavod\" (the Hebrew term for this specific glory) helps the reader distinguish this from general \"fame\" or \"splendor.\"\n\n**\"God blessed forever\" (v. 5)**: The Greek grammar here is famous for its ambiguity regarding punctuation. It can be read as a separate doxology to God the Father, or as a description of the Christ. Given the climactic flow of the passage—listing the advantages of Israel ending with the Messiah—the most natural reading in the first century would be to apply this title to the Christ.\n\n**\"Hated\" (v. 13)**: This reflects a Semitic idiom where \"love\" and \"hate\" are used relatively to indicate choice or preference. In the context of election (v. 11), it means \"to choose one over the other\" rather than suggesting active malice or emotional hatred.\n\n**\"Human effort\" (v. 16)**: Literally \"the one who runs\" (*tou trechontos*). Paul uses the metaphor of a race to describe intense human striving or the attempt to gain God's favor through performance.\n\n**\"Resolve\" (v. 19)**: The Greek *boulēmati* refers to a deliberate plan or purpose, stronger than a simple \"wish.\" It implies an intentional counsel that is being carried out.\n\n**\"Lump of dough\" (v. 21)**: While *phurama* can mean a lump of clay, it was also commonly used for a batch of kneaded dough. This connects back to the imagery of \"firstfruits\" and the organic unity of the people of Israel used elsewhere by Paul.\n\n**\"Ripe for destruction\" (v. 22)**: The participle *katērtismena* is ambiguous; it can be middle voice (\"who prepared themselves\") or passive (\"who were prepared\"). The translation \"ripe\" captures the state of readiness for judgment without over-settling the technical debate of who did the preparing, though the contrast with verse 23 (where God clearly does the preparing) is stark.\n\n**\"Lord of Armies\" (v. 29)**: This translates *Kyrios Sabaoth*. While many translations transliterate \"Sabaoth,\" it refers to the \"hosts\" or \"armies\" of heaven.\n\n**\"Stone that trips people up\" (v. 33)**: The Greek *proskommatos* refers to an obstacle on the road. *Skandalon* refers to the trigger-mechanism of a trap. Together, they describe something that causes an unexpected downfall."
    },
    {
      "chapter": 10,
      "verses": [
        {
          "verse": 1,
          "text": "Brothers and sisters, my heart’s deepest desire and my prayer to God on their behalf is for their salvation.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "I can testify for them that they have a zeal for God, but it is not based on precise knowledge.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For they failed to recognize the righteousness that comes from God, and by seeking to establish a standing of their own, they did not submit themselves to God’s way of setting things right.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For Christ is the culmination of the Law, bringing righteousness to everyone who believes.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "For Moses writes concerning the righteousness that comes from the Law: *The person who does these things will find life in them.*",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "But the righteousness that comes from faith speaks this way: “Do not say in your heart, ‘Who will go up into heaven?’” (that is, to bring Christ down),",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "“or, ‘Who will go down into the abyss?’” (that is, to bring Christ up from the dead).",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "But what does it say? “The word is near you, in your mouth and in your heart” (that is, the word of faith that we proclaim).",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Because if you acknowledge with your mouth that Jesus is Lord, and believe in your heart that God raised him from the dead, you will be saved.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For with the heart one believes, resulting in righteousness, and with the mouth one acknowledges, resulting in salvation.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For the Scripture says, *Everyone who trusts in him will not be put to shame.*",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "For there is no distinction between Jew and Greek; the same Lord is Lord of all, being richly generous to all who call upon him.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "For *everyone who calls on the name of the Lord will be saved.*",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "How, then, can they call on one in whom they have not believed? And how can they believe in one whom they have not heard? And how can they hear without someone proclaiming the message?",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "And how can they proclaim the message unless they are sent? As it is written: *How welcome are the feet of those who bring good news of great things!*",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "But not everyone obeyed the good news. For Isaiah says, *Lord, who has believed our message?*",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "So then, faith comes from hearing the message, and the message comes through the word of Christ.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "But I ask, have they not heard? Certainly they have: *Their voice has gone out into all the earth, and their words to the ends of the inhabited world.*",
          "paragraphStart": true
        },
        {
          "verse": 19,
          "text": "Again I ask, did Israel not know? First, Moses says, *I will make you jealous of those who are not a nation; I will make you angry with a nation that has no understanding.*",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Then Isaiah is so bold as to say, *I was found by those who were not looking for me; I revealed myself to those who did not ask for me.*",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "But regarding Israel he says, *All day long I have stretched out my hands to a disobedient and defiant people.*",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Precise knowledge\" (v. 2)**: The Greek *epignōsis* implies more than a general awareness (*gnōsis*). It suggests a full, experiential, or correct understanding. The Israelites have the passion (zeal) but lack the correct \"map\" of how God is working.\n\n**\"God’s way of setting things right\" (v. 3)**: The Greek *dikaiosynē* is traditionally \"righteousness.\" In this context, Paul is contrasting a status achieved through individual effort (*idian*, \"their own\") with the restorative justice and covenant standing provided by God.\n\n**\"Culmination\" (v. 4)**: The word *telos* can mean \"end\" (termination) or \"goal/fulfillment.\" In the context of Paul’s theology of the Law, Christ is the destination to which the Law was leading, as well as the termination of the Law as a system for achieving righteousness.\n\n**\"Acknowledge\" (v. 9, 10)**: The Greek *homologeō* means \"to say the same thing\" or \"to agree.\" In a first-century context, declaring \"Jesus is Lord\" (*Kyrios Iēsous*) was a subversive confession of loyalty that contrasted with the Roman requirement to acknowledge Caesar as Lord.\n\n**\"Abyss\" (v. 7)**: The Greek *abysson* refers to the depths, often associated in Jewish thought with the realm of the dead or the chaotic waters. Paul uses it here to contrast the accessibility of Christ with an impossible journey to the underworld.\n\n**\"Resulting in...\" (v. 10)**: The preposition *eis* indicates the direction or outcome of the action. Belief leads into righteousness; confession leads into salvation.\n\n**\"Welcome\" (v. 15)**: The Greek *hōraioi* is often translated \"beautiful,\" but in the context of the Septuagint (Isaiah 52:7), it refers to the timeliness or \"rightness\" of the arrival of a messenger bearing good news.\n\n**\"The message\" (v. 16, 17)**: The Greek *akoē* literally means \"the hearing\" or \"the thing heard.\" It refers to the report or the act of proclamation itself.\n\n**\"Defiant\" (v. 21)**: The Greek *antilegonta* literally means \"speaking against.\" It depicts a people who do not just passively ignore God but actively contradict and resist His summons."
    },
    {
      "chapter": 11,
      "verses": [
        {
          "verse": 1,
          "text": "I ask then, has God thrust aside his people? By no means! For I myself am an Israelite, a descendant of Abraham, from the tribe of Benjamin.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "God has not thrust aside his people whom he acknowledged from the beginning. Or do you not know what the Scripture says in the passage about Elijah, how he pleads with God against Israel?",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "“Lord, they have killed your prophets and torn down your altars; I am the only one left, and they are seeking my life.”",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "But what is the divine response to him? “I have reserved for myself seven thousand men who have not bowed the knee to Baal.”",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "So in the same way, at the present time, a remnant has come to be, chosen by grace.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "But if it is by grace, it is no longer based on achievements; otherwise, grace would no longer be grace.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "What follows then? What Israel is searching for, it did not obtain, but the chosen ones obtained it. The rest were hardened,",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "just as it is written: “God gave them a spirit of deep stupor, eyes that do not see and ears that do not hear, down to this very day.”",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "And David says: “Let their table become a snare and a trap, a stumbling block and a retribution to them;",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "let their eyes be darkened so they cannot see, and keep their backs bent forever.”",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "I ask then, did they trip so as to fall into ruin? By no means! Rather, by their misstep, salvation has come to the nations to make Israel jealous.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "Now if their misstep means riches for the world, and if their deficit means riches for the nations, how much more will their full inclusion bring!",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Now I am speaking to you who are from the nations. Insofar as I am an apostle to the nations, I take pride in my ministry,",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "in the hope that I might somehow make my own flesh and blood jealous and save some of them.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For if their rejection means the reconciliation of the world, what will their acceptance be but life from the dead?",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "If the first handful of dough is holy, so is the whole batch; and if the root is holy, so are the branches.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "But if some of the branches were broken off, and you—a wild olive shoot—were grafted in among them to share in the richness of the olive root,",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "do not boast over the branches. If you do boast, remember: it is not you who supports the root, but the root supports you.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "You will say then, “Branches were broken off so that I might be grafted in.”",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "That is true. They were broken off because of their lack of trust, but you stand only by trust. Do not be arrogant, but stand in awe.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "For if God did not spare the natural branches, neither will he spare you.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "Consider, then, the kindness and the uncompromising severity of God: severity toward those who have fallen, but God’s kindness toward you, provided you continue in that kindness; otherwise, you too will be cut off.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "And even they, if they do not persist in their lack of trust, will be grafted in, for God has the power to graft them in again.",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "For if you were cut from what is by nature a wild olive tree and grafted, contrary to nature, into a cultivated olive tree, how much more will these—the natural branches—be grafted back into their own olive tree?",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "For I do not want you to be uninformed, brothers and sisters, about this revealed secret, so that you will not be wise in your own conceit: a partial hardening has come upon Israel until the full count of the nations has come in.",
          "paragraphStart": true
        },
        {
          "verse": 26,
          "text": "And in this way, all Israel will be saved, just as it is written: “The Deliverer will come from Zion; he will banish ungodliness from Jacob.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "And this is my covenant with them when I take away their sins.”",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "Regarding the Good News, they are enemies for your sake; but regarding God’s choice, they are beloved for the sake of the patriarchs.",
          "paragraphStart": true
        },
        {
          "verse": 29,
          "text": "For the gracious gifts and the calling of God are irrevocable.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Just as you were once disobedient to God but have now received mercy through their disobedience,",
          "paragraphStart": false
        },
        {
          "verse": 31,
          "text": "so they too have now been disobedient so that, through the mercy shown to you, they too may now receive mercy.",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "For God has imprisoned everyone in disobedience so that he may show mercy to everyone.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "O the depth of the riches and wisdom and knowledge of God! How unsearchable are his judgments and how untraceable his ways!",
          "paragraphStart": true
        },
        {
          "verse": 34,
          "text": "“For who has known the mind of the Lord? Or who has been his counselor?”",
          "paragraphStart": false
        },
        {
          "verse": 35,
          "text": "“Or who has first given to him, that he should be repaid?”",
          "paragraphStart": false
        },
        {
          "verse": 36,
          "text": "For from him and through him and to him are all things. To him be the glory forever! Amen.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Thrust aside\" (v. 1, 2)**: The Greek *apōsato* carries a sense of forceful rejection or pushing away. \"Thrust aside\" captures this more actively than the traditional \"cast away.\"\n\n**\"Acknowledged from the beginning\" (v. 2)**: *Proegnō* is often translated \"foreknew,\" but in a Hebrew-influenced context (related to the concept of *yada*), it implies an intimate, elective acknowledgment or choice rather than mere prior information.\n\n**\"Divine response\" (v. 4)**: *Chrēmatismos* refers specifically to a divine oracle or a communication from a deity.\n\n**\"Achievements\" (v. 6)**: *Ergōn* (\"works\") in Paul's context often refers to deeds performed to secure status or righteousness. \"Achievements\" helps the modern reader see the contrast Paul is making with \"grace\" as a free gift.\n\n**\"Hardened\" (v. 7)**: *Epōrōthēsan* refers to the formation of a callus (*pōros*), suggesting a loss of sensitivity or a thickening of skin that prevents feeling.\n\n**\"Spirit of deep stupor\" (v. 8)**: *Pneuma katanuxeōs* is a Septuagintal phrase (Isa 29:10). The root suggests being \"pricked\" or \"stunned,\" leading to a state of numbness or anesthetic sleep.\n\n**\"Misstep\" (v. 11, 12)**: *Paraptōma* means a slip, a false step, or a blunder, rather than a total, final fall into ruin (which Paul distinguishes by using *pesōsin*).\n\n**\"Deficit\" (v. 12)**: *Hēttēma* refers to a loss, a defeat, or a diminishing in number/quality. It stands in contrast to *plērōma* (\"full inclusion\" or \"fullness\").\n\n**\"Revealed secret\" (v. 25)**: *Mystērion* is not a \"mystery\" in the sense of a puzzle to be solved, but a divine secret that was once hidden and is now being disclosed to the initiated.\n\n**\"Irrevocable\" (v. 29)**: *Ametamelēta* means something not to be regretted or taken back; it is final and certain.\n\n**\"Imprisoned\" (v. 32)**: *Synekleisen* means to shut up together or enclose. The image is of God locking everyone in a single room (the room of disobedience) so that they might all receive the same thing (mercy).\n\n**\"Untraceable\" (v. 33)**: *Anexichniastoi* literally means \"without footprints.\" God’s ways are such that humans cannot follow the \"track\" of his logic to its source."
    },
    {
      "chapter": 12,
      "verses": [
        {
          "verse": 1,
          "text": "I appeal to you therefore, brothers and sisters, by the compassions of God, to offer your bodies as a living sacrifice—set apart, holy, and well-pleasing to God—which is your reasoned service of worship.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Do not be shaped by the internal logic of this present age, but be transformed by the renewing of your mind, so that you may discern through experience what the will of God is: what is good, well-pleasing, and complete.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For through the grace given to me, I say to everyone among you: do not overthink your own importance beyond what is necessary to think; rather, think so as to be of a sound mind, according to the measure of faith that God has distributed to each.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "For just as we have many limbs in a single body, and these limbs do not all have the same function,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "so we, though many, are one body in Christ, and individually we are limbs belonging to one another.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Since we have grace-gifts that differ according to the grace given to us, let us use them: if prophecy, in proportion to our faith;",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "if practical service, in the work of serving; if one is a teacher, in the work of teaching;",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "if one is an encourager, in the work of encouragement; the one who shares, with undivided sincerity; the one who leads, with diligent zeal; the one who shows mercy, with a cheerful heart.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Love must be without the mask of a performer. Loathe what is evil; glue yourselves to what is good.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "In family affection, be devoted to one another; in showing honor, lead the way for one another.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Do not be sluggish in your zeal; be set on fire by the Spirit; serve as slaves to the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Rejoice in hope; endure in times of tribulation; persist in prayer.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Share in the needs of the holy ones; make a point of hunting down opportunities for hospitality.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Speak a blessing over those who hunt you down; bless and do not call down a curse.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "Rejoice with those who are rejoicing; weep with those who are weeping.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Think in harmony with one another. Do not be fixated on high status, but be carried away by the company of the lowly. Do not become wise in your own estimation.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Pay back to no one evil for evil; take thought for what is noble in the sight of all people.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "If possible, so far as it depends on you, live at peace with everyone.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "Do not take your own revenge, beloved, but give place to the Divine Wrath, for it is written: *Vengeance is mine, I will repay, says the Lord.*",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "Rather, *if your enemy is hungry, feed him; if he is thirsty, give him a drink; for by doing this you will heap burning coals of fire upon his head.*",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Do not be conquered by evil, but conquer evil with the good.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Reasoned service of worship\" (v. 1)**: The Greek *logikēn* carries the weight of the *Logos*. While often translated as \"spiritual,\" for a Greek reader it meant worship that is rational, consistent with the nature of reality, and mindful—contrasted with the irrationality of animal sacrifices. It is worship that \"makes sense\" in light of God's mercies.\n\n**\"Shaped by the internal logic of this present age\" (v. 2)**: The verb *suschēmatizesthe* refers to an outward conformity or a \"molding\" to a pattern (*schēma*). The translation \"internal logic\" captures the sense of the *aiōn* (age) as a system of thought and behavior that exerts pressure on the believer.\n\n**\"Complete\" (v. 2)**: *Teleion* is often \"perfect,\" but in Koine Greek, it refers to maturity or a state of being finished/complete, reaching its intended end (*telos*).\n\n**\"Overthink... necessary to think... sound mind\" (v. 3)**: Paul uses a sophisticated rhetorical wordplay on the root *phronein* (to think/mind): *hyperphronein* (to over-think), *phronein* (to think), and *sophronein* (to be of a sound/sober mind). The translation preserves this repetition to show that the renewal of the \"mind\" (v. 2) results in a specific kind of \"thinking\" (v. 3).\n\n**\"Undivided sincerity\" (v. 8)**: *Haplotēti* can mean \"generosity\" or \"simplicity/sincerity.\" In this context of communal sharing, it refers to a heart that is not divided by ulterior motives.\n\n**\"Without the mask of a performer\" (v. 9)**: The Greek *anypokritos* is the negation of *hypokritēs* (an actor/performer). Christian love is not a theatrical display or a role one plays; it is genuine.\n\n**\"Hunting down\" / \"Hunt you down\" (v. 13-14)**: Paul uses the same verb, *diōkō*, in both verses. In verse 13, it describes the \"pursuit\" of hospitality (often translated as \"practicing\" or \"given to\"). In verse 14, it describes those who \"persecute\" (hunt down) the believers. The translation retains this linguistic link to show the rhetorical contrast between pursuing strangers to love them and being pursued by enemies to harm them.\n\n**\"Give place to the Divine Wrath\" (v. 19)**: The Greek text literally says \"give place to the wrath,\" which is a common idiom for stepping aside and letting God’s judgment handle a matter rather than taking personal vengeance.\n\n**\"Burning coals of fire\" (v. 20)**: This is an allusion to Proverbs 25:21–22. In the ancient context, this idiom likely refers to the burning shame that leads to a change of heart, fitting the theme of \"conquering evil with good.\""
    },
    {
      "chapter": 13,
      "verses": [
        {
          "verse": 1,
          "text": "Let every person place themselves in subjection to the governing authorities, for no authority exists except by God’s agency, and those that do exist have been ordered into their places by God.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Consequently, the one who sets themselves against such authority has rebelled against God’s own arrangement; and those who take such a stand will bring a judgment of condemnation upon themselves.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For those in power are not a cause for fear to those who do good, but to those who do evil. Do you wish to live without fear of the authority? Then do what is good, and you will receive its formal approval.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For the official is God’s servant, working for your benefit. But if you do what is evil, be afraid; for the official does not wear the sword of execution without purpose. He is God’s servant, an agent of justice to execute divine wrath upon the one who practices evil.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Therefore, it is necessary to remain in subjection—not only to avoid that wrath, but also for the sake of your own conscience.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "For this is also why you pay taxes: the officials are God’s public ministers, devoting themselves to this very service.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "Pay back to everyone what is owed to them: if you owe tribute, pay tribute; if customs taxes, pay customs; if respectful awe, give awe; if honor, give honor.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Owe no one anything, except the perpetual debt of loving one another. For the person who loves the other has fulfilled the Law.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "For the decrees—\"Do not commit adultery,\" \"Do not murder,\" \"Do not steal,\" \"Do not covet\"—and whatever other commandment there may be, are all summed up in this single word: \"You shall love your neighbor as yourself.\"",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Love works no evil against a neighbor; therefore, love is the fullness of the Law.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Do this because you recognize the decisive moment we are in: the hour has already come for you to be awakened from sleep. For our salvation is nearer now than when we first came to faith.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "The night is far spent; the Day has drawn near. Let us, then, strip off the works of darkness and put on the armor of light.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Let us conduct ourselves with decency, as people living in the daylight—not in wild parties and drunken binges, not in sexual promiscuity and unrestrained indecency, not in constant quarreling and jealous rivalry.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Instead, clothe yourselves with the Lord Jesus Christ, and make no plans to satisfy the cravings of your lower nature.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Ordered into their places\" / \"Arrangement\" (v. 1-2)**: The Greek text uses a cluster of words based on the root *tassō* (to arrange or appoint in an orderly manner). Paul uses *hypotassō* (place under order), *tetagmenai* (having been ordered), *antitassomenos* (ordering oneself against), and *diatagē* (the arrangement). The translation uses \"ordered\" and \"arrangement\" to preserve this rhetorical emphasis on social order versus chaos.\n\n**\"Formal approval\" (v. 3)**: The Greek *epainon* (praise/commendation) in a first-century Roman context often referred to public, civic recognition or honors bestowed by the state upon a benefactor or a law-abiding citizen.\n\n**\"Agent of justice\" (v. 4)**: The word *ekdikos* refers to one who exacts a penalty or executes justice. While often translated as \"avenger,\" it carries a legal/official weight here rather than a sense of personal vendetta.\n\n**\"Public ministers\" (v. 6)**: The Greek *leitourgoi* refers to people performing a *leitourgia*—originally a public service performed by wealthy citizens at their own expense for the benefit of the city-state. Paul uses this high-register civic term to describe tax collectors and officials, framing their secular work as a form of divine service.\n\n**\"Tribute\" / \"Customs taxes\" (v. 7)**: Paul distinguishes between *phoros* (direct taxes like property or poll tax paid by subject nations to Rome) and *telos* (indirect taxes like customs, tolls, or duties on goods).\n\n**\"Decisive moment\" (v. 11)**: The Greek *kairos* refers to a specific, significant period or a \"season\" of opportunity, distinct from *chronos* (mere chronological time).\n\n**\"Armor of light\" (v. 12)**: The word *hopla* refers to military equipment or weapons. Combined with the \"light/dark\" dualism, this evokes the imagery of a soldier prepared for a dawn battle, a motif common in both the New Testament and the Dead Sea Scrolls (e.g., the *War Scroll*).\n\n**\"Wild parties... drunken binges\" (v. 13)**: The terms *kōmois* and *methais* describe the excessive carousing and heavy drinking associated with Greco-Roman banquets and street revelry.\n\n**\"Lower nature\" (v. 14)**: The Greek *sarx* (flesh) here refers not to physical skin and bone, but to the human orientation toward self-gratification apart from God. \"Lower nature\" captures the ethical and psychological dimension Paul is targeting."
    },
    {
      "chapter": 14,
      "verses": [
        {
          "verse": 1,
          "text": "Welcome the person who is fragile in their convictions, but not for the purpose of passing judgment on their private reasonings.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "One person has the faith-conviction to eat anything, while the fragile person eats only vegetables.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "The one who eats everything must not look down on the one who abstains, and the one who abstains must not pass judgment on the one who eats, for God has welcomed him into his fellowship.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "Who are you to sit in judgment of someone else’s domestic servant? It is before his own master that he stands or falls. And stand he will, for the Lord has the power to make him stand.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "One person singles out one day as more important than another, while another person regards every day alike. Each should be fully convinced in their own mind.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "The one who observes a special day does so for the Lord. The one who eats everything eats for the Lord, for he gives thanks to God; and the one who abstains does so for the Lord, and he too gives thanks to God.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For none of us lives for himself, and none of us dies for himself.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "If we live, we live for the Lord; and if we die, we die for the Lord. So then, whether we live or die, we belong to the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "For this is why Christ died and came to life again: so that he might be Lord over both the dead and the living.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Why then do you judge your brother or sister? Or you, why do you look down on your brother or sister? For we will all stand before God’s tribunal.",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "For it is written: “As I live, says the Lord, every knee will bow to me, and every tongue will offer praise to God.”",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "So then, each of us will give a personal account to God.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Therefore, let us no longer pass judgment on one another. Instead, make this your judgment: never to place a stumbling block or a snare in the way of a brother or sister.",
          "paragraphStart": true
        },
        {
          "verse": 14,
          "text": "I know and am fully persuaded in the Lord Jesus that nothing is ritually unclean in itself; but if someone considers something to be unclean, to that person it is unclean.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "For if your brother or sister is distressed because of what you eat, you are no longer walking in the way of love. Do not let your food bring ruin to someone for whom Christ died.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Therefore, do not let what you consider \"good\" be spoken of as something evil.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "For the kingdom of God is not a matter of eating and drinking, but of right-standing, peace, and joy in the Holy Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 18,
          "text": "For whoever serves Christ in this way is pleasing to God and respected by people.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "So then, let us pursue the things that lead to peace and the things that build one another up.",
          "paragraphStart": true
        },
        {
          "verse": 20,
          "text": "Do not tear down the work of God for the sake of food. All things are indeed pure, but it is wrong for a person to eat if it causes someone else to stumble.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "It is better not to eat meat or drink wine or do anything that causes your brother or sister to trip, be ensnared, or be weakened.",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "The conviction you have, keep between yourself and God. Blessed is the one who does not condemn himself by what he approves.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "But the one who has doubts is condemned if he eats, because his eating does not come from conviction; and everything that does not proceed from conviction is sin.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Fragile in their convictions\" (v. 1, 2)**: The Greek *astheneō* (weak) refers here to a lack of strength or \"muscle\" in one’s faith regarding the freedom found in the Gospel. By using \"fragile\" and \"conviction,\" the translation avoids the modern connotation that \"weak faith\" means \"not believing in God enough.\" It refers specifically to a conscience that is easily wounded by certain practices (like eating non-kosher meat).\n\n**\"Private reasonings\" (v. 1)**: The phrase *dialogismōn* refers to the internal deliberations or opinions of the mind. Paul is instructing the community not to bring people in just to argue over their internal scruples.\n\n**\"Look down on\" (v. 3, 10)**: The verb *exoutheneō* literally means \"to treat as a nothing\" or \"to treat with contempt.\" It captures the attitude of the \"strong\" toward the \"weak.\"\n\n**\"Domestic servant\" (v. 4)**: The Greek *oiketēs* is more specific than the general *doulos* (slave/servant). It refers to a member of the household staff. This emphasizes the intimacy of the relationship between the believer and the Lord.\n\n**\"Tribunal\" (v. 10)**: The *bēma* was the raised platform or judgment seat where a Roman magistrate sat to hear cases. For a Roman audience, this word evoked a formal, legal setting where an account must be rendered.\n\n**\"Ritually unclean\" (v. 14)**: The Greek *koinos* literally means \"common.\" In the context of Jewish dietary laws (found in the LXX and Mark 7), it refers to food that is \"profane\" or \"ritually impure\" as opposed to \"holy\" or \"set apart\" (*hagios*). \"Unclean\" captures the cultic nuance better than \"common.\"\n\n**\"Snare\" (v. 13)**: The *skandalon* was originally the trigger-stick of a trap. It refers to something that doesn't just make one trip, but causes a total downfall or entrapment.\n\n**\"Right-standing\" (v. 17)**: *Dikaiosynē* is often translated \"righteousness,\" but in the context of the Kingdom of God and the Roman community, it refers to the state of being in right relationship—both with God and with the community.\n\n**\"Conviction\" (v. 22, 23)**: The Greek *pistis* is usually translated \"faith.\" However, in this specific ethical context regarding food and days, it refers to the personal assurance or \"trusting-conviction\" that a particular action is acceptable to God. To act against this conviction is \"sin\" because it is a violation of one's integrity before God."
    },
    {
      "chapter": 15,
      "verses": [
        {
          "verse": 1,
          "text": "Now we who are strong have an obligation to shoulder the weaknesses of those who lack strength, rather than simply living to please ourselves.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Each of us should please our neighbor for their good, to build them up.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For even the Messiah did not live to please himself; rather, as it is written: *The insults of those who insulted you have fallen upon me.*",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "For whatever was written in the past was written for our instruction, so that through endurance and through the encouragement found in the Scriptures, we might hold onto hope.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "May the God of endurance and encouragement grant you to think in harmony with one another, in accordance with Christ Jesus,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "so that with one passion and one voice you may glorify the God and Father of our Lord Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Therefore, welcome one another into your fellowship, just as the Messiah welcomed you, for the glory of God.",
          "paragraphStart": true
        },
        {
          "verse": 8,
          "text": "For I tell you that Christ has become a servant to the circumcised on behalf of God’s truthfulness, in order to confirm the promises made to the patriarchs,",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "and so that the nations might glorify God for his mercy. As it is written: *Because of this, I will acknowledge you among the nations and sing praises to your name.*",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "And again it says: *Rejoice, O nations, along with his people.*",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "And again: *Praise the Lord, all you nations, and let all the peoples extol him.*",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "And again, Isaiah says: *The Root of Jesse will appear, the one who rises to rule the nations; in him the nations will place their hope.*",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Now may the God of hope fill you with all joy and peace as you trust in him, so that you may overflow with hope by the power of the Holy Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "I myself am convinced about you, my brothers and sisters, that you are indeed full of goodness, filled with all necessary knowledge, and capable of instructing one another.",
          "paragraphStart": true
        },
        {
          "verse": 15,
          "text": "Yet I have written to you quite boldly on some points, as if to remind you again, because of the grace given to me by God",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "to be a cultic minister of Christ Jesus to the nations. I perform the priestly service of the good news of God, so that the offering of the nations may be acceptable, having been sanctified by the Holy Spirit.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Therefore, in Christ Jesus, I have reason to boast regarding my service to God.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "For I will not dare to speak of anything except what Christ has accomplished through me to bring the nations to obedience, by word and deed,",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "by the power of signs and wonders, and by the power of the Spirit. As a result, from Jerusalem and all the way around to Illyricum, I have fulfilled the proclamation of the good news of the Messiah.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "In this way, I make it my point of honor to preach the good news not where Christ has already been named, so that I do not build on someone else’s foundation.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "But as it is written: *Those who were told nothing about him will see, and those who have not heard will understand.*",
          "paragraphStart": false
        },
        {
          "verse": 22,
          "text": "This is why I have been prevented so many times from coming to you.",
          "paragraphStart": true
        },
        {
          "verse": 23,
          "text": "But now, since I no longer have a place for work in these regions, and since I have had a longing to come to you for many years,",
          "paragraphStart": false
        },
        {
          "verse": 24,
          "text": "whenever I travel to Spain, I hope to see you as I pass through and to be sent on my way there by you, once I have first enjoyed your company for a little while.",
          "paragraphStart": false
        },
        {
          "verse": 25,
          "text": "At the moment, however, I am traveling to Jerusalem to serve the holy ones.",
          "paragraphStart": false
        },
        {
          "verse": 26,
          "text": "For Macedonia and Achaia were pleased to make a contribution for the poor among the holy ones in Jerusalem.",
          "paragraphStart": false
        },
        {
          "verse": 27,
          "text": "They were pleased to do it, and indeed they are indebted to them. For if the nations have shared in their spiritual blessings, they are obligated to serve them in material things.",
          "paragraphStart": false
        },
        {
          "verse": 28,
          "text": "So when I have completed this and have safely delivered this fruit to them, I will set out for Spain by way of you.",
          "paragraphStart": false
        },
        {
          "verse": 29,
          "text": "And I know that when I come to you, I will come in the full measure of the blessing of Christ.",
          "paragraphStart": false
        },
        {
          "verse": 30,
          "text": "Now I urge you, brothers and sisters, by our Lord Jesus Christ and by the love of the Spirit, to join me in my struggle by praying to God on my behalf.",
          "paragraphStart": true
        },
        {
          "verse": 31,
          "text": "Pray that I may be rescued from those in Judea who refuse to believe, and that my service for Jerusalem may be acceptable to the holy ones there,",
          "paragraphStart": false
        },
        {
          "verse": 32,
          "text": "so that by God’s will I may come to you with joy and find rest in your company.",
          "paragraphStart": false
        },
        {
          "verse": 33,
          "text": "May the God of peace be with all of you. Amen.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Shoulder the weaknesses\" (v. 1)**: The Greek *bastazein* means to lift, carry, or endure a burden. Paul is not just suggesting tolerance but active support of the \"scrupulous\" or \"powerless\" (*adynatōn*).\n\n**\"Build them up\" (v. 2)**: *Oikodomēn* refers to the metaphor of \"edification\" as constructing a building. In Paul’s context, this is the communal strengthening of the church \"house.\"\n\n**\"The Messiah\" (v. 3, 7, 8)**: While *Christos* is often treated as a proper name, in these contexts Paul is emphasizing Jesus’s fulfillment of the Davidic and covenantal roles (referencing Ps 69, the promises to the patriarchs, and the \"Root of Jesse\").\n\n**\"One passion and one voice\" (v. 6)**: The Greek *homothymadon* suggests a shared impulse or inner heat/passion, while *en eni stomati* (with one mouth) refers to the outward liturgical expression of that unity.\n\n**\"Welcome one another\" (v. 7)**: *Proslambanesthe* means to take someone to yourself, often into your home or circle of intimacy. Given the tensions between \"weak\" and \"strong\" (Jewish and Gentile Christians), this is a call to full table-fellowship.\n\n**\"Cultic minister... priestly service... offering\" (v. 16)**: Paul uses a dense cluster of sacrificial and temple language (*leitourgon*, *hierourgounta*, *prosphora*). He envisions his missionary work as a priestly ritual where the converted Gentiles themselves are the sacrifice being presented to God.\n\n**\"Point of honor\" (v. 20)**: *Philotimoumenon* literally means \"loving honor.\" Paul views the pioneering of the gospel in unreached areas as a matter of holy ambition and dignity.\n\n**\"The holy ones\" (v. 25, 26, 31)**: Traditionally \"saints\" (*hagiois*). In the first century, this designated the members of the Messianic community as God’s \"set-apart\" people, echoing the status of Israel.\n\n**\"Safely delivered this fruit\" (v. 28)**: *Sphragisamenos* means \"to seal.\" In a commercial context, it refers to sealing a shipment to guarantee its contents and ownership. Paul is acting as the guarantor that the collection from the Gentiles reaches the Jerusalem poor intact.\n\n**\"Join me in my struggle\" (v. 30)**: *Synagōnisasthai* is a vigorous term related to athletic or combat struggle (*agōn*). Paul views prayer not as a passive wish but as an active, taxing partnership in his dangerous mission."
    },
    {
      "chapter": 16,
      "verses": [
        {
          "verse": 1,
          "text": "I introduce to you our sister Phoebe, who is a deacon of the church in Cenchreae.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Welcome her in the Lord in a manner worthy of God's holy people, and assist her in whatever matter she may require from you. For she herself has been a patron to many, including me.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Give my greetings to Prisca and Aquila, my coworkers in Christ Jesus.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "They risked their own necks for my life; I am not the only one who is grateful to them, but also all the churches of the nations.",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "Greet also the church that meets in their home. Greet my dear friend Epaenetus, who was the first harvest for Christ in the province of Asia.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Greet Mary, who has worked very hard for you.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "Greet Andronicus and Junia, my fellow Jews and my fellow prisoners; they are prominent among the apostles, and they were in Christ even before I was.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Greet Ampliatus, my dear friend in the Lord.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "Greet Urbanus, our coworker in Christ, and my dear Stachys.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "Greet Apelles, who has been tested and approved in Christ. Greet those who belong to the household of Aristobulus.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "Greet Herodion, my fellow Jew. Greet those in the household of Narcissus who are in the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "Greet Tryphaena and Tryphosa, women who labor in the Lord. Greet my dear Persis, who has labored hard in the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "Greet Rufus, a choice man in the Lord, and his mother—who has been a mother to me as well.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Greet Asyncritus, Phlegon, Hermes, Patrobas, Hermas, and the brothers and sisters with them.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Greet Philologus and Julia, Nereus and his sister, and Olympas, and all the holy people with them.",
          "paragraphStart": false
        },
        {
          "verse": 16,
          "text": "Greet one another with a holy kiss. All the churches of Christ send their greetings to you.",
          "paragraphStart": false
        },
        {
          "verse": 17,
          "text": "Now I urge you, brothers and sisters, to keep a watchful eye on those who cause divisions and create obstacles that go against the teaching you learned; turn away from them.",
          "paragraphStart": true
        },
        {
          "verse": 18,
          "text": "For such people are not enslaved to our Lord Christ, but to their own physical appetites. Through their smooth talk and flattering speech, they deceive the hearts of the guileless.",
          "paragraphStart": false
        },
        {
          "verse": 19,
          "text": "The report of your obedience has reached everyone, so I rejoice over you. But I want you to be wise regarding what is good, and innocent regarding what is evil.",
          "paragraphStart": false
        },
        {
          "verse": 20,
          "text": "The God of peace will soon crush Satan under your feet. The grace of our Lord Jesus be with you.",
          "paragraphStart": false
        },
        {
          "verse": 21,
          "text": "Timothy, my coworker, sends greetings to you, as do Lucius, Jason, and Sosipater, my fellow Jews.",
          "paragraphStart": true
        },
        {
          "verse": 22,
          "text": "I, Tertius, who penned this letter, greet you in the Lord.",
          "paragraphStart": false
        },
        {
          "verse": 23,
          "text": "Gaius, who has hosted me and the whole church, sends his greetings. Erastus, the city treasurer, and our brother Quartus greet you.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Deacon\" (v. 1)**: The Greek *diakonos* is used here with a specific church (Cenchreae), suggesting Phoebe held a recognized office or position of service. Translating this as \"servant\" in the general sense often obscures the official nature of her role in the early church.\n\n**\"Patron\" (v. 2)**: The Greek *prostatis* refers to a legal and social protector or benefactor. In the Roman world, a patron provided financial support, legal standing, and social resources to those under their care. Phoebe was not merely a \"helper\"; she was a woman of means and influence who supported the movement.\n\n**\"First harvest\" (v. 5)**: The Greek *aparchē* (literally \"firstfruit\") refers to the first portion of a harvest dedicated to God. In the context of missions, it denotes the first convert in a specific region, signifying the promise of a greater harvest to follow.\n\n**\"Prominent among the apostles\" (v. 7)**: The phrase *episēmoi en tois apostolois* most naturally signifies that Andronicus and Junia are themselves considered apostles (in the wider sense of commissioned messengers) who are highly regarded. \"Junia\" is a female name; the historical attempts to read this as a masculine name (\"Junias\") lack manuscript evidence from the first millennium.\n\n**\"Fellow Jews\" (v. 7, 11, 21)**: The Greek *syngenēs* can mean \"relative\" or \"kinsman,\" but Paul consistently uses it in Romans (cf. 9:3) to refer to his \"kin according to the flesh\"—his fellow Jewish compatriots.\n\n**\"Physical appetites\" (v. 18)**: Literally \"their own belly\" (*koilia*). In the context of Greco-Roman moral philosophy and Pauline thought, this refers to being governed by base instincts and self-interest rather than by the Spirit or the Lord.\n\n**\"Guileless\" (v. 18)**: The Greek *akakos* describes people who are innocent or unsuspecting—those who do not have evil in themselves and therefore do not easily suspect it in others.\n\n**\"Penned this letter\" (v. 22)**: Tertius was the *amanuensis* (scribe) who physically wrote the text as Paul dictated it. His insertion of a personal greeting reflects the collaborative nature of the letter's production.\n\n**Verse 24**: This verse (a repetition of the grace found in v. 20) is omitted as it is absent from the most reliable and earliest Greek manuscripts (such as P46, Sinaiticus, and Vaticanus). It was likely added by later scribes to provide a formal liturgical conclusion."
    }
  ]
}