{
  "book": "Titus",
  "chapters": [
    {
      "chapter": 1,
      "verses": [
        {
          "verse": 1,
          "text": "Paul, a slave of God and an apostle of Jesus Christ, sent to further the faith of God’s chosen people and their full knowledge of the truth that aligns with proper reverence for God.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "This mission is rooted in the hope of eternal life, which the God who cannot lie promised before the ages of time began.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "At his own appointed time, he revealed his message through the proclamation with which I was entrusted by the command of God our Savior.",
          "paragraphStart": false
        },
        {
          "verse": 4,
          "text": "To Titus, my genuine child in our common faith: Grace and peace from God the Father and Christ Jesus our Savior.",
          "paragraphStart": true
        },
        {
          "verse": 5,
          "text": "The reason I left you behind in Crete was so that you might set right what remains to be done and appoint elders in every town, just as I directed you.",
          "paragraphStart": true
        },
        {
          "verse": 6,
          "text": "An elder must be irreproachable, a man faithful to one wife, whose children are believers and are not accused of wild debauchery or rebellion.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "For as God’s household manager, an overseer must be irreproachable—not arrogant, not quick-tempered, not a heavy drinker, not a bully, and not greedy for shameful gain.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "Instead, he must be a lover of strangers, a lover of what is good, clear-minded, righteous, holy, and self-disciplined.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "He must hold firmly to the trustworthy message that aligns with the teaching, so that he may be competent both to encourage others with healthy instruction and to correct those who speak against it.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "For there are many who are rebellious, empty talkers and deceivers of the mind, especially those of the \"circumcision party.\"",
          "paragraphStart": true
        },
        {
          "verse": 11,
          "text": "It is necessary to muzzle them, because they are overturning whole households by teaching things they should not, all for the sake of shameful gain.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "One of them, a prophet of their own, said: “Cretans are always liars, evil beasts, idle bellies.”",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "This testimony is true. For this reason, correct them severely so that they may be healthy in the faith,",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "instead of devoting themselves to Jewish myths and the commands of people who turn away from the truth.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "To the pure, all things are pure; but to those who are defiled and unbelieving, nothing is pure. Rather, both their minds and their consciences have been stained.",
          "paragraphStart": true
        },
        {
          "verse": 16,
          "text": "They claim to know God, but by their actions they deny him. They are detestable, disobedient, and unfit for any good work.",
          "paragraphStart": false
        }
      ],
      "notes": "**\"Slave\" (v. 1)**: The Greek *doulos* is often softened to \"servant\" or \"bondservant,\" but in the first century, it designated a person who was the property of another. In the context of \"slave of God,\" it carries a dual nuance: it is a title of high honor reflecting the status of Moses and the prophets in the Septuagint, while simultaneously signaling Paul's total subjection to the divine will.\n\n**\"The God who cannot lie\" (v. 2)**: The Greek *ho apseudēs theos* (literally \"the non-lying God\") is a rare epithet. It serves as a deliberate rhetorical setup for the quote in verse 12, contrasting the character of God with the proverbial reputation of the Cretans as \"always liars.\"\n\n**\"Proper reverence for God\" (v. 1)**: The term *eusebeia* (traditionally \"godliness\") refers to the Greco-Roman ideal of social and religious piety—acting in a way that is appropriate toward the divine and one’s community. It is a lived-out devotion rather than an internal feeling.\n\n**\"Household manager\" (v. 7)**: The *oikonomos* was a slave or freedman responsible for managing the affairs, finances, and personnel of a large estate. This term contextualizes the \"overseer\" (*episkopos*) not as a high-ranking prelate, but as a responsible steward of God’s family property.\n\n**\"Bully\" (v. 7)**: The Greek *plēktēs* literally means \"a striker.\" While it can refer to physical violence, in this context of leadership requirements, it encompasses a person who is temperamentally prone to verbal or physical aggression to get their way.\n\n**\"Healthy instruction\" (v. 9, 13)**: The word *hygiainousē* is a medical metaphor (the root of the English \"hygiene\"). Paul uses it throughout the Pastoral Epistles to describe teaching that is life-giving and \"wholesome,\" contrasting it with the \"diseased\" or \"gangrenous\" talk of false teachers.\n\n**\"Muzzle\" (v. 11)**: The Greek *epistomizein* is a vivid term meaning to \"stop the mouth,\" often used of gagging or muzzling an animal. It implies a firm, authoritative silencing of those causing communal harm.\n\n**\"Idle bellies\" (v. 12)**: This translates *gasteres argai*. \"Bellies\" refers to those governed by their physical appetites; \"idle\" suggests a parasitic existence. It characterizes the false teachers as those who consume the resources of others without contributing anything of value.\n\n**\"Stained\" (v. 15)**: The verb *memiantai* refers to ritual or moral pollution. It suggests that their internal faculties of judgment (mind) and moral witness (conscience) have been so corrupted that they can no longer perceive what is pure.\n\n**\"Unfit\" (v. 16)**: The Greek *adokimoi* refers to something that has been tested and failed (like counterfeit coinage or ore that is rejected after being smelted). They have failed the \"assay\" of a life lived in accordance with their claim to know God."
    },
    {
      "chapter": 2,
      "verses": [
        {
          "verse": 1,
          "text": "But as for you, speak what is consistent with healthy teaching.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "Older men are to be clear-headed, dignified, and self-controlled, remaining healthy in their faith, their love, and their endurance.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "Older women, likewise, are to be reverent in their demeanor—not slanderers or enslaved to much wine, but teachers of what is good.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "In this way, they can train the younger women to love their husbands and children,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "to be self-controlled and pure, to be diligent in their homes, and to be kind and submissive to their own husbands, so that the word of God may not be slandered.",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "Similarly, urge the younger men to be self-controlled.",
          "paragraphStart": true
        },
        {
          "verse": 7,
          "text": "In everything, present yourself as a model of good works. In your teaching, show integrity and dignity,",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "using healthy speech that is beyond reproach, so that any opponent may be put to shame, having nothing evil to say about us.",
          "paragraphStart": false
        },
        {
          "verse": 9,
          "text": "Slaves are to be submissive to their own masters in all things, to be well-pleasing and not argumentative.",
          "paragraphStart": true
        },
        {
          "verse": 10,
          "text": "They must not pilfer, but rather demonstrate total and good fidelity, so that in every way they may make the teaching of God our Savior beautiful.",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "For the grace of God has appeared, bringing salvation to all people.",
          "paragraphStart": true
        },
        {
          "verse": 12,
          "text": "It trains us to renounce godlessness and worldly desires, so that we might live self-controlled, upright, and godly lives in the present age,",
          "paragraphStart": false
        },
        {
          "verse": 13,
          "text": "while we await the blessed hope—the appearing of the glory of our great God and Savior, Jesus Christ.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "He gave himself for us to redeem us from all lawlessness and to purify for himself a people for his own possession, who are zealous for good works.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Speak these things, encourage, and bring conviction with all authority. Let no one look down on you.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Healthy teaching / Healthy in faith\" (v. 1, 2, 8)**: The Greek *hygiainō* is a medical term (the root of the English \"hygiene\"). While often translated as \"sound,\" \"healthy\" better captures the author's metaphor: true teaching produces a vibrant, life-giving spiritual constitution, whereas false teaching is viewed in the Pastoral Epistles as a disease.\n\n**\"Self-controlled\" (v. 2, 4, 5, 6, 12)**: This translates various forms of *sōphron*. In the Greek world, *sophrosyne* was one of the four cardinal virtues, implying a state of mental health, sensible judgment, and the moderation of desires. It is the thematic heartbeat of this chapter.\n\n**\"Reverent in their demeanor\" (v. 3)**: The word *hieroprepēs* carries the sense of \"fitting for a priest\" or \"becoming of a holy place.\" It suggests that an older woman’s outward bearing and behavior (*katastēma*) should reflect the sanctity of a temple.\n\n**\"Slanderers\" (v. 3)**: The Greek *diabolos* literally means \"accuser\" or \"slanderer.\" While it is the word used for \"the Devil,\" in this plural context, it refers to people who engage in malicious gossip.\n\n**\"Diligent in their homes\" (v. 5)**: Following the SBLGNT reading *oikourgous*, this describes those who are \"workers at home.\" It denotes the management and care of the household, which was the primary social sphere for women in the first-century Greco-Roman world.\n\n**\"Make... beautiful\" (v. 10)**: The Greek *kosmeō* means to arrange, order, or adorn (the root of \"cosmetic\"). The image is that the ethical behavior of the most marginalized members of society—slaves—serves as the \"jewelry\" or \"ornamentation\" that makes the gospel attractive to observers.\n\n**\"It trains us\" (v. 12)**: The verb *paideuō* refers to the holistic education and discipline of a child. Grace is not merely a rescue; it is an instructor that actively shapes character through ongoing discipline.\n\n**\"Our great God and Savior, Jesus Christ\" (v. 13)**: The Greek grammar here (*Granville Sharp’s Rule*) links \"great God\" and \"Savior\" to a single referent: Jesus Christ. The translation reflects this high Christology, which would have been a direct challenge to the imperial cult (where Caesar was hailed as \"god and savior\").\n\n**\"A people for his own possession\" (v. 14)**: The term *periousios* is a direct allusion to the Septuagint (Exodus 19:5; Deuteronomy 7:6), where it describes Israel as God’s \"special treasure\" or \"valued property.\" It signals that the church is the continuation of God’s covenant people.\n\n**\"Bring conviction\" (v. 15)**: The verb *elenchō* means to cross-examine, expose, or convince someone of their error. It is more than just \"rebuking\"; it implies a pursuit of the person's conscience."
    },
    {
      "chapter": 3,
      "verses": [
        {
          "verse": 1,
          "text": "Remind them to be subject to the governing authorities and powers, to be obedient to those in leadership, and to be ready for every good work.",
          "paragraphStart": true
        },
        {
          "verse": 2,
          "text": "They must speak evil of no one and avoid being quarrelsome; instead, they should be fair-minded and yielding, demonstrating every kind of gentleness in their strength toward all people.",
          "paragraphStart": false
        },
        {
          "verse": 3,
          "text": "For we ourselves were once without understanding, disobedient, led astray, and enslaved to various cravings and pleasures. We spent our lives in malice and envy, loathsome in ourselves and hating one another.",
          "paragraphStart": true
        },
        {
          "verse": 4,
          "text": "But when the kindness and the love for humanity of God our Savior appeared,",
          "paragraphStart": false
        },
        {
          "verse": 5,
          "text": "He saved us—not because of any works in righteousness that we ourselves had done, but according to His own mercy. He did this through the bath of rebirth and the renewal produced by the Holy Spirit,",
          "paragraphStart": false
        },
        {
          "verse": 6,
          "text": "whom He poured out on us richly through Jesus Christ our Savior.",
          "paragraphStart": false
        },
        {
          "verse": 7,
          "text": "His purpose was that, having been declared righteous by His grace, we might become heirs according to the hope of eternal life.",
          "paragraphStart": false
        },
        {
          "verse": 8,
          "text": "This saying is trustworthy, and I want you to speak confidently about these matters, so that those who have put their trust in God may be careful to champion good works. These things are noble and beneficial for everyone.",
          "paragraphStart": true
        },
        {
          "verse": 9,
          "text": "But steer clear of foolish speculations, genealogies, dissensions, and legalistic fights about the Law, for they are useless and empty.",
          "paragraphStart": false
        },
        {
          "verse": 10,
          "text": "After a first and second warning, have nothing more to do with a person who causes division,",
          "paragraphStart": false
        },
        {
          "verse": 11,
          "text": "knowing that such a person has been warped and persists in sin, being self-condemned.",
          "paragraphStart": false
        },
        {
          "verse": 12,
          "text": "When I send Artemas or Tychicus to you, do your best to join me at Nicopolis, for I have decided to spend the winter there.",
          "paragraphStart": true
        },
        {
          "verse": 13,
          "text": "Diligently help Zenas the legal expert and Apollos on their journey, making sure they lack nothing.",
          "paragraphStart": false
        },
        {
          "verse": 14,
          "text": "Our people must also learn to champion good works for pressing needs, so that they do not live unproductive lives.",
          "paragraphStart": false
        },
        {
          "verse": 15,
          "text": "Everyone with me sends you greetings. Greet those who love us in the faith. Grace be with you all.",
          "paragraphStart": true
        }
      ],
      "notes": "**\"Gentleness in their strength\" (v. 2)**: The Greek *πραΰτητα* describes a virtue that is the opposite of self-assertiveness or rudeness. It is not weakness, but rather power under control or \"gentle strength,\" often used in the context of how a superior treats an inferior or how one responds to provocation.\n\n**\"Love for humanity\" (v. 4)**: The Greek *φιλανθρωπία* (philanthrōpia) is the root of the English \"philanthropy.\" In a first-century context, it described a king’s benevolent care for his subjects. Using \"love for humanity\" captures the specific Greek nuance better than the more general \"love.\"\n\n**\"Bath of rebirth\" (v. 5)**: The term *λουτροῦ* (loutrou) refers specifically to a bath or the water used for washing, often used of ritual purification. Combined with *παλιγγενεσίας* (palingenesias), which refers to a \"new birth\" or \"renewal of life\" (and even the cosmic renewal of the world), it evokes the imagery of a cleansing that initiates a completely new state of existence.\n\n**\"Champion\" (v. 8, 14)**: The verb *προΐστασθαι* (proistasthai) literally means \"to stand before\" or \"to lead.\" In the context of \"good works,\" it means more than just doing them; it implies taking the lead in them, making them a priority, or being a patron of such efforts.\n\n**\"Speculations\" (v. 9)**: The Greek *ζητήσεις* (zētēseis) refers to the kind of controversial, speculative inquiries or debates that characterized certain schools of thought or fringe religious groups of the time.\n\n**\"A person who causes division\" (v. 10)**: The term *αἱρετικὸν* (hairetikon) is the origin of the English \"heretic,\" but in the first century, it did not yet have the specific meaning of \"one who holds wrong doctrine.\" It referred to someone who creates a sect (*hairesis*) or causes a factional split within a community.\n\n**\"Legal expert\" (v. 13)**: The term *νομικὸν* (nomikon) could refer to a Roman lawyer or an expert in the Jewish Torah. Given the context of the early church and the mention of Apollos, Zenas was likely someone skilled in interpreting the Law. \"Legal expert\" covers both possibilities without the modern baggage of the word \"lawyer.\""
    }
  ]
}